{
  "_comment_meta": "=== META & GENERAL ===",
  "Last Updated": "آخر تحديث",
  "Terms Content": "باستخدامك لـ AB Control Hub، فإنك توافق على هذه الشروط. تم توفير هذه الأداة لأغراض تعليمية وللإصلاح فقط. نحن غير مسؤولين عن أي ضرر قد يلحق بذراع التحكم الخاص بك.",
  "Developer Contact": "تواصل مع المطور",
  "Ahmed Badawy": "أحمد بدوي",
  "AB Control Hub": "AB Control Hub - لوحة التحكم",
  "AB Control Hub | PS4/PS5 Controller Calibration & Test | معايرة وفحص دراعات بلايستيشن": "AB Control Hub | معايرة وفحص دراعات بلايستيشن | تطوير أحمد بدوي",
  "Developed by": "تطوير وبرمجة: ",
  "Version": "الإصدار",
  "Language": "اللغة",
  "Terms of Use": "شروط الاستخدام",
  "Privacy Policy": "سياسة الخصوصية",
  "Help": "مساعدة",
  "About": "حول",
  "About AB Control Hub": "عن AB Control Hub",
  "Close": "إغلاق",
  "Next": "التالي",
  "Back to Home": "العودة للرئيسية",
  "Done": "تمّ",
  "Cancel": "إلغاء",
  "Save": "حفظ",
  "Reset": "إعادة تعيين",
  "Connect": "اتصال",
  "Disconnect": "قطع الاتصال",
  "Connected:": "متصل:",
  "Connected to:": "متصل بـ:",
  "Click to Connect": "إضغط للإتصال",
  "Connect Controller": "توصيل ذراع التحكم",
  "Please connect a controller first": "يرجى توصيل وحدة التحكم أولًا",
  "Unsupported browser. Please use a web browser with WebHID support (e.g. Chrome).": "المتصفح غير معتمد. الرجاء استخدام متصفح يدعم WebHID (على سبيل المثال Chrome).",
  "(Supports Android via OTG or Bluetooth on Chrome)": "(يدعم أندرويد عبر OTG أو بلوتوث على كروم)",
  "(iOS and iPadOS are not supported by Apple)": "(iOS و iPadOS غير مدعومين من قبل Apple)",

  "_comment_home": "=== HOME & LANDING ===",
  "Welcome": "مرحبًا",
  "AB Control Hub Description": "AB Control Hub هو أداة متقدمة ومجانية تعتمد على الويب مصممة لفحص واختبار ومعايرة أذرع تحكم Sony PlayStation مباشرة من متصفحك. سواء كنت تعاني من انحراف العصا (stick drift) أو تريد فقط التحقق من تأخير الإدخال، فإن هذه الأداة توفر حلاً شاملاً دون الحاجة لتحميل أي برامج.",
  "AB Control Hub is an advanced, free web-based tool designed to diagnose, test, and calibrate Sony PlayStation controllers directly from your browser. Whether you are experiencing <strong>analog stick drift</strong> or just want to check your controller's input latency, this tool provides a comprehensive solution without downloading any software.": "AB Control Hub هو أداة متقدمة ومجانية تعتمد على الويب مصممة لفحص واختبار ومعايرة أذرع تحكم Sony PlayStation مباشرة من متصفحك. سواء كنت تعاني من انحراف العصا (stick drift) أو تريد فقط التحقق من تأخير الإدخال، فإن هذه الأداة توفر حلاً شاملاً دون الحاجة لتحميل أي برامج.",
  "What is AB Control Hub?": "ما هو AB Control Hub؟",
  "AB Control Hub is the ultimate Web-Based tool to test and calibrate PlayStation controllers (DualSense &amp; DualShock 4). Fix analog stick drift, measure input latency, and test buttons online without installing software.": "AB Control Hub هو الأداة المثالية المعتمدة على الويب لفحص ومعايرة أذرع تحكم بلايستيشن (DualSense و DualShock 4). قم بإصلاح انحراف الأنالوج (Drift)، وقياس تأخير الإدخال، وفحص الأزرار أونلاين دون تثبيت أي برامج.",
  "AB Control Hub is the ultimate Web-Based tool to test and calibrate PlayStation controllers.": "AB Control Hub هو الأداة المثالية المعتمدة على الويب لفحص ومعايرة أذرع تحكم بلايستيشن.",
  "Key Features": "المميزات الرئيسية",
  "Key Features Title": "المميزات الرئيسية",
  "Drift Calibration Feature": "إصلاح انحراف العصا بشكل دائم على DualSense و DualShock 4.",
  "Input Analysis Feature": "قياس معدل الاستجابة (Hz)، وتأخير الإدخال (ms)، والاهتزاز.",
  "Output Testing Feature": "اختبار محركات الاهتزاز، والمحفزات التكيفية، وألوان LED.",
  "Device Info Feature": "قراءة مستوى البطارية، وإصدار البرنامج الثابت، وتفاصيل الأجهزة.",
  "Drift Calibration:": "معايرة الانحراف:",
  "Permanently fix stick drift on DualSense and DualShock 4.": "إصلاح انحراف العصا بشكل دائم على DualSense و DualShock 4.",
  "Input Analysis:": "تحليل الإدخال:",
  "Measure Polling Rate (Hz), Input Latency (ms), and Jitter.": "قياس معدل الاستجابة (Hz)، وتأخير الإدخال (ms)، والاهتزاز.",
  "Output Testing:": "اختبار المخرجات:",
  "Vibration Test": "اختبار محركات الاهتزاز",
  "Test Vibration motors, Adaptive Triggers, and LED colors.": "اختبار محركات الاهتزاز، والمحفزات التكيفية، وألوان LED.",
  "Device Info:": "معلومات الجهاز:",
  "Read battery level, firmware version, and hardware details.": "قراءة مستوى البطارية، وإصدار البرنامج الثابت، وتفاصيل الأجهزة.",
  "Supported Controllers": "الأذرع المدعومة",
  "Supported Controllers Title": "الأذرع المدعومة",
  "DualShock 4 Support": "Sony DualShock 4 (الإصدار 1 و 2)",
  "DualSense Support": "Sony DualSense (PS5)",
  "DualSense Edge Support": "Sony DualSense Edge",
  "Sony DualShock 4 (V1 &amp; V2)": "Sony DualShock 4 (الإصدار 1 و 2)",
  "Sony DualSense (PS5)": "Sony DualSense (PS5)",
  "Sony DualSense Edge": "Sony DualSense Edge",
  "WebHID Requirement": "* ملاحظة: يتطلب متصفحًا يدعم WebHID (مثل Chrome و Edge و Opera).",
  "* Note: Requires a browser with WebHID support (Chrome, Edge, Opera).": "* ملاحظة: يتطلب متصفحًا يدعم WebHID (مثل Chrome و Edge و Opera).",
  "Works Offline After First Load (PWA)": "يعمل دون اتصال بالإنترنت بعد التحميل الأول (تطبيق ويب تقدمي)",
  "Drift Calibration &amp; Center Fix": "معايرة الانحراف (Drift) وضبط المركز",
  "Input Lag &amp; Circularity Test": "اختبار تأخير الاستجابة (Input Lag) والدائرية",
  "Vibration &amp; LED Control": "التحكم في الاهتزاز والإضاءة (LED)",
  "Supported Devices": "الأجهزة المدعومة",
  "DualShock 4 (PS4)": "DualShock 4 (PS4)",
  "DualSense (PS5) &amp; Edge": "DualSense (PS5) & Edge",
  "Generic Gamepads (Partial)": "أذرع تحكم عامة (دعم جزئي)",
  "Calibration Suite": "مجموعة المعايرة",
  "Drift Calibration &amp; Center Fix (Permanent)": "معايرة الانحراف (Drift) وضبط المركز (دائم)",
  "Privacy First: Local Processing (No Uploads)": "الخصوصية أولاً: معالجة محلية (بدون رفع بيانات)",
  "Real-time WebHID Technology (Zero Latency)": "تقنية WebHID في الوقت الفعلي (بدون تأخير)",
  "Haptic Vibration &amp; LED Testing": "اختبار الاهتزاز اللمسي والإضاءة (LED)",
  "Plug &amp; Test: No Drivers/Software Needed": "وصّل وافحص: لا يحتاج تعريفات أو برامج",
  "Supported: DualShock 4, DualSense &amp; Edge": "يدعم: DualShock 4 و DualSense و Edge",

  "_comment_guide": "=== GUIDES & DOCS ===",
  "Complete Guide to Controller Calibration": "الدليل الكامل لمعايرة وحدة التحكم",
  "This guide explains the technical details of Analog Stick Drift and how AB Control Hub uses WebHID to fix it permanently on DualSense and DualShock 4 controllers.": "يشرح هذا الدليل التفاصيل الفنية لانحراف الأنالوج (Drift) وكيف يستخدم AB Control Hub تقنية WebHID لإصلاحه نهائياً في وحدات تحكم DualSense و DualShock 4.",
  "1. Understanding Stick Drift": "١. فهم مشكلة الانحراف (Stick Drift)",
  "Stick drift is a phenomenon where your game character moves or looks around without you touching the controller. This is caused by the wear and tear of the potentiometers inside the analog stick module.": "الانحراف هو ظاهرة تتحرك فيها شخصية اللعبة أو تنظر حولها دون أن تلمس وحدة التحكم. يحدث هذا بسبب تآكل المقاومات المتغيرة داخل وحدة الأنالوج.",
  "Hardware vs. Software Drift": "الانحراف: هاردوير مقابل سوفتوير",
  "<strong>Hardware Drift:</strong> Physical damage or dust inside the sensor. While cleaning helps, the center point often shifts permanently.<br><strong>Software Calibration:</strong> This is where AB Control Hub shines. Instead of replacing the stick, we reprogram the controller's internal memory (NVS) to recognize the \"new\" center point, effectively eliminating drift without soldering.": "<strong>انحراف الهاردوير:</strong> تلف مادي أو غبار داخل المستشعر. قد يساعد التنظيف، لكن نقطة المنتصف غالباً ما تنزاح بشكل دائم.<br> <strong>المعايرة البرمجية:</strong> هنا يتألق AB Control Hub. بدلاً من استبدال الأنالوج، نعيد برمجة الذاكرة الداخلية (NVS) للتعرف على نقطة المنتصف \"الجديدة\"، مما يلغي الانحراف فعلياً دون لحام.",
  "2. How WebHID Technology Works": "٢. كيف تعمل تقنية WebHID",
  "Traditional tools like DS4Windows require installing drivers and running background services. <strong>WebHID</strong> (Web Human Interface Device) is a modern browser API that allows this website to communicate directly with your controller via USB or Bluetooth.": "تتطلب الأدوات التقليدية مثل DS4Windows تثبيت تعريفات وتشغيل خدمات في الخلفية. <strong>WebHID</strong> هي تقنية متصفح حديثة تسمح لهذا الموقع بالتواصل مباشرة مع وحدة التحكم عبر USB أو Bluetooth.",
  "<strong>Zero Latency:</strong> Commands are sent directly to the hardware.": "<strong>بدون تأخير (Zero Latency):</strong> تُرسل الأوامر مباشرة للهاردوير.",
  "<strong>Privacy First:</strong> No data is uploaded to any server. All processing happens locally in your browser.": "<strong>الخصوصية أولاً:</strong> لا يتم رفع أي بيانات لأي خادم. تتم المعالجة بالكامل محلياً في متصفحك.",
  "<strong>OS Independent:</strong> Works on Windows, Mac, Linux, and Android (via Chrome).": "<strong>مستقل عن النظام:</strong> يعمل على Windows و Mac و Linux و Android (عبر Chrome).",
  "3. Step-by-Step Calibration Guide": "٣. دليل المعايرة خطوة بخطوة",
  "Step 1: Connect Your Controller": "الخطوة ١: توصيل وحدة التحكم",
  "Use a high-quality USB data cable. While Bluetooth works for testing, we recommend USB for calibration to ensure connection stability during the writing process.": "استخدم كابل بيانات USB عالي الجودة. بينما يعمل البلوتوث للاختبار، نوصي باستخدام USB للمعايرة لضمان استقرار الاتصال أثناء عملية الكتابة.",
  "Step 2: Center Calibration": "الخطوة ٢: معايرة المنتصف",
  "Click on <strong>\"1. Calibrate stick center\"</strong>. The tool will measure the current resting position of your sticks and calculate the offset needed to make them read (0,0) again. This fixes the drift.": "اضغط على <strong>\"1. Calibrate stick center\"</strong>. ستقوم الأداة بقياس وضع السكون الحالي للعصي وحساب الإزاحة المطلوبة لجعلها تقرأ (0,0) مرة أخرى. هذا يصلح الانحراف.",
  "Step 3: Range Calibration": "الخطوة ٣: معايرة المدى",
  "Click on <strong>\"2. Calibrate stick range\"</strong>. You will be asked to rotate both sticks fully. This maps the outer edges of the analog movement, ensuring you can reach 100% speed in games in all directions (fixing \"Slow Turn\" issues).": "اضغط على <strong>\"2. Calibrate stick range\"</strong>. سيُطلب منك تدوير كلا العصي بالكامل. هذا يحدد الحواف الخارجية لحركة الأنالوج، مما يضمن وصولك لسرعة 100% في الألعاب في جميع الاتجاهات (إصلاح مشاكل \"الدوران البطيء\").",
  "4. Troubleshooting &amp; FAQ": "٤. استكشاف الأخطاء والأسئلة الشائعة",
  "<strong>Q: Is this permanent?</strong><br>A: Yes, the calibration is saved to the controller's internal memory. It works on consoles (PS4/PS5) and PC even after you close this site.": "<strong>س: هل هذا دائم؟</strong><br> ج: نعم، تُحفظ المعايرة في الذاكرة الداخلية للكنترولر. وتعمل على الكونسول (PS4/PS5) والكمبيوتر حتى بعد إغلاق الموقع.",
  "<strong>Q: My controller is not detected?</strong><br>A: Ensure you are using Google Chrome or Microsoft Edge. Close other apps like Steam or DS4Windows as they might hijack the connection.": "<strong>س: لم يتم اكتشاف الكنترولر؟</strong><br> ج: تأكد من استخدام Google Chrome أو Microsoft Edge. أغلق تطبيقات أخرى مثل Steam أو DS4Windows لأنها قد تستحوذ على الاتصال.",
  "Start Calibration Now": "ابدأ المعايرة الآن",
  "Calibration": "معايرة",
  "Stick center calibration": "معايرة تمركز العصا",
  "Calibrate stick center": "معايرة مركز الذراع",
  "Welcome to the stick center-calibration wizard!": "مرحباً بك في معالج ومصحح تمركز العصا!",
  "This tool will guide you in re-centering the analog sticks of your controller. It consists of four steps: you will be asked to move both sticks in a direction and release them.": "هذه الأداة ستوجهك في إعادة تمركز العصي ليد التحكم. تتكون من أربع خطوات، سيطلب منك تحريك كلا العصي إلى اتجاه معين وتركهما.",
  "Please be aware that, <i>once the calibration is running, it cannot be canceled</i>. Do not close this page or disconnect your controller until it is completed.": "المرجو الانتباه، <i>عند بدء المعايرة لا يمكنك إلغائها</i>. لا تغلق هذه الصفحة أو تقطع اتصال يد التحكم حتى الاكتمال.",
  "Press <b>Start</b> to begin calibration.": "اضغط <b>بدء</b> لبدء المعايرة.",
  "Step 1": "الخطوة الأولى",
  "Step 2": "الخطوة الثانية",
  "Step 3": "الخطوة الثالثة",
  "Step 4": "الخطوة الرابعة",
  "Step 1 of 4": "الخطوة 1 من 4",
  "Step 2 of 4": "الخطوة 2 من 4",
  "Step 3 of 4": "الخطوة 3 من 4",
  "Step 4 of 4": "الخطوة 4 من 4",
  "Please move both sticks to the <b>top-left corner</b> and release them.": "الرجاء حرك كلا العصي إلى <b>إعلى اليسار</b> وتركهما.",
  "When the sticks are back in the center, press <b>Continue</b>.": "عند عودة كلا العصي إلى المركز، اضغط <b>متابعة</b>.",
  "Please move both sticks to the <b>top-right corner</b> and release them.": "الرجاء حرك كلا العصي إلى <b>إعلى اليمين</b> وتركهما.",
  "Please move both sticks to the <b>bottom-left corner</b> and release them.": "الرجاء حرك كلا العصي إلى <b>أسفل اليسار</b> وتركهما.",
  "Please move both sticks to the <b>bottom-right corner</b> and release them.": "الرجاء حرك كلا العصي إلى <b>أسفل اليمين</b> وتركهما.",
  "Calibration completed successfully!": "انتهت المعايرة بنجاح!",
  "Stick calibration completed": "أكملت معايرة العصا",
  "Stick calibration failed": "فشل في معايرة العصا،",
  "Recentering the controller sticks.": "إعادة تسجيل عصا وحدة التحكم.",
  "Please do not close this window and do not disconnect your controller. ": "الرجاء عدم إغلاق هذه النافذة وعدم قطع اتصال يد التحكم. ",
  "Start": "بدء",
  "Continue": "متابعة",
  "Completed": "اكتملت",
  "You can now close this window.": "يمكنك الآن إغلاق هذه النافذة.",
  "Range calibration": "معايرة المدى",
  "Calibrate stick range": "معايرة مدى الذراع",
  "<b>The controller is now sampling data!</b>": "<b>يد التحكم تقوم الآن بأخذ عينات من البيانات!</b>",
  "Rotate the sticks slowly at least 2 times in one direction and 2 times in the other direction to cover the whole range.": "قم بتدوير العصي ببطء مرتين على الأقل في اتجاه ومرتين في الاتجاه الآخر لتغطية النطاق بالكامل.",
  "The <b>Done</b> button will unlock after at most 15 seconds. If you press <b>Done</b> without rotating the sticks, the calibration will be incomplete and you will need to repeat it.": "سيتم تفعيل زر <b>تم</b> بعد 15 ثانية كحد أقصى. إذا ضغطت على <b>تم</b> دون تدوير العصي، فستكون المعايرة غير مكتملة وستحتاج لتكرارها.",
  "Range calibration completed": "أكملت معايرة المدى",
  "Range calibration failed": "فشل في معايرة المدى،",
  "Range calibration appears to have failed. Please try again and make sure you rotate the sticks.": "يبدو أن معايرة المدى قد فشلت. يرجى المحاولة مرة أخرى والتأكد من تدوير الأذرع.",
  "After range calibration, joysticks always go in corners.": "بعد معايرة المدى, العصا دائما ستتحرك في الزوايا.",
  "This issue happens because you have clicked \"Done\" immediately after starting a range calibration.": "تحدث هذه المشكلة لأنك قمت بالنقر على \"تم\" مباشرة بعد بدء معايرة النطاق.",
  "Please read the instructions.": "يُرجى قراءة التعليمات.",
  "You have to rotate the joysticks before you press \"Done\".": "عليك تدوير عصا التحكم قبل أن تضغط على \"تم\".",
  "Make sure to touch the edges of the joystick frame and rotate slowly, preferably in each direction - clockwise and anti-clockwise.": "تحقق من لمس حواف إطار عصا التحكم وتدويرها ببطء، ويفضل أن يكون ذلك في اتجاه عقارب الساعة وعكس اتجاه عقرب الساعة.",
  "Only after you have done that, you click on \"Done\".": "فقط بعد أن تقوم بذلك، انقر فوق \"تم\".",
  "Sampling...": "أخذ العينات...",
  "Calibration in progress": "جارٍ المعايرة",
  "Storing calibration...": "خزن المعايرة...",
  "Calibration is being stored in the stick modules.": "يتم تخزين المعايرة في وحدات العصا (Modules).",
  "Finetune stick calibration": "ضبط دقيق للمعايرة",
  "Quick calibrate": "معايرة سريعة",
  "Joystick Info": "معلومات الذراع",
  "Left stick": "العصا اليسرى",
  "Right stick": "العصا اليمنى",
  "Center": "المركز",
  "Circularity": "الدائرية",
  "Deadzone": "المنطقة الميتة",
  "Check circularity": "فحص الدائرية",
  "Show raw numbers": "إظهار الأرقام الخام",
  "10x zoom": "تكبير 10x",
  "Step size": "حجم الخطوة",
  "Increase non-circularity": "زيادة عدم الدائرية",
  "Center (L1)": "المركز (L1)",
  "Circularity (R1)": "الدائرية (R1)",
  "Normal": "عادي",
  "Move the stick to select it for tuning, then without touching the stick use the D-pad buttons to adjust the center point. Flick it and adjust it again if it is off center or flickers.": "حرك العصا لاختيارها للضبط، ثم بدون لمس العصا استخدم أزرار الـ D-pad لضبط نقطة المركز. قم بنقرها وضبطها مرة أخرى إذا كانت خارج المركز أو تومض.",
  "Please release the stick to center position before adjusting with D-pad buttons.": "يرجى ترك العصا لتعود لوضع المركز قبل الضبط باستخدام أزرار الـ D-pad.",
  "Press the D-pad or face buttons in the direction you want the stick position to move.": "اضغط على أزرار الاتجاهات أو الأزرار الرئيسية في الاتجاه الذي تريد تحريك موضع العصا إليه.",
  "While holding the stick to be adjusted straight up/down/left/right, make adjustments until you see lightblue sectors in all four directions after circling the stick both left and right. Then use the": "أثناء تثبيت العصا المراد ضبطها للأعلى/الأسفل/اليسار/اليمين بشكل مستقيم، قم بإجراء التعديلات حتى ترى قطاعات زرقاء فاتحة في جميع الاتجاهات الأربعة بعد تدوير العصا لليسار واليمين. ثم استخدم الـ D-pad",
  "to increase the non-circularity.": "لزيادة عدم الدائرية.",
  "Push the stick straight up/down/left/right as far as possible.": "ادفع العصا للأعلى/الأسفل/اليسار/اليمين لأقصى حد ممكن.",
  "<strong>Average circularity error:</strong> smaller is not always better! Aim for 7-9 %.": "<strong>متوسط خطأ الدائرية:</strong> ليس دائماً الأقل هو الأفضل! استهدف نسبة 7-9 %.",
  "Learn more...": "لمعرفة المزيد...",
  "Sony controllers come from the factory calibrated to have an average circularity error of nearly 10 %, and this is now what games expect. Too perfect circularity can make movements and aim feel stiff and unresponsive in some games.": "تأتي أجهزة تحكم سوني من المصنع بمعايرة لمتوسط خطأ دائرية يقارب 10%، وهذا ما تتوقعه الألعاب الآن. الدائرية المثالية الزائدة قد تجعل الحركة والتصويب يبدوان صلبين وغير مستجيبين في بعض الألعاب.",
  "The controller is now sampling data!": "وحدة التحكم تقوم بجمع البيانات الآن!",
  "OK": "حسناً",
  "Experimental feature": "ميزة تجريبية",
  "Warning: Advanced Users Only": "تحذير: للمستخدمين المحترفين فقط",
  "Click here": "اضغط هنا",
  "DualSense Edge Calibration": "معايرة DualSense Edge",
  "Support for calibrating DualSense Edge stick modules is now available as an <b>experimental feature</b>.": "دعم معايرة وحدات عصا DualSense Edge متاح الآن كـ <b>ميزة تجريبية</b>.",
  "Please note: the stick modules on the DS Edge <b>cannot be calibrated via software alone</b>.": "يرجى ملاحظة: وحدات العصا في DS Edge <b>لا يمكن معايرتها عبر البرمجيات فقط</b>.",
  "To store a custom calibration on the stick's internal memory, a <b>hardware modification</b> is required.": "لتخزين معايرة مخصصة في الذاكرة الداخلية للعصا، يلزم إجراء <b>تعديل على الهاردوير</b>.",
  "This involves temporarily disabling write protection by applying <b>+1.8V</b> to a specific test point on each module.": "يتضمن ذلك تعطيل حماية الكتابة مؤقتاً عن طريق توصيل <b>+1.8 فولت</b> بنقطة اختبار محددة في كل وحدة.",
  "You can do this in two ways:": "يمكنك القيام بذلك بطريقتين:",
  "<b>Internally</b>: by soldering a wire from a +1.8V source to the write-protect TP.": "<b>داخلياً</b>: عن طريق لحام سلك من مصدر +1.8 فولت إلى نقطة حماية الكتابة.",
  "<b>Externally</b>: by applying +1.8V directly to the visible test point without opening the controller.": "<b>خارجياً</b>: عن طريق توصيل +1.8 فولت مباشرة بنقطة الاختبار المرئية دون فتح جهاز التحكم.",
  "This is only for advanced users. If you're not sure what you're doing, please do not attempt it.": "هذا للمستخدمين المتقدمين فقط. إذا لم تكن متأكداً مما تفعله، يرجى عدم المحاولة.",
  "More details and images": "لمزيد من التفاصيل والصور",
  "here": "هنا",
  "We are not responsible for any damage caused by attempting this modification.": "نحن غير مسؤولين عن أي أضرار ناتجة عن محاولة هذا التعديل.",
  "For more info or help, feel free to reach out on Discord.": "لمزيد من المعلومات أو المساعدة، لا تتردد في التواصل معنا عبر ديسكورد.",
  "Don't show again": "لا تظهر مجدداً",
  "Home": "الرئيسية",
  "Tests": "الاختبارات",
  "Follow these steps to calibrate your controller permanently.": "اتبع هذه الخطوات لمعايرة ذراع التحكم بشكل دائم.",
  "1. Center Calibration": "1. معايرة المركز",
  "Fix drift when sticks are idle": "إصلاح الانحراف عند السكون",
  "1. Quick Calibration": "1. معايرة سريعة",
  "Automated center fix": "إصلاح المركز تلقائياً",
  "2. Range Calibration": "2. معايرة المدى",
  "Fix sticks not reaching 100%": "حل مشكلة عدم الوصول لـ 100%",
  "3. Finetune": "3. الضبط الدقيق",
  "Manual hardware adjustment": "تعديل يدوي للقيم",
  "Input Analysis": "تحليل الإدخال",
  "Advanced Input Analysis": "تحليل الإدخال المتقدم",
  "Measure Polling Rate, Latency &amp; Jitter": "قياس معدل الاستجابة والتأخير والتذبذب",
  "Polling Rate": "معدل الاستجابة",
  "Max": "الأقصى",
  "Interval / Latency": "الفاصل الزمنية / التأخير",
  "Avg Interval": "متوسط التأخير",
  "Jitter (Stability)": "التذبذب (الاستقرار)",
  "Variance": "التباين",
  "Interval Distribution (Live Graph)": "توزيع الفواصل الزمنية (رسم مباشر)",
  "Open Analyzer": "فتح المحلل",
  "Start Test": "بدء الاختبار",
  "Stop Test": "إيقاف الاختبار",
  "Press Start to begin analysis": "اضغط بدء لبدء التحليل",
  "Move the sticks continuously in circles for accurate polling rate measurement.": "حرك الأذرع باستمرار في دوائر لقياس معدل الاستجابة بدقة.",
  "Output Tests": "اختبار المخرجات",
  "Button Test": "اختبار الأزرار",
  "Digital Buttons": "الأزرار الرقمية",
  "L2 Trigger": "زر L2",
  "R2 Trigger": "زر R2",
  "Vibration": "الاهتزاز",
  "Test Vibration": "اختبار الاهتزاز",
  "LED Color": "لون الإضاءة",
  "Red": "أحمر",
  "Green": "أخضر",
  "Blue": "أزرق",
  "Off": "إطفاء",
  "Adaptive Triggers (PS5 Only)": "المحفزات التكيفية (PS5 فقط)",
  "Adaptive Triggers (DS5)": "المحفزات التكيفية (DS5)",
  "Test Left": "اختبار اليسار",
  "Test Right": "اختبار اليمين",
  "Reset Triggers": "إعادة ضبط المحفزات",
  "Audio (DS5)": "الصوت (DS5)",
  "Audio Tests (DS5)": "اختبارات الصوت (DS5)",
  "Speaker": "السماعة",
  "Mic": "الميكروفون",
  "Touchpad Test": "اختبار لوحة اللمس",
  "Touch the pad to see feedback": "المس اللوحة لرؤية الاستجابة",
  "LX:": "LX:",
  "LY:": "LY:",
  "RX:": "RX:",
  "RY:": "RY:",
  "triangle": "مثلث",
  "circle": "دائرة",
  "cross": "إكس",
  "square": "مربع",
  "l1": "L1",
  "r1": "R1",
  "l3": "L3",
  "r3": "R3",
  "up": "فوق",
  "down": "تحت",
  "left": "يسار",
  "right": "يمين",
  "ps": "PS",
  "create": "مشاركة",
  "Share": "مشاركة",
  "options": "خيارات",
  "touchpad": "لوحة اللمس",
  "mute": "كتم",
  "Range": "المدى",
  "Circular": "دائري",
  "Square": "مربع",
  "Speak": "تحدث",
  "L Trig": "زر L2",
  "R Trig": "زر R2",
  "Controller Info": "معلومات عصا التحكم",
  "Serial Number": "الرقم التسلسلي",
  "FW Version": "إصدار البرمجيات",
  "HW Version": "إصدار العتاد",
  "SW Version": "إصدار البرمجيات",
  "Build Date": "تاريخ الإصدار",
  "FW Build Date": "تاريخ بناء الـ FW",
  "FW Type": "نوع الـ FW",
  "FW Series": "سلسلة الـ FW",
  "FW Update": "تحديث الـ FW",
  "FW Update Info": "معلومات تحديث الـ FW",
  "SBL FW Version": "إصدار SBL FW",
  "Venom FW Version": "إصدار Venom FW",
  "Spider FW Version": "إصدار Spider FW",
  "Touchpad FW Version": "إصدار FW للوحة اللمس",
  "MCU Unique ID": "معرف MCU الفريد",
  "PCBA ID": "معرف PCBA",
  "Battery Barcode": "باركود البطارية",
  "VCM Left Barcode": "باركود VCM الأيسر",
  "VCM Right Barcode": "باركود VCM الأيمن",
  "HW Model": "موديل الهاردوير",
  "Touchpad ID": "معرف لوحة اللمس",
  "Bluetooth Address": "عنوان البلوتوث",
  "Board Model": "موديل البوردة",
  "This feature is experimental.": "هذه الخاصية تجريبية.",
  "Please let me know if the board model of your controller is not detected correctly.": "من فضلك أخبرني إذا لم يتم اكتشاف نوع لوحة التحكم بشكل صحيح.",
  "Board model detection thanks to": "كشف نوع اللوحة بفضل",
  "Device Type": "نوع الجهاز",
  "original": "يد تحكم أصلية",
  "clone": "يد تحكم مقلدة",
  "unknown": "غير معلوم",
  "Sony DualShock 4 V1": "Sony DualShock 4 الإصدار الأول",
  "Sony DualShock 4 V2": "Sony DualShock 4 الإصدار الثاني",
  "Sony DualSense": "Sony DualSense",
  "Connected invalid device": "الجهاز المتصل غير صالح،",
  "The device appears to be a clone. All calibration functionality is disabled.": "يبدو أن الجهاز مقلد. تم تعطيل جميع وظائف المعايرة.",
  "This DualSense controller has outdated firmware.": "يد تحكم DualSense هذه تستخدم برمجيات قديمة.",
  "Please update the firmware and try again.": "الرجاء حدث البرمجيات وحاول مرة أخرى.",
  "Debug": "تصحيح",
  "Debug Info": "معلومات التصحيح",
  "System Control": "التحكم في النظام",
  "Software": "السوفتوير",
  "Hardware": "الهاردوير",
  "Save changes permanently": "حفظ التغييرات بشكل دائم",
  "Reboot controller": "إعادة تشغيل اليد",
  "NVS Status": "حالة الـNVS",
  "Debug buttons": "أزرار تصحيح الأخطاء",
  "Query NVS status": "حالة إستعلام NVS",
  "NVS unlock": "فتح قفل الـNVS",
  "NVS lock": "قفل الـNVS",
  "Sections below are not useful, just some debug infos or manual commands": "الأقسام أدناه ليست مفيدة، فقط بعض معلومات التصحيح أو أوامر يدوية",
  "Unknown": "غير معلوم",
  "locked": "مغلق",
  "unlocked": "مفتوح",
  "error": "خطأ",
  "Error": "خطأ،",
  "Initializing...": "تتم التهيئة...",
  "NVS Lock failed": "فشل في قفل NVS",
  "NVS Unlock failed": "فشل فتح قفل NVS",
  "Please connect only one controller at time.": "الرجاء ربط يد تحكم واحدة فقط.",
  "Changes saved successfully": "تم حفظ التغييرات بنجاح",
  "Error while saving changes": "حدث خطأ أثناء حفظ التغييرات:",
  "Info": "المعلومات",
  "Show all": "إظهار الكل",
  "30th Anniversary": "الذكرى الثلاثون",
  "Color": "اللون",
  "White": "أبيض",
  "Midnight Black": "أسود منتصف الليل",
  "Cosmic Red": "أحمر كوني",
  "Nova Pink": "وردي نوفا",
  "Galactic Purple": "بنفسجي مجري",
  "Starlight Blue": "أزرق ضوء النجوم",
  "Grey Camouflage": "رمادي مموه",
  "Volcanic Red": "أحمر بركاني",
  "Sterling Silver": "فضي استرليني",
  "Cobalt Blue": "أزرق كوبالت",
  "God of War Ragnarok": "God of War Ragnarok",
  "Spider-Man 2": "Spider-Man 2",
  "The Last of Us": "The Last of Us",
  "Astro Bot": "Astro Bot",
  "Chroma Indigo": "Chroma Indigo",
  "Chroma Pearl": "Chroma Pearl",
  "Chroma Teal": "Chroma Teal",
  "Fortnite": "Fortnite",
  "BDM-010": "BDM-010",
  "BDM-020": "BDM-020",
  "BDM-030": "BDM-030",
  "BDM-040": "BDM-040",
  "BDM-050": "BDM-050",
  "N/A": "غير متاح",
  "(DS5 Only)": "(DS5 فقط)",
  "Frequently Asked Questions": "الأسئلة الشائعة",
  "Welcome to the F.A.Q. section! Below, you'll find answers to some of the most commonly asked questions about this website. If you have any other inquiries or need further assistance, feel free to reach out to me directly. Your feedback and questions are always welcome!": "مرحبا بكم في قسم الأسئلة الشائعة، أدناه ستجد إجابات على بعض الأسئلة الأكثر شيوعا حول هذا الموقع. إذا كان لديك أي استفسارات أخرى أو تحتاج إلى المزيد من المساعدة، لا تتردد في التواصل معي مباشرة. ملاحظاتك وأسئلتك تلقى الترحيب دائماً!",
  "How does it work?": "طريقة العمل؟",
  "Behind the scenes, this website is the culmination of one year of dedicated effort in reverse-engineering DualShock controllers for fun/hobby from a random guy on the internet.": "خلف الكواليس،هذا الموقع جاء بفضل سنة من الجهد المتفاني في الهندسة العكسية ليد تحكم DualShock من أجل المتعة/الهواية من شخص عشوائي على شبكة الإنترنت.",
  "Through": "عَبْر",
  "this research": "هذه الأبحاث",
  ", it was discovered that there exist some undocumented commands on DualShock controllers that can be sent via USB and are used during factory assembly process. If these commands are sent, the controller starts the recalibration of analog sticks.": " قد اكتشفت أن هناك بعض الأوامر غير الموثّقة على يد تحكم DualShock التي يمكن إرسالها عن طريق USB واستخدامها أثناء عملية التصنيع. إذا تم إرسال هذه الأوامر، ستبدأ يد التحكم في إعادة معايرة العصا.",
  "While the primary focus of this research wasn't initially centered on recalibration, it became apparent that a service offering this capability could greatly benefit numerous individuals. And thus, here we are.": "على الرغم من أن التركيز الأساسي لهذه الأبحاث لم يكن في البداية مركزاً على إعادة المعايرة، وأصبح من الواضح أن القدرة التي توفرها هذه الخدمة يمكن أن تفيد العديد من الاشخاص. وهكذا، ها نحن هنا.",
  "Does the calibration remain effective during gameplay on PS4/PS5?": "هل تبقى المعايرة فعالة في أثناء اللعب على PS4/PS5؟",
  "Yes, if you tick the checkbox \"Write changes permanently in the controller\". In that case, the calibration is flashed directly in the controller firmware. This ensures that it remains in place regardless of the console it's connected to.": "نعم، إذا قمت بوضع علامة في مربع الاختيار \"أبقاء الكتابة بشكل دائم على يد التحكم\". في هذه الحالة، يتم تمرير المعايرة مباشرة في برمجيات يد التحكم. وهذا يضمن حفظ المعلومات في يد التحكم بغض النظر عن أي جهاز مرتبطة بها.",
  "Is this an officially endorsed service?": "هل هذه الخدمة معتمدة رسمياً؟",
  "No, this service is simply a creation by a DualShock enthusiast.": "لا، هذه الخدمة ببساطة تعبر عن شغفي وحماسي ليد التحكم.",
  "Does this website detect if a controller is a clone?": "هل يكتشف هذا الموقع ما إذا كانت يد التحكم نسخة مقلدة؟",
  "Yes, only DualShock4 at the moment. This happened because I accidentally purchased some clones, spent time identifying the differences and added this functionality to prevent future deception.": "نعم، فقط DualShock4 في الوقت الراهن. حدث ذلك لأنني اشتريت بعض النسخ المقلدة، وقضيت الوقت لتحديد الاختلافات وأضفت هذه الوظيفة لمنع الغِشّ في المستقبل.",
  "Unfortunately, the clones cannot be calibrated anyway, because they only clone the behavior of a DualShock4 during normal gameplay, not all the undocumented functionalities.": "لسوء الحظ، لا يمكن معايرة النسخ المقلدة على أي حال، لأنها تقلد فقط سلوك DualShock4 في أثناء اللعب العادي، وليس كل وظائفها.",
  "If you want to extend this detection functionality to DualSense, please ship me a fake DualSense and you'll see it in few weeks.": "إذا كنت ترغب في أضافة وظيفة الكشف هذه إلى DualSense، فيرجى شحن نسخ DualSense مقلدة إلي وستراها في غضون بضعة أسابيع.",
  "What development is in plan?": "ما هي التطورات في الخطة؟",
  "I maintain two separate to-do lists for this project, although the priority has yet to be established.": "وأحتفظ بخطتين منفصلتين لهذا المشروع، على الرغْم أنه لم يتم بعد تحديد الأولوية.",
  "The first list is about enhancing support for DualShock4 and DualSense controllers:": "القائمة الأولى تتعلق بتعزيز الدعم لـDualShock4 وDualSense:",
  "Implement calibration of L2/R2 triggers.": "أضافة معايرة لأزرار الـL2/R2.",
  "Improve detection of clones, particularly beneficial for those seeking to purchase used controllers with assurance of authenticity.": "تحسين الكشف عن النسخ المقلدة، مما يعود بفائدة لأولئك الذين يسعون إلى شراء يد تحكم مستعملة للتأكد من جودتها.",
  "Enhance user interface (e.g. provide additional controller information)": "تحسين واجهة المستخدم (مثل توفير معلومات إضافية ليد التحكم)",
  "Add support for recalibrating IMUs.": "إضافة دعم لإعادة معايرة IMUs.",
  "Additionally, explore the possibility of reviving non-functioning DualShock controllers (further discussion available on Discord for interested parties).": "وإضافة إلى ذلك، استكشاف إمكانية تصليح يد تحكم DualShock التي لا تعمل (يوجد مناقشات بشأن لك على الديسكورد للأطراف المهتمة).",
  "The second list contains new controllers I aim to support:": "وتتضمن الخطة الثانية إضافة دعم ليد تحكم:",
  "DualShock 3": "DualShock 3",
  "XBox Controllers": "يد تحكم الـXBox",
  "Each of these tasks presents both immense interest and significant time investment. To provide context, supporting a new controller typically demands 6-12 months of full-time research, alongside a stroke of good fortune.": "كل من هذه الخطتين تثير اهتماما واستثمارا كبيرا في الوقت على حد سواء. ولتوفير السياق، عادة ما يتطلب دعم يد تحكم جديدة إجراء بحوث على أساس التفرغ لمدة 6-12 شهرا، إلى جانب حظا وافر.",
  "Can I reset a permanent calibration to previous calibration?": "هل يمكنني إعادة تعيين معايرة دائمة إلى المعايرة السابقة؟",
  "No.": "لا.",
  "Can you overwrite a permanent calibration?": "هل يمكنك استبدال معايرة دائمة؟",
  "Yes. Simply do another permanent calibration.": "نعم. ببساطة قم بمعايرة دائمة أخرى.",
  "Does this software resolve stickdrift?": "هل هذا البرنامج يحلّ انحراف العصا؟",
  "Stickdrift is caused by a physical defect; namely dirt, worn potentiometer or in some cases a worn spring.": "انحراف العصا خلل مادي، مثل الأتربة أو تلف في المقاومة المتغيرة أو في بعض الحالات تلف في النابض.",
  "This software will not fix stick drift on its own if you already experience that. What it will help with, is ensuring the new joystick(s) will function properly after replacing the old one(s) to work well with.": "هذا البرنامَج لن يصلح انحراف العصا بنفسه إذا كنت قد واجهت خلل مقدّمًا. سيساعد على ضمان أن تعمل عصا التحكم الجديدة بشكل سليم بعد استبدال العصا القديمة للعمل بشكل جيد.",
  "I have noticed some controllers out of the box have worse factory calibration than if I would recalibrate them. Especially true for circularity of SCUF controllers with a unique shell.": "لاحظت أن بعض ايدي التحكم لديها معايرة مصنع أسوأ مما لو قمت بإعادة معايرتهم. وينطبق ذلك بصفة خاصة على الدوران في ايدي التحكم المقدمة من SCUF ذو الغطاء المميز.",
  "(Dualsense) Will updating the firmware reset calibration?": "(Dualsense) هل تحديث البرمجيات يسبب إعادة ضبط المعايرة؟",
  "I love this service, it helped me! How can I contribute?": "أحب هذه الخدمة، لقد ساعدتني! كيف يمكنني المساهمة؟",
  "I'm glad to hear that you found this helpful! If you're interested in contributing, here are a few ways you can help me:": "يسعدني أن أسمع أنك وجدت هذه الخدمة مفيدة! إذا كنت مهتما بالمساهمة، إليك بعض الطرق التي يمكنك أن تساعدني:",
  "Consider making a": "فكّر في",
  "donation": "التبرع",
  "Guide": "الدليل",
  "to support my late-night caffeine-fueled reverse-engineering efforts.": "لدعم جهودي في وقت متأخر من الليل في الهندسة العكسية.",
  "Ship me a controller you would love to add (send me an email for organization).": "اشحن لي يد تحكم تريد إضافتها (أرسل لي رسالة بريد إلكتروني).",
  "Translate this website in your language": "ترجمة هذا الموقع بلغتك",
  ", to help more people like you!": "، لمساعدة المزيد من الناس من أمثالك!",
  "SUPPORT &amp; FEEDBACK": "الدعم والاقتراحات",
  "Support &amp; Feedback": "الدعم والاقتراحات",
  "SUPPORT & FEEDBACK": "الدعم والاقتراحات",
  "Adaptive Triggers are only supported on PS5 controllers (DualSense).": "المحفزات التكيفية (Adaptive Triggers) مدعومة فقط في أذرع تحكم PS5 (DualSense).",
  "We are always striving to improve your experience, share your opinion or report a problem.": "نحن نسعى دائماً لتحسين تجربتك، شاركنا رأيك أو أبلغ عن مشكلة.",
  "Full Name": "الاسم بالكامل",
  "E-mail": "البريد الإلكتروني",
  "Inquiry type": "نوع الاستفسار",
  "Report a bug": "الإبلاغ عن مشكلة (Bug)",
  "Request a new feature": "اقتراح ميزة جديدة",
  "General inquiry": "استفسار عام",
  "Calibration problem": "مشكلة في المعايرة",
  "The message": "الرسالة",
  "Explain to us in detail...": "اشرح لنا بالتفصيل...",
  "Send message": "إرسال الرسالة",
  "Return to main page": "العودة للصفحة الرئيسية",
  "My handle on discord is: the_al": "معرفي على ديسكورد هو، the_al",
  "Do you have any suggestion or issue? Drop me a message via email or discord.": "هل لديك أي اقتراح أو مشكلة؟ أرسل لي رسالة عبر البريد الإلكتروني أو عبر discord.",
  "Support this project": "اِدعم هذا المشروع",
  "Hi, thank you for using this software.": "مرحباً، شكراً لك على استخدام هذا البرنامج.",
  "If you're finding it helpful and you want to support my efforts, feel free to": "إذا كنت تجد ذلك مفيداً وترغب في دعم جهودي، لا تتردد في",
  "buy me a coffee": "دعمي ماديًا",
  "! :)": "! :)",
  "Cheers!": "شكرًا!",
  "Have a nice day :)": "أتمنى لك يومًا سعيدًا :)",
  "Just few things to know before you can start:": "بعض الأشياء التي يجب أن تعرفها قبل أن تبدأ",
  "Keep the internal battery of the controller connected and ensure it is well charged. If the battery dies during operations, the controller will be damaged and rendered unusable.": "ابقي البطارية الداخلية ليد التحكم متصلة وتحقق أنها مشحونة بشكل جيد. وإذا نفذ شحن البطارية في أثناء العمليات، فإن يد التحكم ستتعرض للتلف وستصبح غير قابلة للاستعمال.",
  "Before doing the permanent calibration, try the temporary one to ensure that everything is working well.": "قبل إجراء المعايرة الدائمة، جرب المعايرة المؤقتة لضمان أن يعمل كل شيء بشكل جيد.",
  "Understood": "مفهوم",
  "Welcome to the Calibration GUI": "مرحباً بك في Calibration GUI",
  "You can check the calibration with the": "يمكنك التحقق من المعايرة من خلال",
  "_comment_legal": "=== LEGAL & COOKIES ===",
  "Terms and Conditions": "الشروط والأحكام",
  "1. Acceptance of Terms": "1. قبول الشروط",
  "By accessing and using AB Control Hub, you accept and agree to be bound by the terms and provision of this agreement.": "من خلال الوصول إلى AB Control Hub واستخدامه، فإنك تقبل وتوافق على الالتزام بشروط وأحكام هذه الاتفاقية.",
  "2. Disclaimer of Warranty": "2. إخلاء المسؤولية من الضمان",
  "The software is provided \"as is\", without warranty of any kind. Calibration operations involve writing to the controller's firmware. While this tool is tested, the user assumes all risks associated with firmware modifications.": "يتم توفير البرنامج \"كما هو\"، دون أي ضمان من أي نوع. تتضمن عمليات المعايرة الكتابة على البرنامج الثابت (Firmware) لذراع التحكم. بينما تم اختبار هذه الأداة، يتحمل المستخدم جميع المخاطر المرتبطة بتعديلات البرنامج الثابت.",
  "3. Limitation of Liability": "3. حدود المسؤولية",
  "AB Control Hub and its developer shall not be liable for any damages, including but not limited to controller damage, data loss, or bricked devices resulting from the use or inability to use this tool.": "لن تكون AB Control Hub ومطورها مسؤولين عن أي أضرار، بما في ذلك على سبيل المثال لا الحصر تلف ذراع التحكم، أو فقدان البيانات، أو تعطل الأجهزة الناتج عن استخدام أو عدم القدرة على استخدام هذه الأداة.",
  "4. Use at Your Own Risk": "4. الاستخدام على مسؤوليتك الخاصة",
  "Calibration is a sensitive process. Ensure your controller is connected via a stable USB cable and has sufficient battery charge before proceeding with permanent changes.": "المعايرة عملية حساسة. تأكد من توصيل ذراع التحكم عبر كابل USB مستقر وأن البطارية مشحونة بشكل كافٍ قبل المتابعة في إجراء تغييرات دائمة.",
  "5. Intellectual Property": "5. الملكية الفكرية",
  "AB Control Hub is an independent tool and is not affiliated with, endorsed by, or associated with Sony Interactive Entertainment, PlayStation, or any of its subsidiaries.": "AB Control Hub هي أداة مستقلة وليست تابعة لـ Sony Interactive Entertainment أو PlayStation أو أي من الشركات التابعة لها، ولا معتمدة منها.",
  "Introduction": "مقدمة",
  "At AB Control Hub, your privacy is our top priority. This Privacy Policy explains how we handle your data when you use our web-based controller calibration tool.": "في AB Control Hub، خصوصيتك هي أولويتنا القصوى. تشرح سياسة الخصوصية هذه كيفية تعاملنا مع بياناتك عند استخدام أداة معايرة ذراع التحكم المستندة إلى الويب.",
  "Local Processing (No Data Collection)": "المعالجة المحلية (لا يوجد جمع للبيانات)",
  "AB Control Hub does not collect, store, or transmit any personal data.": "لا يقوم AB Control Hub بجمع أو تخزين أو نقل أي بيانات شخصية.",
  "All communication with your controller happens locally on your device using the WebHID API. Your button presses, stick movements, and controller serial numbers never leave your browser.": "تتم جميع الاتصالات مع ذراع التحكم محلياً على جهازك باستخدام WebHID API. ضغطات الأزرار، وحركات العصا، والأرقام التسلسلية لذراع التحكم لا تغادر متصفحك أبداً.",
  "Cookies": "ملفات تعريف الارتباط (Cookies)",
  "We use essential cookies only to store your preferences, such as your selected language and whether you have accepted our terms. These cookies are stored locally on your device.": "نحن نستخدم ملفات تعريف الارتباط الأساسية فقط لتخزين تفضيلاتك، مثل لغتك المختارة وما إذا كنت قد قبلت شروطنا. يتم تخزين هذه الملفات محلياً على جهازك.",
  "Third-Party Services": "خدمات الطرف الثالث",
  "We may use basic analytics (like Google Analytics) to understand how the site is used and improve the service. These services may collect anonymous data such as your browser type and general location (country), but no personally identifiable information.": "قد نستخدم تحليلات أساسية (مثل Google Analytics) لفهم كيفية استخدام الموقع وتحسين الخدمة. قد تجمع هذه الخدمات بيانات مجهولة مثل نوع المتصفح وموقعك العام (الدولة)، ولكن لا تجمع أي معلومات شخصية.",
  "Changes to This Policy": "تغييرات على هذه السياسة",
  "We may update our Privacy Policy from time to time. We will notify you of any changes by posting the new Privacy Policy on this page.": "قد نقوم بتحديث سياسة الخصوصية الخاصة بنا من وقت لآخر. سنخطرك بأي تغييرات عن طريق نشر سياسة الخصوصية الجديدة على هذه الصفحة.",
  "Last Updated: January 14, 2026": "آخر تحديث: 14 يناير 2026",
  "This website is not affiliated with Sony, PlayStation &amp; co.": "هذا الموقع غير مرتبط بـ Sony، PlayStation &amp; co.",
  "This service is provided without warranty. Use at your own risk.": "هذه الخدمة مقدمة دون ضمان. استخدمها على مسؤوليتك.",
  "This website uses analytics to improve the service.": "يستخدم هذا الموقع التحليلات لتحسين الخدمة.",
  "Cookie Banner Text": "يستخدم هذا الموقع ملفات تعريف الارتباط لضمان حصولك على أفضل تجربة على موقعنا.",
  "Accept": "قبول",
  "Developer": "المبرمج",
  "Facebook": "فيسبوك",
  "Instagram": "إنستجرام",
  "Telegram": "تيليجرام",
  "WhatsApp": "واتساب",
  "Developer Info": "بيانات المطور",
  "Please do not close this window and do not disconnect your controller.": "من فضلك لا تغلق هذه النافذة ولا تفصل ذراع التحكم.",
  "EXPERIMENTAL": "تجريبي",
  "Support for calibrating DualSense Edge stick modules is now available as an experimental feature.": "دعم معايرة وحدات DualSense Edge متاح الآن كميزة تجريبية.",
  "Please note: the stick modules on the DS Edge <b class=\"text-cyan\">cannot be calibrated via software alone</b>.": "يرجى ملاحظة: وحدات الأنالوج في DS Edge <b class=\"text-cyan\">لا يمكن معايرتها عبر السوفتوير فقط</b>.",
  "To store a custom calibration on the stick's internal memory, a <b class=\"text-magenta\">hardware modification</b> is required.": "لحفظ المعايرة المخصصة على الذاكرة الداخلية للأنالوج، يلزم إجراء <b class=\"text-magenta\">تعديل هاردوير</b>.",
  "This involves temporarily disabling write protection by applying <b class=\"text-white\">+1.8V</b> to a specific test point on each module.": "يتضمن ذلك تعطيل حماية الكتابة مؤقتاً عن طريق توصيل <b class=\"text-white\">+1.8V</b> بنقطة اختبار محددة على كل وحدة.",
  "If you're not sure what you're doing, please do not attempt it.": "إذا لم تكن متأكداً مما تفعله، من فضلك لا تحاول القيام بذلك.",
  "Support": "دعم",
  "Support Development": "دعم التطوير",
  "Your support helps keep this project alive and free for everyone!": "دعمك يساعد في استمرار هذا المشروع مجاناً للجميع!",
  "Egypt (Local)": "مصر (محلي)",
  "International": "دولي",
  "Vodafone Cash": "فودافون كاش",
  "InstaPay (Number)": "انستا باي (رقم)",
  "InstaPay (Username/Number)": "انستا باي (اسم مستخدم/رقم)",
  "Bank Transfer (IBAN)": "تحويل بنكي (IBAN)",
  "Space for Ad": "مساحة إعلانية",
  "Triggers (PS5 Only)": "المشغلات (PS5 فقط)",
  "The Technical Guide to Controller Calibration": "الدليل التقني الشامل لمعايرة ذراع التحكم",
  "Deep dive into Analog Stick Drift, WebHID Technology, and Hardware Diagnostics.": "غوص عميق في مشاكل انحراف الأنالوج (Drift)، تقنية WebHID، وتشخيص الهاردوير.",
  "<i class=\"fas fa-microchip me-2\"></i> 1. The Science Behind Stick Drift": "<i class=\"fas fa-microchip me-2\"></i> 1. العلم وراء انحراف العصا (Stick Drift)",
  "What is a Potentiometer?": "ما هو مقياس الجهد (Potentiometer)؟",
  "Most modern controllers (DualSense, DualShock 4, Xbox) use <strong>ALPS analog stick modules</strong>. These modules rely on two potentiometers—one for the X-axis (horizontal) and one for the Y-axis (vertical). A potentiometer is essentially a variable resistor that uses a physical wiper blade sliding across a carbon track to read position.": "تستخدم معظم أذرع التحكم الحديثة (DualSense, DualShock 4, Xbox) <strong>وحدات أنالوج من نوع ALPS</strong>. تعتمد هذه الوحدات على مقياسين للجهد (Potentiometers)—واحد للمحور السيني X (أفقي) وواحد للمحور الصادي Y (رأسي). مقياس الجهد هو في الأساس مقاومة متغيرة تستخدم شفرة ماسحة تتحرك عبر مسار كربوني لقراءة الموقع.",
  "Why Does Drift Occur?": "لماذا يحدث الانحراف (Drift)؟",
  "Every time you move the stick, friction occurs. Over hundreds of hours of gameplay (like Call of Duty or FIFA), this friction causes two things:": "في كل مرة تحرك فيها الأنالوج، يحدث احتكاك. بعد مئات الساعات من اللعب (مثل Call of Duty أو FIFA)، يسبب هذا الاحتكاك شيئين:",
  "<strong>Wear of the Carbon Track:</strong> The resistive material wears down, changing the electrical resistance values.": "<strong>تآكل المسار الكربوني:</strong> تتآكل المادة المقاومة، مما يغير قيم المقاومة الكهربائية.",
  "<strong>Dust Accumulation:</strong> Conductive dust from the wear process can settle on the tracks, causing \"jitter\" or erratic signals.": "<strong>تراكم الغبار:</strong> يمكن للغبار الموصل الناتج عن التآكل أن يستقر على المسارات، مما يسبب \"رعشة\" أو إشارات غير منتظمة.",
  "When this happens, the controller reports that the stick is moving (e.g., Value +15) even when it is physically centered (Value 0). This is <strong>Stick Drift</strong>.": "عندما يحدث هذا، يرسل الكنترولر إشارة بأن العصا تتحرك (مثلاً قيمة +15) حتى وهي في المنتصف تماماً (قيمة 0). هذا هو <strong>انحراف العصا (Stick Drift)</strong>.",
  "The AB Control Hub Solution:": "الحل من AB Control Hub:",
  "Since we cannot physically repair the carbon track via software, our tool uses <strong>Firmware Level Calibration</strong>. We calculate the exact error offset of your drifted stick and write a new \"Center Point\" to the controller's permanent memory (NVS). This forces the controller to mathematically ignore the drift.": "بما أننا لا نستطيع إصلاح المسار الكربوني فيزيائياً عبر البرمجيات، تستخدم أداتنا <strong>معايرة على مستوى الفيرموير</strong>. نقوم بحساب مقدار خطأ الانحراف بدقة ونكتب \"نقطة مركز\" جديدة في الذاكرة الدائمة (NVS) لذراع التحكم. هذا يجبر الذراع رياضياً على تجاهل الانحراف.",
  "<i class=\"fas fa-network-wired me-2\"></i> 2. How WebHID Changes the Game": "<i class=\"fas fa-network-wired me-2\"></i> 2. كيف غيرت تقنية WebHID قواعد اللعبة",
  "Historically, calibrating a controller required downloading executable files (.exe), installing drivers, and risking viruses. <strong>AB Control Hub</strong> is built on the <strong>WebHID API</strong> (Web Human Interface Device), a cutting-edge browser standard.": "تاريخياً، كانت معايرة الذراع تتطلب تحميل ملفات تنفيذية (.exe)، وتثبيت تعريفات، ومخاطرة بالفيروسات. تم بناء <strong>AB Control Hub</strong> على <strong>WebHID API</strong>، وهو معيار متصفح متطور.",
  "Technical Advantages": "المزايا التقنية",
  "<strong>Direct Hardware Access:</strong> The browser communicates directly with the USB/Bluetooth HID Report Descriptors. This allows for millisecond-level precision in reading input lags.": "<strong>وصول مباشر للهاردوير:</strong> يتواصل المتصفح مباشرة مع واصفات تقارير HID عبر USB/Bluetooth. هذا يسمح بدقة تصل للميلي ثانية في قراءة تأخير الإدخال (Input Lag).",
  "<strong>Sandboxed Security:</strong> Unlike native apps, a website cannot read your files or access other hardware without explicit permission. This makes AB Control Hub significantly safer than downloading random tools.": "<strong>أمان الصندوق الرملي (Sandboxed):</strong> على عكس البرامج المثبتة، لا يمكن للموقع قراءة ملفاتك أو الوصول لأجهزة أخرى دون إذن صريح. هذا يجعل AB Control Hub أكثر أماناً بكثير من تحميل أدوات عشوائية.",
  "<strong>Cross-Platform:</strong> The underlying JavaScript code runs identically on Windows, macOS, Linux, and Android.": "<strong>متعدد المنصات:</strong> يعمل كود JavaScript الأساسي بشكل متطابق على Windows و macOS و Linux و Android.",
  "<i class=\"fas fa-search me-2\"></i> 3. Detecting Counterfeit Controllers": "<i class=\"fas fa-search me-2\"></i> 3. كشف أذرع التحكم المقلدة (Copy)",
  "The market is flooded with \"High Copy\" controllers. While they look identical to the original Sony DualSense, their internals are vastly inferior. Use our tool to spot them:": "السوق مليء بأذرع تحكم \"High Copy\". بينما تبدو مطابقة لـ Sony DualSense الأصلية، فإن مكوناتها الداخلية رديئة جداً. استخدم أداتنا لكشفها:",
  "The Circularity Test": "اختبار الدائرية (Circularity Test)",
  "Switch the joystick visualizer to <strong>\"Circularity Mode\"</strong>. Rotate your stick in a perfect circle.": "قم بتبديل عارض الجويستيك إلى <strong>\"Circularity Mode\"</strong>. قم بتدوير العصا في دائرة كاملة.",
  "<strong>Original:</strong> Average error is typically <strong>8% - 12%</strong>. The movement is smooth.": "<strong>الأصلي:</strong> نسبة الخطأ عادة ما تكون <strong>8% - 12%</strong>. الحركة تكون ناعمة وسلسة.",
  "<strong>Fake:</strong> Average error often exceeds <strong>20%</strong>. The shape may look like a square (diamond) rather than a circle, indicating cheap non-linear potentiometers.": "<strong>المقلد:</strong> نسبة الخطأ غالباً تتجاوز <strong>20%</strong>. الشكل قد يبدو كمربع (ماسي) بدلاً من دائرة، مما يدل على استخدام مقاومات رخيصة غير خطية.",
  "The Polling Rate &amp; Input Lag": "معدل الاستجابة وتأخير الإدخال (Input Lag)",
  "Original controllers via USB typically have a stable polling rate (e.g., 250Hz or 1000Hz depending on overclock). Fake controllers often have unstable polling rates, leading to input lag spikes visible in our graph.": "الأذرع الأصلية عبر USB تتميز بمعدل استجابة مستقر (مثل 250Hz أو 1000Hz). الأذرع المقلدة غالباً ما تعاني من عدم استقرار، مما يؤدي لتقطيع وتأخير يظهر في الرسم البياني.",
  "<i class=\"fas fa-sliders-h me-2\"></i> 4. Step-by-Step Calibration": "<i class=\"fas fa-sliders-h me-2\"></i> 4. المعايرة خطوة بخطوة",
  "Important:": "هام جداً:",
  "Ensure your controller is sufficiently charged and the cable is stable. Do not disconnect during the \"Save\" process.": "تأكد من شحن الذراع بشكل كافٍ وأن الكابل مستقر. لا تقم بفصل الذراع أثناء عملية \"الحفظ\".",
  "Method A: Center Calibration (Drift Fix)": "الطريقة أ: معايرة المركز (إصلاح الدريفت)",
  "This fixes sticks that move on their own.": "هذا يصلح العصي التي تتحرك من تلقاء نفسها.",
  "Go to the <strong>Calibration</strong> tab.": "اذهب إلى تبويب <strong>Calibration</strong>.",
  "Click <strong>\"Center Calibration\"</strong>.": "اضغط على <strong>\"Center Calibration\"</strong>.",
  "Follow the prompt: Rotate both sticks 3 times fully, then let go.": "اتبع التعليمات: قم بتدوير العصوين 3 مرات كاملة، ثم اتركهما.",
  "The tool will calculate the offset and apply it.": "ستقوم الأداة بحساب نسبة الخطأ وتصحيحها.",
  "Method B: Range Calibration (Deadzone Fix)": "الطريقة ب: معايرة النطاق (إصلاح المناطق الميتة)",
  "This fixes sticks that don't reach full speed (e.g., character runs slowly).": "هذا يصلح العصي التي لا تصل للسرعة القصوى (مثلاً اللاعب يجري ببطء).",
  "Click <strong>\"Range Calibration\"</strong>.": "اضغط على <strong>\"Range Calibration\"</strong>.",
  "Rotate the sticks to their absolute maximum limits in all directions.": "قم بتدوير العصي لأقصى حدودها الممكنة في جميع الاتجاهات.",
  "The tool expands the internal mapping to ensure 100% output at the edges.": "تقوم الأداة بتوسيع التعيين الداخلي لضمان وصول الإشارة لـ 100% عند الحواف.",
  "Triggers (PS5)": "المشغلات (PS5)",
  "Device Details": "تفاصيل الجهاز",
  "Device Name": "اسم الجهاز",
  "Battery Level": "مستوى البطارية",
  "Status": "الحالة",
  "No additional info available": "لا توجد معلومات إضافية",
  "Unknown Device": "جهاز غير معروف",
  "Connection Type": "نوع الاتصال",
  "Firmware Version": "إصدار النظام",
  "Advertising and Third-Party Cookies": "الإعلانات وملفات تعريف الارتباط للطرف الثالث",
  "Last Updated: January 18, 2026": "آخر تحديث: 18 يناير 2026",
  "Microphone test initiated - check your OS audio settings for input signal": "تم بدء اختبار الميكروفون - تحقق من إعدادات الصوت في نظام التشغيل الخاص بك بحثًا عن إشارة الإدخال",
  "We use third-party vendors, including Google, to serve ads based on your prior visits to our website or other websites.": "نستخدم موردين خارجيين، بما في ذلك Google، لعرض الإعلانات بناءً على زياراتك السابقة لموقعنا أو لمواقع أخرى.",
  "Google's use of advertising cookies enables it and its partners to serve ads to you based on your visit to <strong>AB Control Hub</strong> and/or other sites on the Internet.": "استخدام Google لملفات تعريف ارتباط الإعلانات يمكنها وشركاءها من عرض الإعلانات لك بناءً على زيارتك لـ <strong>AB Control Hub</strong> و/أو مواقع أخرى على الإنترنت.",
  "You may opt out of personalized advertising by visiting <a href=\"https://www.google.com/settings/ads\" target=\"_blank\" style=\"color: var(--glow-cyan);\">Google Ads Settings</a>.": "يمكنك إلغاء الاشتراك في الإعلانات المخصصة بزيارة <a href=\"https://www.google.com/settings/ads\" target=\"_blank\" style=\"color: var(--glow-cyan);\">إعدادات إعلانات Google</a>.",
  "Currently, we use <strong>Google Analytics</strong> to analyze traffic. This service transmits website traffic data to Google servers. We use this data strictly to monitor service stability and user demographics to improve the tool.": "حالياً، نستخدم <strong>Google Analytics</strong> لتحليل الزيارات. ترسل هذه الخدمة بيانات حركة المرور إلى خوادم Google. نستخدم هذه البيانات فقط لمراقبة استقرار الخدمة وتحسين الأداة.",
  "The Ultimate PlayStation Controller Tool": "الأداة الشاملة لفحص ومعايرة ذراع البلايستيشن",
  "Diagnose, Test, and Calibrate your <strong>DualSense</strong> &amp; <strong>DualShock 4</strong> controllers directly from your browser. Fix <strong>Stick Drift</strong> permanently, check input latency, and verify button functionality without installing any drivers or third-party software.": "افحص وعاير ذراعات <strong>DualSense</strong> و <strong>DualShock 4</strong> مباشرة من المتصفح. أصلح مشكلة <strong>انحراف الأنالوج (Drift)</strong> نهائياً، وافحص تأخير الاستجابة والأزرار بدون برامج.",
  "Connect Controller Now": "قم بتوصيل الذراع الآن",
  "Firmware Calibration": "معايرة النظام (Firmware)",
  "Unlike software deadzones, AB Control Hub writes calibration data directly to your controller's NVS memory. This fixes stick drift permanently across all devices, including consoles and PC.": "على عكس برامج الـ Deadzone، يقوم موقعنا بكتابة بيانات المعايرة داخل ذاكرة الذراع (NVS). هذا يصلح الدريفت نهائياً على جميع الأجهزة بما فيها الكونسول والكمبيوتر.",
  "Privacy First": "الخصوصية أولاً",
  "Powered by the WebHID API, all processing happens locally in your browser. No inputs are recorded, no data is uploaded, and no risky driver installations are required.": "يعمل الموقع بتقنية WebHID، وتتم المعالجة محلياً داخل متصفحك. لا يتم تسجيل أي مدخلات أو رفع أي بيانات، ولا تحتاج لتنصيب تعريفات خطرة.",
  "Fake Detection": "كشف التقليد",
  "Use our advanced \"Circularity Test\" to visualize potentiometer linearity. Detect counterfeit \"High Copy\" controllers that suffer from square input ranges and poor polling rates.": "استخدم اختبار الدائرية (Circularity) لكشف الدراعات المقلدة (High Copy) التي تعاني من نطاق حركة مربع ومعدل استجابة سيء.",
  "<i class=\"fas fa-book me-2 text-info\"></i>Understanding Analog Stick Drift": "<i class=\"fas fa-book me-2 text-info\"></i>فهم مشكلة انحراف الأنالوج (Drift)",
  "What causes Stick Drift?": "ما سبب انحراف الأنالوج؟",
  "Modern controllers like the DualSense and DualShock 4 use ALPS analog stick modules. These rely on potentiometers—variable resistors with physical wipers that slide across carbon tracks. Over time, friction causes two main issues:": "تستخدم الدراعات الحديثة وحدات أنالوج ALPS تعتمد على المقاومة المتغيرة. مع مرور الوقت، يسبب الاحتكاك مشكلتين رئيسيتين:",
  "<strong>Wear of the Carbon Track:</strong> Changes the electrical resistance, confusing the center point.": "<strong>تآكل المسار الكربوني:</strong> مما يغير المقاومة الكهربائية ويغير نقطة المنتصف.",
  "<strong>Dust Accumulation:</strong> Conductive debris causes \"jitter\" and erratic signals.": "<strong>تراكم الغبار:</strong> مما يسبب ذبذبة وإشارات عشوائية.",
  "When this happens, your controller reports movement even when the stick is idle. AB Control Hub calculates the error offset and updates the controller's internal calibration map to compensate for this physical wear.": "عندما يحدث هذا، يرسل الذراع إشارات حركة وهو ثابت. يقوم موقعنا بحساب نسبة الخطأ وتحديث خريطة المعايرة الداخلية للذراع لتعويض هذا التآكل.",
  "Need a step-by-step fix?": "تحتاج شرح خطوة بخطوة؟",
  "Check our Troubleshooting Guide <i class=\"fas fa-arrow-right small ms-1\"></i>": "راجع دليل الإصلاح الشامل <i class=\"fas fa-arrow-right small ms-1\"></i>",
  "<i class=\"fas fa-check-circle me-2 text-success\"></i>Supported Controllers": "<i class=\"fas fa-check-circle me-2 text-success\"></i>الأجهزة المدعومة",
  "Controller Model": "موديل الذراع",
  "Drift Calibration": "معايرة الدريفت",
  "Adaptive Triggers": "الزناد التكيفي",
  "<i class=\"fas fa-question-circle me-2 text-warning\"></i>Frequently Asked Questions": "<i class=\"fas fa-question-circle me-2 text-warning\"></i>الأسئلة الشائعة",
  "Is this tool safe for my controller?": "هل هذه الأداة آمنة؟",
  "What's New": "ما الجديد؟",
  "V2.0 Update": "تحديث V2.0",
  "Complete Redesign & New Guides": "تطوير شامل للتصميم وأدلة جديدة",
  "Complete Redesign &amp; New Guides": "تطوير شامل للتصميم وأدلة جديدة",
  "We have revamped the entire website layout for a modern look and added detailed technical guides to help you understand stick drift better.": "تم إعادة تصميم الموقع بالكامل ليكون أكثر عصرية، مع إضافة أدلة تقنية مفصلة وشروحات لمساعدتك في فهم مشاكل الأنالوج.",
  "Feature": "ميزة جديدة",
  "Circularity Test": "اختبار الدائرية",
  "Added advanced circularity testing to detect fake controllers.": "تم إضافة اختبار الدائرية المتقدم لكشف الدراعات المقلدة.",
  "Got it": "حسناً",
  "Yes. AB Control Hub uses standard HID protocols approved by the WebHID standard. The calibration process writes to the controller's non-volatile storage (NVS) in a way that mimics official Sony tools. However, as with any firmware modification, ensure your controller is charged and the cable is stable.": "نعم. يستخدم الموقع بروتوكولات HID قياسية. عملية المعايرة تحاكي أدوات سوني الرسمية. ومع ذلك، تأكد من شحن الذراع واستخدام كابل جيد.",
  "Does this work on Xbox controllers?": "هل تعمل مع دراعات Xbox؟",
  "Currently, the advanced calibration features (writing to NVS) are exclusive to Sony DualShock 4 and DualSense controllers due to their specific firmware architecture. You can still test buttons on Xbox controllers, but calibration is not supported.": "حالياً، المعايرة المتقدمة حصرية لدراعات سوني (DS4/DS5) بسبب طبيعة السوفتوير الخاص بها. يمكنك فحص أزرار Xbox ولكن لا يمكنك معايرتها.",
  "We use cookies to ensure you get the best experience on our website. By continuing, you agree to our terms.": "نحن نستخدم ملفات تعريف الارتباط لضمان أفضل تجربة لك. باستمرارك، أنت توافق على شروطنا.",
  "Blog": "المدونة",
  "<i class=\"fas fa-info-circle me-2 text-info\"></i>How AB Control Hub Works": "<i class=\"fas fa-info-circle me-2 text-info\"></i>كيف يعمل AB Control Hub",
  "AB Control Hub utilizes the advanced <strong>WebHID API</strong> (Human Interface Device) available in modern browsers like Google Chrome and Microsoft Edge. This technology allows the website to communicate directly with your game controller's firmware without requiring you to download or install any external drivers or executable files.": "يستخدم AB Control Hub واجهة <strong>WebHID API</strong> المتقدمة المتوفرة في المتصفحات الحديثة مثل Google Chrome و Microsoft Edge. تسمح هذه التقنية للموقع بالتواصل مباشرة مع الفيرموير الخاص بذراع التحكم دون الحاجة لتحميل أو تثبيت أي تعريفات خارجية أو ملفات تنفيذية.",
  "When you connect your DualSense or DualShock 4, the tool reads the raw data reports sent by the controller via USB. This includes analog stick coordinates, button states, battery levels, and sensor data. By bypassing the operating system's standard input processing, we can offer features that are typically restricted to official development kits, such as writing calibration data directly to the controller's permanent memory.": "عند توصيل DualSense أو DualShock 4، تقرأ الأداة تقارير البيانات الخام المرسلة عبر USB. يشمل ذلك إحداثيات الأنالوج، حالة الأزرار، والبطارية. بتجاوز معالجة النظام القياسية، يمكننا تقديم ميزات تقتصر عادةً على أدوات المطورين الرسمية، مثل كتابة المعايرة في الذاكرة الدائمة.",
  "<i class=\"fas fa-cogs me-2 text-warning\"></i>Hardware Calibration vs. Software Deadzones": "<i class=\"fas fa-cogs me-2 text-warning\"></i>المعايرة الهاردوير مقابل المناطق الميتة (Deadzone) البرمجية",
  "The Problem with Software Fixes": "مشكلة الحلول البرمجية",
  "Most drift \"fixes\" found online or in game settings rely on increasing the <strong>Deadzone</strong>. This software-based approach simply ignores the input from the center of the stick. While it hides the drift, it reduces the responsive range of your analog stick, making precise aiming in FPS games or subtle steering in racing simulators impossible. It is a temporary band-aid, not a cure.": "تعتمد معظم \"إصلاحات\" الانحراف الموجودة عبر الإنترنت أو في إعدادات الألعاب على زيادة <strong>المنطقة الميتة (Deadzone)</strong>. هذا النهج البرمجي يتجاهل ببساطة المدخلات من مركز العصا. بينما يخفي الانحراف، فإنه يقلل من نطاق استجابة الأنالوج، مما يجعل التصويب الدقيق في ألعاب التصويب أو التوجيه في أجهزة المحاكاة مستحيلاً. إنه ضمادة مؤقتة، وليس علاجاً.",
  "The NVS Solution": "الحل عبر NVS",
  "AB Control Hub performs <strong>Hardware-Level Calibration</strong>. By accessing the controller's Non-Volatile Storage (NVS), we calculate the exact error offset caused by potentiometer wear. We then update the controller's internal zero-point. This means the correction happens <em>inside</em> the controller itself. When you plug your controller into a PS5, PS4, or PC, it reports a perfectly centered signal with zero deadzone required.": "يقوم AB Control Hub بإجراء <strong>معايرة على مستوى الهاردوير</strong>. من خلال الوصول إلى الذاكرة غير المتطايرة (NVS)، نحسب خطأ الانحراف الدقيق الناتج عن تآكل الجهد. ثم نقوم بتحديث نقطة الصفر الداخلية. هذا يعني أن التصحيح يحدث <em>داخل</em> ذراع التحكم نفسه. عند توصيله بـ PS5 أو PS4 أو PC، فإنه يرسل إشارة مركزية مثالية دون الحاجة لمنطقة ميتة.",
  "What is the Circularity Test?": "ما هو اختبار الدائرية؟",
  "The Circularity Test measures how accurately your analog stick traces a perfect circle. Official Sony controllers typically have an average error rate of 8-12%. Counterfeit or \"High Copy\" controllers often fail this test, showing square-shaped boundaries or high error rates (above 20%). This tool helps you verify the authenticity of your gamepad.": "يقيس اختبار الدائرية مدى دقة رسم الأنالوج لدائرة مثالية. عادةً ما يكون معدل الخطأ في أجهزة سوني الرسمية 8-12%. الأجهزة المقلدة أو \"High Copy\" غالباً ما تفشل في هذا الاختبار، وتظهر حدوداً مربعة أو معدلات خطأ عالية (فوق 20%). تساعدك هذه الأداة في التحقق من أصالة جهازك.",
  "Deep dives into gamepad architecture, WebHID protocols, and firmware calibration techniques.": "مقالات متعمقة في هندسة أذرع التحكم، بروتوكولات WebHID، وتقنيات معايرة الفيرموير.",
  "<i class=\"fas fa-arrow-left me-2\"></i> Back to Home": "<i class=\"fas fa-arrow-left me-2\"></i> العودة للرئيسية",
  "Feb 8, 2026": "8 فبراير 2026",
  "Hardware Repair": "إصلاح الهاردوير",
  "The Physics of Stick Drift: Why It Happens &amp; The Real Fix": "فيزياء انحراف الأنالوج (Drift): لماذا يحدث والحل الحقيقي",
  "Stick drift is the plague of modern gaming. You're in a heated match, and suddenly your camera pans left without you touching the controller. But what is actually happening inside the hardware?": "انحراف العصا هو وباء الألعاب الحديثة. تكون في مباراة محتدمة، وفجأة تتحرك الكاميرا لليسار دون لمس الذراع. لكن ما الذي يحدث فعلياً داخل الهاردوير؟",
  "The Potentiometer Problem": "مشكلة مقياس الجهد (Potentiometer)",
  "Most modern controllers, including the DualSense and DualShock 4, use <strong>ALPS analog stick modules</strong>. These rely on potentiometers—variable resistors that use a physical wiper sliding across a carbon track to measure position. It is a friction-based system.": "تستخدم معظم أذرع التحكم الحديثة، بما في ذلك DualSense و DualShock 4، <strong>وحدات أنالوج ALPS</strong>. تعتمد هذه الوحدات على مقاييس الجهد—مقاومات متغيرة تستخدم ماسحة فيزيائية تنزلق عبر مسار كربوني لقياس الموقع. إنه نظام يعتمد على الاحتكاك.",
  "Over time, two things inevitably happen:": "مع مرور الوقت، يحدث شيئان حتميان:",
  "<strong>Carbon Wear:</strong> The wiper physically scrapes off the resistive carbon layer, changing the electrical resistance values. The controller expects \"0 Volts\" at the center, but now receives \"0.2 Volts\", interpreting it as movement.": "<strong>تآكل الكربون:</strong> تقوم الماسحة بكشط طبقة الكربون المقاومة، مما يغير قيم المقاومة الكهربائية. يتوقع المتحكم \"0 فولت\" في المركز، لكنه يتلقى الآن \"0.2 فولت\"، ويفسرها كحركة.",
  "<strong>Debris Buildup:</strong> The scraped-off carbon dust is conductive. It accumulates inside the sensor housing, creating erratic electrical jumps (jitter).": "<strong>تراكم الحطام:</strong> غبار الكربون المكشوط موصل للكهرباء. يتراكم داخل غطاء المستشعر، مما يخلق قفزات كهربائية عشوائية (Ritter/Noise).",
  "Why Software Deadzones Fail": "لماذا تفشل المناطق الميتة البرمجية",
  "Increasing the deadzone in your game settings acts as a band-aid. It tells the game to ignore the first 10-15% of stick movement. While this hides the drift, it destroys your precision. You lose the ability to make subtle movements, which is fatal in competitive FPS or racing games.": "زيادة المنطقة الميتة في إعدادات اللعبة تعمل كضمادة. تخبر اللعبة بتجاهل أول 10-15% من حركة العصا. بينما يخفي هذا الانحراف، فإنه يدمر دقتك. تفقد القدرة على القيام بحركات دقيقة، وهو أمر قاتل في الألعاب التنافسية.",
  "The Solution: NVS Calibration": "الحل: معايرة NVS",
  "AB Control Hub takes a different approach. Instead of ignoring the input, we access the controller's <strong>Non-Volatile Storage (NVS)</strong>. By measuring the exact error offset of your worn stick, we can write a new \"center point\" directly to the controller's firmware. The controller then does the math internally, sending a perfect (0,0) signal to the console. This restores full dynamic range without sacrificing precision.": "يتبنى AB Control Hub نهجاً مختلفاً. بدلاً من تجاهل الإدخال، نصل إلى <strong>الذاكرة الدائمة (NVS)</strong>. بقياس خطأ الانحراف الدقيق للعصا المتآكلة، يمكننا كتابة \"نقطة مركز\" جديدة مباشرة في فيرموير الذراع. يقوم الذراع بعد ذلك بالحسابات داخلياً، ويرسل إشارة (0,0) مثالية للكونسول. هذا يعيد النطاق الديناميكي الكامل دون التضحية بالدقة.",
  "Tech Explained": "شرح التقنية",
  "How WebHID Revolutionizes Hardware Tools": "كيف تُحدث WebHID ثورة في أدوات الهاردوير",
  "Traditionally, calibrating a controller required downloading shady .exe files or installing unsigned drivers. The <strong>WebHID API</strong> changes everything.": "تقليدياً، تتطلب معايرة الذراع تحميل ملفات .exe مشبوهة أو تثبيت تعريفات غير موقعة. <strong>WebHID API</strong> تغير كل شيء.",
  "WebHID allows Google Chrome (and Edge) to communicate directly with Human Interface Devices over USB or Bluetooth. It is strictly permission-based—the website cannot see your device until you explicitly click \"Connect\" in the browser popup.": "تسمح WebHID لـ Google Chrome (و Edge) بالتواصل مباشرة مع أجهزة الواجهة البشرية عبر USB أو بلوتوث. إنها تعتمد بشكل صارم على الأذونات—لا يمكن للموقع رؤية جهازك حتى تضغط صراحة على \"اتصال\" في نافذة المتصفح المنبثقة.",
  "For AB Control Hub, this allows us to send <strong>Feature Reports</strong> (Byte arrays) to the DualSense to trigger calibration modes that were previously only accessible to factory technicians. All of this runs locally in your browser memory; no data ever leaves your computer.": "بالنسبة لـ AB Control Hub، يسمح لنا هذا بإرسال <strong>تقارير الميزات (Feature Reports)</strong> (مصفوفات بايت) إلى DualSense لتشغيل أوضاع المعايرة التي كانت متاحة سابقاً فقط لفنيي المصنع. كل هذا يعمل محلياً في ذاكرة متصفحك؛ لا تغادر أي بيانات جهاز الكمبيوتر الخاص بك.",
  "Buyer's Guide": "دليل المشتري",
  "Spotting a Fake: The Circularity Test": "كشف التقليد: اختبار الدائرية",
  "The market is flooded with \"High Copy\" DualShock 4 controllers. They look identical to the original, but the internals are vastly inferior.": "السوق غارق بأذرع DualShock 4 المقلدة (High Copy). تبدو مطابقة للأصلية، لكن المكونات الداخلية رديئة جداً.",
  "The Square vs. Circle Test": "اختبار المربع مقابل الدائرة",
  "Original Sony controllers have high-fidelity analog to digital converters (ADCs). When you rotate the stick, it draws a near-perfect circle. Fake controllers often use cheap components that result in a \"Square\" input boundary. They physically cannot reach the diagonal corners effectively, or they snap to the axes too aggressively.": "تحتوي أجهزة سوني الأصلية على محولات تناظرية إلى رقمية (ADCs) عالية الدقة. عند تدوير العصا، ترسم دائرة شبه مثالية. تستخدم الأجهزة المزيفة غالباً مكونات رخيصة تنتج حدود إدخال \"مربعة\". لا يمكنها الوصول للزوايا القطرية بفعالية، أو تلتصق بالمحاور بقوة شديدة.",
  "Use the <strong>\"Circularity Test\"</strong> on our homepage. A genuine controller typically has an average error rate of 8-12%. If you see error rates above 20% or a square shape in the visualizer, you likely have a counterfeit device.": "استخدم <strong>\"اختبار الدائرية\"</strong> في صفحتنا الرئيسية. الذراع الأصلي عادة ما يكون لديه معدل خطأ 8-12%. إذا رأيت معدلات خطأ فوق 20% أو شكلاً مربعاً في العارض، فمن المرجح أن لديك جهازاً مقلداً.",
  "Maintenance": "الصيانة",
  "Optimizing DualSense Battery Life": "تحسين عمر بطارية DualSense",
  "The DualSense is a power-hungry beast, thanks to its haptic motors and adaptive triggers. Here are the most effective ways to squeeze extra hours out of your charge:": "يستهلك DualSense طاقة كبيرة بفضل محركات اللمس والمشغلات التكيفية. إليك أكثر الطرق فعالية للحصول على ساعات إضافية:",
  "<strong>Dim the Light Bar:</strong> Set the brightness to \"Dim\" in your PS5 settings. This simple change reduces heat and power draw.": "<strong>خفت شريط الضوء:</strong> اضبط السطوع على \"خافت\" في إعدادات PS5. هذا التغيير البسيط يقلل الحرارة واستهلاك الطاقة.",
  "<strong>Microphone Mute:</strong> The built-in mic is always listening by default. Muting it (orange light on) actually saves battery because the audio processing chip goes into a lower power state.": "<strong>كتم الميكروفون:</strong> الميكروفون المدمج يستمع دائماً بشكل افتراضي. كتمه (الضوء البرتقالي مضاء) يوفر البطارية لأن شريحة معالجة الصوت تدخل في حالة طاقة أقل.",
  "<strong>Haptic Intensity:</strong> Unless you are playing a single-player immersion game, set vibration to \"Weak\" or \"Off\" for competitive multiplayer. The motors draw significant current.": "<strong>شدة الاهتزاز:</strong> ما لم تكن تلعب لعبة قصة غامرة، اضبط الاهتزاز على \"ضعيف\" أو \"إيقاف\" في الألعاب التنافسية. المحركات تسحب تياراً كبيراً.",
  "<strong>Proper Charging:</strong> Avoid using \"Fast Chargers\" meant for phones directly into the controller's USB-C port. The high voltage negotiation can sometimes damage the power management IC (PMIC). Stick to the console's USB ports or a certified dock.": "<strong>الشحن الصحيح:</strong> تجنب استخدام \"الشواحن السريعة\" المخصصة للهواتف مباشرة في منفذ USB-C للذراع. التفاوض على الجهد العالي قد يتلف أحياناً دائرة إدارة الطاقة (PMIC). التزم بمنافذ USB للكونسول أو قاعدة شحن معتمدة.",
  "AB Control Hub Blog | Controller Tech & Fixes": "مدونة AB Control Hub | تقنيات وإصلاحات أذرع التحكم",
  "<i class=\"fas fa-check-double me-2\"></i> 0. Before You Begin": "<i class=\"fas fa-check-double me-2\"></i> 0. قبل البدء",
  "Supported Browsers": "المتصفحات المدعومة",
  "<li><i class=\"fab fa-chrome text-success me-2\"></i> Google Chrome (Recommended)</li>\n                                            <li><i class=\"fab fa-edge text-primary me-2\"></i> Microsoft Edge</li>\n                                            <li><i class=\"fab fa-opera text-danger me-2\"></i> Opera</li>": "<li><i class=\"fab fa-chrome text-success me-2\"></i> Google Chrome (موصى به)</li>\n                                            <li><i class=\"fab fa-edge text-primary me-2\"></i> Microsoft Edge</li>\n                                            <li><i class=\"fab fa-opera text-danger me-2\"></i> Opera</li>",
  "* Firefox and Safari do not support WebHID yet.": "* متصفحي Firefox و Safari لا يدعمان WebHID حالياً.",
  "Hardware Check": "فحص الهاردوير",
  "<li>Ensure your controller is <strong>Charged</strong> (at least 20%).</li>\n                                            <li>Use a <strong>Data Cable</strong>. Many cheap cables are \"Charge Only\" and won't detect the device.</li>\n                                            <li>Close other apps like <strong>DS4Windows</strong>, <strong>Steam</strong>, or <strong>Epic Games</strong> as they hijack the controller connection.</li>": "<li>تأكد من أن ذراع التحكم <strong>مشحون</strong> (على الأقل 20%).</li>\n                                            <li>استخدم <strong>كابل بيانات</strong>. العديد من الكابلات الرخيصة مخصصة \"للشحن فقط\" ولن تكتشف الجهاز.</li>\n                                            <li>أغلق التطبيقات الأخرى مثل <strong>DS4Windows</strong> أو <strong>Steam</strong> أو <strong>Epic Games</strong> لأنها تستحوذ على اتصال ذراع التحكم.</li>",
  "": "",
  "This fixes sticks that don't reach full speed.": "هذا يصلح العصي التي لا تصل للسرعة القصوى.",
  "<i class=\"fas fa-tools me-2\"></i> 5. Troubleshooting &amp; Common Issues": "<i class=\"fas fa-tools me-2\"></i> 5. استكشاف الأخطاء وإصلاحها",
  "\"No Device Selected\" or Device not showing up": "\"لم يتم تحديد جهاز\" أو الجهاز لا يظهر",
  "<ul>\n                                                <li>Make sure you are not using a \"Charge Only\" USB cable. Try a different cable.</li>\n                                                <li>Close <strong>DS4Windows</strong>, <strong>Steam</strong>, <strong>Epic Games Launcher</strong>, and <strong>GeForce Experience</strong>. These apps \"hide\" the controller from the browser (Exclusive Mode).</li>\n                                                <li>On Linux, you might need to add `udev` rules to allow Chrome to access HID devices.</li>\n                                            </ul>": "<ul>\n                                                <li>تأكد من أنك لا تستخدم كابل USB \"للشحن فقط\". جرب كابلاً مختلفاً.</li>\n                                                <li>أغلق <strong>DS4Windows</strong>، <strong>Steam</strong>، <strong>Epic Games Launcher</strong>، و <strong>GeForce Experience</strong>. هذه التطبيقات \"تخفي\" الذراع عن المتصفح (الوضع الحصري).</li>\n                                                <li>على Linux، قد تحتاج لإضافة قواعد `udev` للسماح لـ Chrome بالوصول لأجهزة HID.</li>\n                                            </ul>",
  "Calibration didn't fix the drift": "المعايرة لم تصلح الانحراف",
  "<p>If software calibration fails, the hardware damage might be too severe. Consider:</p>\n                                            <ul>\n                                                <li>Cleaning the analog stick module with compressed air (isopropyl alcohol).</li>\n                                                <li>Replacing the potentiometer sensor (requires soldering).</li>\n                                                <li>If the drift is \"jumping\" erratically, it's likely dirt/dust, not just calibration wear.</li>\n                                            </ul>": "<p>إذا فشلت المعايرة البرمجية، قد يكون الضرر المادي شديداً جداً. فكر في:</p>\n                                            <ul>\n                                                <li>تنظيف وحدة الأنالوج بالهواء المضغوط (أو كحول الأيزوبروبيل).</li>\n                                                <li>استبدال مستشعر الجهد (يتطلب لحام).</li>\n                                                <li>إذا كان الانحراف \"يقفز\" بشكل عشوائي، فغالباً ما يكون غباراً وليس مجرد تآكل.</li>\n                                            </ul>",
  "\"Access Denied\" Error": "خطأ \"تم رفض الوصول\" (Access Denied)",
  "This usually happens on Windows when another program has \"Exclusive Access\" to the device. Ensure no other controller mappers are running. Unplug and replug the controller.": "يحدث هذا عادةً في Windows عندما يمتلك برنامج آخر \"وصولاً حصرياً\" للجهاز. تأكد من عدم تشغيل برامج تعيين أزرار أخرى. افصل الذراع وأعد توصيله.",
  "Ultimate Controller Calibration Guide | Fix Stick Drift | AB Control Hub": "الدليل الشامل لمعايرة أذرع التحكم | إصلاح انحراف الأنالوج | AB Control Hub",
  "Terms of Use | AB Control Hub": "شروط الاستخدام | AB Control Hub",
  "Privacy Policy | AB Control Hub": "سياسة الخصوصية | AB Control Hub",
  "<li><i class=\"fab fa-chrome text-success me-2\"></i> Google Chrome (Recommended)</li>\n                            <li><i class=\"fab fa-edge text-primary me-2\"></i> Microsoft Edge</li>\n                            <li><i class=\"fab fa-opera text-danger me-2\"></i> Opera</li>": "<li><i class=\"fab fa-chrome text-success me-2\"></i> Google Chrome (موصى به)</li>\n                            <li><i class=\"fab fa-edge text-primary me-2\"></i> Microsoft Edge</li>\n                            <li><i class=\"fab fa-opera text-danger me-2\"></i> Opera</li>",
  "<li>Ensure your controller is <strong>Charged</strong> (at least 20%).</li>\n                            <li>Use a <strong>Data Cable</strong>. Many cheap cables are \"Charge Only\" and won't detect the device.</li>\n                            <li>Close other apps like <strong>DS4Windows</strong>, <strong>Steam</strong>, or <strong>Epic Games</strong> as they hijack the controller connection.</li>": "<li>تأكد من أن ذراع التحكم <strong>مشحون</strong> (على الأقل 20%).</li>\n                            <li>استخدم <strong>كابل بيانات</strong>. العديد من الكابلات الرخيصة مخصصة \"للشحن فقط\" ولن تكتشف الجهاز.</li>\n                            <li>أغلق التطبيقات الأخرى مثل <strong>DS4Windows</strong> أو <strong>Steam</strong> أو <strong>Epic Games</strong> لأنها تستحوذ على اتصال ذراع التحكم.</li>",
  "<strong>Dust Accumulation:</strong> Conductive dust from the wear process can settle on the tracks, causing \"jitter\" and erratic signals.": "<strong>تراكم الغبار:</strong> يمكن للغبار الموصل الناتج عن التآكل أن يستقر على المسارات، مما يسبب \"رعشة\" أو إشارات غير منتظمة.",
  "<ul>\n                                    <li>Make sure you are not using a \"Charge Only\" USB cable. Try a different cable.</li>\n                                    <li>Close <strong>DS4Windows</strong>, <strong>Steam</strong>, <strong>Epic Games Launcher</strong>, and <strong>GeForce Experience</strong>. These apps \"hide\" the controller from the browser (Exclusive Mode).</li>\n                                    <li>On Linux, you might need to add `udev` rules to allow Chrome to access HID devices.</li>\n                                </ul>": "<ul>\n                                    <li>تأكد من أنك لا تستخدم كابل USB \"للشحن فقط\". جرب كابلاً مختلفاً.</li>\n                                    <li>أغلق <strong>DS4Windows</strong>، <strong>Steam</strong>، <strong>Epic Games Launcher</strong>، و <strong>GeForce Experience</strong>. هذه التطبيقات \"تخفي\" الذراع عن المتصفح (الوضع الحصري).</li>\n                                    <li>على Linux، قد تحتاج لإضافة قواعد `udev` للسماح لـ Chrome بالوصول لأجهزة HID.</li>\n                                </ul>",
  "<p>If software calibration fails, the hardware damage might be too severe. Consider:</p>\n                                <ul>\n                                    <li>Cleaning the analog stick module with compressed air (isopropyl alcohol).</li>\n                                    <li>Replacing the potentiometer sensor (requires soldering).</li>\n                                    <li>If the drift is \"jumping\" erratically, it's likely dirt/dust, not just calibration wear.</li>\n                                </ul>": "<p>إذا فشلت المعايرة البرمجية، قد يكون الضرر المادي شديداً جداً. فكر في:</p>\n                                <ul>\n                                    <li>تنظيف وحدة الأنالوج بالهواء المضغوط (أو كحول الأيزوبروبيل).</li>\n                                    <li>استبدال مستشعر الجهد (يتطلب لحام).</li>\n                                    <li>إذا كان الانحراف \"يقفز\" بشكل عشوائي، فغالباً ما يكون غباراً وليس مجرد تآكل.</li>\n                                </ul>",
  "Support & Feedback | AB Control Hub": "الدعم والتعليقات | AB Control Hub",
  "PlayStation, DualSense, and DualShock are registered trademarks of Sony Interactive Entertainment Inc. <br> AB Control Hub is an unofficial open-source project and is not affiliated with, endorsed, or sponsored by Sony.": "PlayStation و DualSense و DualShock هي علامات تجارية مسجلة لشركة Sony Interactive Entertainment Inc.<br> AB Control Hub هو مشروع مفتوح المصدر غير رسمي وغير تابع لشركة Sony أو معتمد أو مدعوم منها.",
  "Technical Calibration Guide": "الدليل التقني للمعايرة",
  "Master your controller hardware with WebHID technology": "تحكم في جهازك باحترافية باستخدام تقنية WebHID",
  "<i class=\"fas fa-power-off me-2\"></i> 0. Preparation": "<i class=\"fas fa-power-off me-2\"></i> 0. التحضير",
  "<i class=\"fab fa-chrome me-2 text-success\"></i> Browser Support": "<i class=\"fab fa-chrome me-2 text-success\"></i> المتصفحات المدعومة",
  "<li class=\"mb-2\"><i class=\"fas fa-check text-success me-2\"></i> <strong>Google Chrome</strong> (Highly Recommended)</li> <li class=\"mb-2\"><i class=\"fas fa-check text-success me-2\"></i> Microsoft Edge</li> <li class=\"mb-2\"><i class=\"fas fa-check text-success me-2\"></i> Opera</li> <li class=\"text-muted small mt-2\"><i class=\"fas fa-times text-danger me-2\"></i> Firefox &amp; Safari (No WebHID support yet)</li>": "<li class=\"mb-2\"><i class=\"fas fa-check text-success me-2\"></i> <strong>Google Chrome</strong> (نوصي به بشدة)</li> <li class=\"mb-2\"><i class=\"fas fa-check text-success me-2\"></i> Microsoft Edge</li> <li class=\"mb-2\"><i class=\"fas fa-check text-success me-2\"></i> Opera</li> <li class=\"text-muted small mt-2\"><i class=\"fas fa-times text-danger me-2\"></i> Firefox و Safari (لا يدعمون WebHID حالياً)</li>",
  "<i class=\"fas fa-plug me-2 text-warning\"></i> Hardware Check": "<i class=\"fas fa-plug me-2 text-warning\"></i> فحص الهاردوير",
  "<li class=\"mb-2\"><i class=\"fas fa-battery-half me-2\"></i> Battery &gt; 20% Charged</li> <li class=\"mb-2\"><i class=\"fas fa-usb me-2\"></i> Use a <strong>Data Cable</strong> (Not Charge-Only)</li> <li class=\"mb-2\"><i class=\"fas fa-ban me-2 text-danger\"></i> <strong>Close Steam / DS4Windows</strong></li>": "<li class=\"mb-2\"><i class=\"fas fa-battery-half me-2\"></i> البطارية &gt; 20% مشحونة</li> <li class=\"mb-2\"><i class=\"fas fa-usb me-2\"></i> استخدم <strong>كابل بيانات</strong> (وليس للشحن فقط)</li> <li class=\"mb-2\"><i class=\"fas fa-ban me-2 text-danger\"></i> <strong>أغلق Steam / DS4Windows</strong></li>",
  "Every time you move the stick, friction occurs. Over hundreds of hours of gameplay, this friction causes wear of the carbon track and conductive dust accumulation.": "في كل مرة تحرك فيها الأنالوج، يحدث احتكاك. بعد مئات الساعات من اللعب، يسبب هذا الاحتكاك تآكلًا في المسار الكربوني وتراكم الغبار الموصل.",
  "When this happens, the controller reports movement (e.g., Value +15) even when centered (Value 0). This is <strong>Stick Drift</strong>.": "عندما يحدث هذا، يرسل الكنترولر إشارات حركة (مثل القيمة +15) حتى وهو في المنتصف (القيمة 0). هذا هو <strong>انحراف الأنالوج (Stick Drift)</strong>.",
  "Since we cannot physically repair the carbon track via software, our tool uses <strong>Firmware Level Calibration</strong>. We calculate the exact error offset of your drifted stick and write a new \"Center Point\" to the controller's permanent memory (NVS). This forces the controller to mathematically ignore the drift at a hardware level.": "بما أننا لا نستطيع إصلاح المسار الكربوني فيزيائياً عبر البرمجيات، تستخدم أداتنا <strong>معايرة مستوى الفيرموير</strong>. نقوم بحساب نسبة الخطأ بدقة للأنالوج المنحرف وكتابة \"نقطة منتصف\" جديدة في ذاكرة الكنترولر الدائمة (NVS). هذا يجبر الكنترولر رياضيًا على تجاهل الانحراف.",
  "<strong>AB Control Hub</strong> is built on the <strong>WebHID API</strong> (Web Human Interface Device). This eliminates the need for sketchy .exe downloads or drivers.": "تم بناء <strong>AB Control Hub</strong> على تقنية <strong>WebHID API</strong>. هذا يلغي الحاجة لتحميل ملفات .exe مشبوهة أو تعريفات.",
  "Direct Hardware Access": "وصول مباشر للهاردوير",
  "The browser communicates directly with the USB/Bluetooth HID Report Descriptors for millisecond precision.": "المتصفح يتواصل مباشرة مع تقارير HID عبر USB/Bluetooth لدقة تصل لأجزاء من الثانية.",
  "Sandboxed Security": "أمان معزول (Sandboxed)",
  "Unlike native apps, a website cannot read your files or access other hardware without explicit permission.": "على عكس البرامج العادية، لا يمكن للموقع قراءة ملفاتك أو الوصول لأجهزة أخرى بدون إذن صريح.",
  "Cross-Platform": "متعدد المنصات",
  "Runs identically on Windows, macOS, Linux, and Android.": "يعمل بشكل متطابق على Windows و macOS و Linux و Android.",
  "Use our advanced diagnostic tools to spot \"High Copy\" controllers.": "استخدم أدوات التشخيص المتقدمة لاكتشاف أذرع التحكم المقلدة (High Copy).",
  "Switch the visualizer to <strong>\"Circularity Mode\"</strong> and rotate your stick in a perfect circle.": "حول العرض إلى وضع <strong>\"Circularity Mode\"</strong> وقم بتدوير الأنالوج في دائرة كاملة.",
  "<strong>Original:</strong> Error avg 8% - 12%. Smooth circle shape.": "<strong>الأصلي:</strong> متوسط الخطأ 8% - 12%. شكل دائري سلس.",
  "<strong>Fake:</strong> Error &gt; 20%. Shape looks like a square/diamond.": "<strong>التقليد:</strong> الخطأ &gt; 20%. الشكل يشبه المربع أو المعين.",
  "Example of Circularity Test": "مثال لاختبار الدائرية",
  "CRITICAL WARNING:": "تحذير هام جداً:",
  "Do NOT disconnect the cable while saving. This writes to the controller's internal memory.": "لا تفصل الكابل أثناء الحفظ. يتم الكتابة الآن على الذاكرة الداخلية للكنترولر.",
  "Method A: Center Calibration": "الطريقة أ: معايرة المنتصف",
  "Fixes drift (stick moving on its own)": "يصلح الانحراف (الأنالوج يتحرك لوحده)",
  "Go to <strong>Calibration</strong> tab.": "اذهب لتبويب <strong>المعايرة (Calibration)</strong>.",
  "Rotate both sticks 3 times fully.": "لف كلا العصوين 3 مرات كاملة.",
  "The tool calculates and saves the offset.": "تقوم الأداة بحساب وحفظ نسبة الخطأ.",
  "Method B: Range Calibration": "الطريقة ب: معايرة المدى",
  "Fixes deadzones (not reaching 100% speed)": "يصلح المناطق الميتة (السرعة لا تصل لـ 100%)",
  "Push sticks to absolute edges.": "ادفع العصي لأقصى الحواف.",
  "Rotate firmly along the rim.": "لف بقوة على الحواف الخارجية.",
  "Tool expands internal mapping to 100%.": "الأداة توسع التعيين الداخلي ليصل لـ 100%.",
  "<i class=\"fas fa-tools me-2\"></i> 5. Troubleshooting": "<i class=\"fas fa-tools me-2\"></i> 5. حل المشاكل",
  "<i class=\"fas fa-question-circle me-3 text-info\"></i> \"No Device Selected\" / Not Showing Up": "<i class=\"fas fa-question-circle me-3 text-info\"></i> \"No Device Selected\" / الجهاز لا يظهر",
  "<ul class=\"mb-0\"> <li>Try a different USB cable (ensure it transmits data).</li> <li><strong>Exclusive Mode Conflict:</strong> Apps like DS4Windows, Steam, Epic Games, or GeForce Experience might be \"hiding\" the controller. Close them completely from the system tray.</li> <li>Linux Users: You may need to update `udev` rules to grant Chrome permission to access HID devices.</li> </ul>": "<ul class=\"mb-0\"> <li>جرب كابل USB آخر (تأكد أنه ينقل بيانات).</li> <li><strong>تعارض الوضع الحصري:</strong> برامج مثل DS4Windows أو Steam أو Epic Games قد \"تخفي\" الكنترولر. أغلقهم تماماً من شريط المهام.</li> <li>مستخدمي Linux: قد تحتاج لتحديث قواعد `udev` للسماح لكروم بالوصول لأجهزة HID.</li> </ul>",
  "<i class=\"fas fa-exclamation-triangle me-3 text-warning\"></i> Calibration Didn't Fix The Drift": "<i class=\"fas fa-exclamation-triangle me-3 text-warning\"></i> المعايرة لم تصلح الانحراف",
  "<p>If software calibration fails, the physical damage to the potentiometer is likely too severe.</p> <ul class=\"mb-0\"> <li>Try cleaning the module with compressed air or Isopropyl Alcohol.</li> <li>If the value \"jumps\" erratically (e.g., center -&gt; 100% -&gt; center), it is a dirty sensor, not just wear.</li> <li>Last resort: Solder a new potentiometer sensor.</li> </ul>": "<p>إذا فشلت المعايرة البرمجية، فغالباً الضرر الفيزيائي للمقاومة المتغيرة (Potentiometer) كبير جداً.</p> <ul class=\"mb-0\"> <li>حاول تنظيف الموديول بهواء مضغوط أو كحول آيزوبروبيلي.</li> <li>إذا كانت القيمة \"تقفز\" بشكل عشوائي (مثلاً: منتصف -&gt; 100% -&gt; منتصف)، فهذا يعني وجود أوساخ وليس مجرد تآكل.</li> <li>الحل الأخير: لحام حساس مقاومة جديد.</li> </ul>",
  "<i class=\"fas fa-lock me-3 text-danger\"></i> \"Access Denied\" Error": "<i class=\"fas fa-lock me-3 text-danger\"></i> خطأ \"Access Denied\"",
  "<p class=\"mb-0\">Windows has locked the device. This usually happens if you unplugged the controller while it was being used by another program. Unplug/Replug the controller and refresh the page.</p>": "<p class=\"mb-0\">ويندوز قام بقفل الجهاز. يحدث هذا عادة إذا فصلت الكنترولر أثناء استخدامه من برنامج آخر. افصل وأعد توصيل الكنترولر وحدث الصفحة.</p>",
  "Engineering Blog": "المدونة الهندسية",
  "Technical deep dives into PlayStation controller hardware and WebHID technology.": "تحليلات تقنية عميقة في هاردوير أيادي التحكم وتقنيات الويب المتطورة.",
  "Hardware Science": "علوم الهاردوير",
  "Stick Drift Physics: Why Software Fixes Fail?": "فيزياء الـ Stick Drift: لماذا تفشل الحلول البرمجية؟",
  "Scientific analysis of Potentiometer internals (Wiper & Carbon Track) and why NVS Calibration is the only permanent solution.": "تحليل علمي لتركيب الـ Potentiometer من الداخل (المؤشر وشريط الكربون) ولماذا تعتبر معايرة NVS الحل الجذري الوحيد.",
  "Read Full Article": "اقرأ المقال كاملاً",
  "WebHID API": "تقنية WebHID",
  "WebHID Tech: How Browsers Talk to USB?": "تقنية WebHID: كيف يتحدث المتصفح مع الـ USB؟",
  "A developer's guide to driverless USB access in Chrome, explaining navigator.hid functions and security sandboxing.": "دليل المبرمجين للوصول للأجهزة عبر المتصفح بدون تعريفات، شرح دوال navigator.hid والحماية الأمنية.",
  "Data Analysis": "تحليل البيانات",
  "Detecting Fake Controllers with Data": "كشف الدراعات المقلدة (High Copy) بالأرقام",
  "How to use Circularity Algorithms to spot High Copy controllers? Comparing error rates between Original Sony and Fakes.": "كيف تستخدم خوارزميات الدائرية لكشف النسخ المقلدة؟ مقارنة بالأرقام بين يدات سوني الأصلية والنسخ التجارية.",
  "Electrical Engineering": "هندسة كهربائية",
  "DualSense Battery: Power Analysis": "بطارية DualSense: تحليل استهلاك الطاقة",
  "Technical guide to charge cycles and mAh consumption of Haptics vs Microphone. How to extend your controller lifespan.": "دليل تقني لدورات الشحن واستهلاك الـ Haptics والمايكروفون. كيف تطيل عمر يد التحكم الخاصة بك؟",
  "Scientific analysis of Potentiometer internals (Wiper &amp; Carbon Track) and why NVS Calibration is the only permanent solution.": "تحليل علمي لتركيب الـ Potentiometer من الداخل (المؤشر وشريط الكربون) ولماذا تعتبر معايرة NVS الحل الجذري الوحيد.",
  "PlayStation, DualSense, and DualShock are registered trademarks of Sony Interactive Entertainment Inc. <br> AB Control Hub is an unofficial open-source project.": "PlayStation و DualSense و DualShock هي علامات تجارية مسجلة لشركة Sony Interactive Entertainment Inc. <br> مشروع AB Control Hub هو أداة مفتوحة المصدر غير رسمية.",
  "The Science of Stick Drift": "علم الـ Stick Drift (انحراف الأنالوج)",
  "Why Potentiometers fail and why \"Deadzone\" is not a fix.": "لماذا تفشل المقاومات المتغيرة ولماذا الـ Deadzone ليس حلاً.",
  "It starts as a subtle twitch in your camera angle. Then, your character starts walking to the left on their own. Stick drift is the nightmare of every gamer. But to fix it permanently, we must first understand the physics occurring inside the plastic shell.": "يبدأ الأمر باهتزاز بسيط في زاوية الكاميرا، ثم تجد شخصيتك تتحرك لليسار وحدها. انحراف الأنالوج هو كابوس كل لاعب. ولكن لإصلاحه بشكل نهائي، يجب أولاً فهم الفيزياء التي تحدث داخل الهيكل البلاستيكي.",
  "1. Anatomy of an Analog Stick": "1. تشريح وحدة الأنالوج",
  "Most modern controllers, including the DualSense and DualShock 4, use joystick modules manufactured by <strong>ALPS Alpine</strong>. These are not digital switches; they are analog components based on a technology called the <strong>Potentiometer</strong>.": "تستخدم معظم وحدات التحكم الحديثة، بما في ذلك DualSense و DualShock 4، وحدات جويستيك من تصنيع شركة <strong>ALPS Alpine</strong>. هذه ليست أزراراً رقمية؛ بل هي مكونات تماثلية تعتمد على تقنية تسمى <strong>المقاومة المتغيرة (Potentiometer)</strong>.",
  "Fig 1. The internal carbon track (Resistive Element) and the metal Wiper.": "شكل 1. شريط الكربون الداخلي (عنصر المقاومة) والذراع المعدني (Wiper).",
  "The mechanism relies on two key parts:": "تعتمد الآلية على جزأين رئيسيين:",
  "The Resistive Track:": "شريط المقاومة:",
  "A semicircular strip made of Carbon, which acts as a resistor.": "شريط نصف دائري مصنوع من الكربون، يعمل كمقاومة كهربائية.",
  "The Wiper:": "المؤشر (Wiper):",
  "A small metal arm that slides physically across the carbon track when you move the stick.": "ذراع معدني صغير ينزلق فيزيائياً عبر شريط الكربون عند تحريك العصا.",
  "The Voltage Divider Principle": "مبدأ مقسم الجهد (Voltage Divider)",
  "Electrically, the joystick acts as a voltage divider. The console reads the voltage output ($V_{out}$) which changes based on the wiper's position on the resistive track. <br><br> $$V_{out} = V_{in} \\times \\frac{R_2}{R_1 + R_2}$$ <br> When the wiper is perfectly centered, the resistance should be balanced. Drift happens when this balance is lost.": "كهربائياً، يعمل الجويستيك كمقسم للجهد. يقرأ الكونسول جهد الخرج ($V_{out}$) الذي يتغير بناءً على موقع المؤشر على شريط المقاومة. <br><br> $$V_{out} = V_{in} \\times \\frac{R_2}{R_1 + R_2}$$ <br> عندما يكون المؤشر في المنتصف تماماً، يجب أن تكون المقاومة متوازنة. يحدث الانحراف عندما يختل هذا التوازن.",
  "2. The Physics of Failure": "2. فيزياء العطل",
  "Friction is the enemy. Every time you move the stick, the metal wiper scrapes against the carbon track. Over hundreds of hours of gameplay, two things happen:": "الاحتكاك هو العدو. في كل مرة تحرك فيها العصا، يحتك المؤشر المعدني بشريط الكربون. خلال مئات الساعات من اللعب، يحدث شيئان:",
  "Wear:": "التآكل:",
  "The carbon layer physically thins out, changing its electrical resistance.": "تترقق طبقة الكربون فيزيائياً، مما يغير مقاومتها الكهربائية.",
  "Debris:": "الرواسب:",
  "Microscopic carbon dust accumulates, creating \"phantom\" conductive paths.": "يتراكم غبار الكربون المجهري، مما يخلق مسارات توصيل \"وهمية\".",
  "This causes the sensor to report a voltage value (e.g., 2.6V) even when the stick is physically centered (which should be 2.5V). The console interprets this extra voltage as \"Movement\".": "يتسبب هذا في أن يرسل المستشعر قيمة جهد (مثلاً 2.6 فولت) حتى عندما تكون العصا في المنتصف (التي يجب أن تكون 2.5 فولت). يفسر الكونسول هذا الجهد الزائد على أنه \"حركة\".",
  "3. Why \"Deadzone\" is NOT a Fix": "3. لماذا الـ \"Deadzone\" ليس حلاً",
  "Most games and tutorials suggest increasing the <strong>Deadzone</strong>. This is a software filter that tells the game: <em>\"Ignore any input below 10%.\"</em>": "تقترح معظم الألعاب والشروحات زيادة <strong>المنطقة الميتة (Deadzone)</strong>. هذا فلتر برمجي يخبر اللعبة: <em>\"تجاهلي أي إدخال أقل من 10%.\"</em>",
  "Fig 2. Deadzone (Red) kills responsiveness. Calibration (Green) restores linearity.": "شكل 2. المنطقة الميتة (أحمر) تقتل الاستجابة. المعايرة (أخضر) تعيد الاستجابة الخطية.",
  "While this stops the camera from moving on its own, it comes at a heavy cost:": "بينما يوقف هذا تحرك الكاميرا وحدها، إلا أنه يأتي بتكلفة باهظة:",
  "Loss of Precision:": "فقدان الدقة:",
  "You lose the ability to make fine, subtle movements.": "تفقد القدرة على القيام بحركات دقيقة وبسيطة.",
  "Input Lag Feeling:": "شعور بتأخر الاستجابة:",
  "You have to push the stick further before the character reacts.": "يجب عليك دفع العصا لمسافة أبعد قبل أن تستجيب الشخصية.",
  "4. The NVS Calibration Solution": "4. حل المعايرة عبر NVS",
  "This is where <a href=\"../index.html\" class=\"text-info\">AB Control Hub</a> differs. Instead of ignoring the error, we fix it at the source.": "هنا يختلف <a href=\"../index.html\" class=\"text-info\">AB Control Hub</a>. بدلاً من تجاهل الخطأ، نقوم بإصلاحه من المصدر.",
  "Modern controllers have an internal memory chip called <strong>NVS (Non-Volatile Storage)</strong>. This chip stores the \"Zero Point\" calibration data. Our tool calculates the exact error offset caused by the wear in your specific controller and writes a new \"Center\" value directly to the NVS.": "تحتوي وحدات التحكم الحديثة على شريحة ذاكرة داخلية تسمى <strong>NVS</strong>. تخزن هذه الشريحة بيانات \"نقطة الصفر\". تقوم أداتنا بحساب مقدار الخطأ الناتج عن التآكل في ذراعك بدقة، وتكتب قيمة \"منتصف\" جديدة مباشرة داخل الـ NVS.",
  "The result? A controller that is perfectly centered at the hardware level, with <strong>Zero Deadzone</strong> required.": "النتيجة؟ وحدة تحكم معايرة تماماً على مستوى الهاردوير، مع <strong>صفر منطقة ميتة</strong>.",
  "Ready to fix your controller?": "جاهز لإصلاح ذراع التحكم؟",
  "Don't throw away your DualSense. Calibrate it now directly in your browser.": "لا تتخلص من ذراع DualSense. قم بمعايرته الآن مباشرة من متصفحك.",
  "Start Calibration Tool": "ابدأ أداة المعايرة",
  "WebHID: How Browsers Talk to Hardware": "WebHID: كيف تتحدث المتصفحات مع الهاردوير؟",
  "No drivers. No installation. Just pure JavaScript magic.": "بدون تعريفات. بدون تثبيت برامج. فقط سحر الجافاسكربت.",
  "WebHID API Explained: Driverless USB for the Web | AB Control Hub": "شرح WebHID API: توصيل USB عبر الويب بدون تعريفات | AB Control Hub",
  "For decades, accessing hardware like game controllers required installing heavy drivers or third-party software (like DS4Windows). The <strong>WebHID API</strong> changed everything. It allows a website to communicate directly with Human Interface Devices (HID) securely.": "لعقود طويلة، كان الوصول لأجهزة مثل أذرع التحكم يتطلب تثبيت تعريفات ثقيلة أو برامج طرف ثالث (مثل DS4Windows). غيَّرت <strong>WebHID API</strong> كل شيء. فهي تسمح للموقع بالتواصل مباشرة مع أجهزة HID بشكل آمن.",
  "1. What is WebHID?": "1. ما هي تقنية WebHID؟",
  "WebHID (Human Interface Device) is a modern browser API that gives JavaScript access to USB devices that were previously inaccessible. This is the technology powering <strong>AB Control Hub</strong>, allowing us to read your analog stick data and write calibration fixes directly to the controller's firmware.": "WebHID هي واجهة برمجية حديثة تمنح الجافاسكربت صلاحية الوصول لأجهزة USB التي لم يكن ممكناً الوصول لها سابقاً. هذه التقنية هي المحرك الأساسي لموقع <strong>AB Control Hub</strong>، مما يسمح لنا بقراءة بيانات الأنالوج وكتابة إصلاحات المعايرة مباشرة إلى الفيرموير.",
  "Fig 1. The browser acts as a bridge between the USB Hardware and the Web Page.": "شكل 1. يعمل المتصفح كجسر بين جهاز الـ USB وصفحة الويب.",
  "2. How it Works (The Code)": "2. كيف تعمل (الكود البرمجي)",
  "Connecting to a device is surprisingly simple. Here is the actual logic used in our tool to find a Sony DualSense controller:": "الاتصال بالجهاز بسيط بشكل مدهش. إليك المنطق البرمجي الفعلي المستخدم في أداتنا للعثور على ذراع DualSense:",
  "Once connected, we receive \"Input Reports\" (Hexadecimal data) 250 times per second. We parse these bytes to draw the visualizer you see on the screen.": "بمجرد الاتصال، نستقبل \"تقارير إدخال\" (بيانات Hexadecimal) بسرعة 250 مرة في الثانية. نقوم بتحليل هذه البيانات لرسم المخطط البياني الذي تراه على الشاشة.",
  "3. Is it Safe? (The Sandbox)": "3. هل هي آمنة؟ (نظام الصندوق المعزول)",
  "Security is the #1 priority. The WebHID API operates in a strict <strong>Sandbox</strong>:": "الأمان هو الأولوية القصوى. تعمل WebHID API داخل <strong>صندوق معزول (Sandbox)</strong> صارم:",
  "User Gesture Required:": "تطلب تفاعل المستخدم:",
  "The code above <em>cannot</em> run automatically. It must be triggered by a click (like the \"Connect\" button).": "الكود أعلاه <em>لا يمكن</em> أن يعمل تلقائياً. يجب أن يتم تشغيله بضغطة زر منك (مثل زر \"اتصال\").",
  "Explicit Permission:": "إذن صريح:",
  "The browser opens a system prompt asking you to select a specific device. The website cannot see any other USB devices connected to your PC.": "يفتح المتصفح نافذة نظام تطلب منك اختيار جهاز محدد. لا يمكن للموقع رؤية أي أجهزة USB أخرى متصلة بحاسوبك.",
  "No OS Access:": "لا وصول لنظام التشغيل:",
  "The site can only talk to the specific device you chose, it cannot access your files or webcam.": "الموقع يتحدث فقط مع الجهاز الذي اخترته، ولا يمكنه الوصول لملفاتك أو الكاميرا.",
  "4. Why use this tool?": "4. لماذا نستخدم هذه الأداة؟",
  "By using WebHID, AB Control Hub offers:": "باستخدام WebHID، يوفر AB Control Hub:",
  "Zero Latency:": "زمن استجابة صفري (Zero Latency):",
  "No middleware. Raw data comes straight from USB to Chrome.": "لا برامج وسيطة. البيانات الخام تأتي مباشرة من الـ USB إلى المتصفح.",
  "Cross-Platform:": "تعمل على كل المنصات:",
  "Works on Windows, Mac, Linux, and Android instantly.": "تعمل على ويندوز، ماك، لينكس، وأندرويد فورياً.",
  "Test the API yourself": "جرب الـ API بنفسك",
  "See the raw input data from your controller in real-time.": "شاهد بيانات الإدخال الخام من ذراعك في الوقت الفعلي.",
  "Launch Controller Tester": "تشغيل فاحص الدراعات",
  "<i class=\"fas fa-microchip me-2\"></i>The Voltage Divider Principle": "<i class=\"fas fa-microchip me-2\"></i> مبدأ مقسم الجهد (Voltage Divider)",
  "<strong>Loss of Precision:</strong> You lose the ability to make fine, subtle movements.": "<strong>فقدان الدقة:</strong> تفقد القدرة على القيام بحركات دقيقة وبسيطة.",
  "<strong>Input Lag Feeling:</strong> You have to push the stick further before the character reacts.": "<strong>شعور بتأخر الاستجابة:</strong> يجب عليك دفع العصا لمسافة أبعد قبل أن تستجيب الشخصية.",
  "<strong>User Gesture Required:</strong> The code above <em>cannot</em> run automatically. It must be triggered by a click (like the \"Connect\" button).": "<strong>تطلب تفاعل المستخدم:</strong> الكود أعلاه <em>لا يمكن</em> أن يعمل تلقائياً. يجب أن يتم تشغيله بضغطة زر منك (مثل زر \"اتصال\").",
  "<strong>Explicit Permission:</strong> The browser opens a system prompt asking you to select a specific device. The website cannot see any other USB devices connected to your PC.": "<strong>إذن صريح:</strong> يفتح المتصفح نافذة نظام تطلب منك اختيار جهاز محدد. لا يمكن للموقع رؤية أي أجهزة USB أخرى متصلة بحاسوبك.",
  "<strong>No OS Access:</strong> The site can only talk to the specific device you chose, it cannot access your files or webcam.": "<strong>لا وصول لنظام التشغيل:</strong> الموقع يتحدث فقط مع الجهاز الذي اخترته، ولا يمكنه الوصول لملفاتك أو الكاميرا.",
  "<strong>Zero Latency:</strong> No middleware. Raw data comes straight from USB to Chrome.": "<strong>زمن استجابة صفري:</strong> لا برامج وسيطة. البيانات الخام تأتي مباشرة من الـ USB إلى المتصفح.",
  "<strong>Cross-Platform:</strong> Works on Windows, Mac, Linux, and Android instantly.": "<strong>تعمل على كل المنصات:</strong> تعمل على ويندوز، ماك، لينكس، وأندرويد فورياً.",
  "5 Min Read": "5 دقائق قراءة",
  "6 Min Read": "6 دقائق قراءة",
  "4 Min Read": "4 دقائق قراءة",
  "Forensic Guide": "دليل الفحص الجنائي",
  "Don't get scammed. Use Math to spot the fakes.": "لا تقع ضحية للاحتيال. استخدم الأرقام لكشف التزييف.",
  "Detecting Fake PS4/PS5 Controllers: The Circularity Test | AB Control Hub": "كشف دراعات PS4/PS5 المقلدة: اختبار الدائرية | AB Control Hub",
  "The market is flooded with \"High Copy\" controllers. They look exactly like the original Sony DualSense/DualShock 4, have the same weight, and even the same logos. But inside, they use cheap components. Here is how to expose them using the AB Control Hub test.": "السوق مليء بالدراعات \"الهاي كوبي\". تبدو تماماً مثل DualSense أو DualShock 4 الأصلية، ولها نفس الوزن والشعارات. لكن من الداخل، تستخدم مكونات رخيصة. إليك كيف تفضحها باستخدام اختبار AB Control Hub.",
  "1. The Circularity Test": "1. اختبار الدائرية (Circularity Test)",
  "An original analog stick is designed to move in a perfect circle. However, cheap potentiometers often struggle to reach the corners or overshoot them, creating a \"Square\" input shape.": "صُمم الأنالوج الأصلي ليتحرك في دائرة مثالية. ومع ذلك، تعاني المقاومات الرخيصة من صعوبة الوصول للزوايا أو تجاوزها، مما يخلق شكل إدخال \"مربع\".",
  "<strong>Circularity</strong> calculates the average error deviation from a perfect circle. We measure thousands of points as you rotate the stick.": "تحسب <strong>الدائرية (Circularity)</strong> متوسط انحراف الخطأ عن الدائرة المثالية. نقوم بقياس آلاف النقاط أثناء تدويرك للعصا.",
  "Fig 1. Left: Original Sony (Round). Right: Fake Copy (Square).": "شكل 1. يسار: سوني أصلي (دائري). يمين: تقليد (مربع).",
  "2. The Numbers Don't Lie": "2. الأرقام لا تكذب",
  "You don't need to be an expert. Just look at the \"Avg Error\" number in our tool:": "لا تحتاج لأن تكون خبيراً. فقط انظر لرقم \"Avg Error\" في أداتنا:",
  "Metric": "المقياس",
  "Original Sony": "سوني الأصلي",
  "Fake / High Copy": "تقليد / هاي كوبي",
  "Avg Error": "متوسط الخطأ",
  "Shape": "الشكل",
  "Circle": "دائري",
  "Square / Diamond": "مربع / معين",
  "250Hz (Stable)": "250 هرتز (مستقر)",
  "&lt; 150Hz (Laggy)": "أقل من 150 هرتز (بطيء)",
  "3. Why does it matter?": "3. لماذا يهمك هذا؟",
  "You might think: <em>\"It's cheap, so what?\"</em>. Using a fake controller affects your gameplay severely:": "قد تقول لنفسك: <em>\"إنها رخيصة، فما المشكلة؟\"</em>. استخدام دراع مقلد يؤثر بشدة على لعبك:",
  "<strong>Deadzone Issues:</strong> <span class=\"ds-i18n\">Fakes have massive built-in deadzones to hide their poor quality. You can't aim precisely.</span>": "<strong>مشاكل المنطقة الميتة:</strong> <span class=\"ds-i18n\">التقليد يحتوي على Deadzone ضخمة مدمجة لإخفاء الجودة السيئة. لن تتمكن من التصويب بدقة.</span>",
  "<strong>No Calibration:</strong> <span class=\"ds-i18n\">Our NVS calibration tools usually CANNOT fix fake controllers because they use non-standard memory chips.</span>": "<strong>لا يمكن معايرتها:</strong> <span class=\"ds-i18n\">أدوات معايرة NVS الخاصة بنا غالباً لا تعمل مع التقليد لأنها تستخدم شرائح ذاكرة غير قياسية.</span>",
  "4. How to check yours?": "4. كيف تفحص دراعك؟",
  "Connect your controller via USB.": "وصل الدراع عبر كابل USB.",
  "Go to the \"Joystick Info\" section on the dashboard.": "اذهب لقسم \"Joystick Info\" في لوحة التحكم.",
  "Select <strong>\"Circularity\"</strong> mode.": "اختر وضع <strong>\"Circularity\"</strong>.",
  "Rotate your stick slowly 3-4 times.": "قم بتدوير الأنالوج ببطء 3-4 مرات.",
  "Is your controller Real or Fake?": "هل دراعك أصلي أم تقليد؟",
  "Run the test now and find out the truth.": "شغل الاختبار الآن واكتشف الحقيقة.",
  "Start Circularity Test": "ابدأ اختبار الدائرية",
  "Deadzone Issues:": "مشاكل المنطقة الميتة:",
  "Fakes have massive built-in deadzones to hide their poor quality. You can't aim precisely.": "التقليد يحتوي على Deadzone ضخمة مدمجة لإخفاء الجودة السيئة. لن تتمكن من التصويب بدقة.",
  "No Calibration:": "لا يمكن معايرتها:",
  "Our NVS calibration tools usually CANNOT fix fake controllers because they use non-standard memory chips.": "أدوات معايرة NVS الخاصة بنا غالباً لا تعمل مع التقليد لأنها تستخدم شرائح ذاكرة غير قياسية.",
  "Tech Deep Dive": "شرح تقني عميق",
  "Power Guide": "دليل الطاقة",
  "DualSense Battery Analysis: mAh Consumption & Optimization | AB Control Hub": "تحليل بطارية DualSense: استهلاك الطاقة والتحسين | AB Control Hub",
  "Where does the 1560mAh go? A technical breakdown.": "أين تذهب الـ 1560 مللي أمبير؟ تفصيل تقني.",
  "The PlayStation 5 controller is a technological marvel, but its battery life is often criticized. With a capacity of <strong>1560mAh</strong> (compared to the DS4's 1000mAh), why does it drain so fast? We hooked it up to a multimeter to find out.": "تُعد وحدة تحكم بلايستيشن 5 أعجوبة تقنية، لكن عمر البطارية غالباً ما يُنتقد. بسعة <strong>1560mAh</strong> (مقارنة بـ 1000mAh في DS4)، لماذا تنفد بهذه السرعة؟ قمنا بتوصيلها بمقياس متعدد (Multimeter) لنكتشف السبب.",
  "1. The Power Hogs": "1. ناهبات الطاقة",
  "Unlike older controllers, the DualSense powers multiple heavy-duty motors and sensors simultaneously. Here is the breakdown of current draw (in milliamperes):": "على عكس الوحدات القديمة، تشغل DualSense محركات ومستشعرات متعددة عالية الأداء في وقت واحد. إليك تفصيل سحب التيار (بالمللي أمبير):",
  "Component": "المكون",
  "Current Draw (Approx)": "استهلاك التيار (تقريبي)",
  "Impact": "التأثير",
  "Haptic Motors (Full Rumble)": "محركات اللمس (اهتزاز كامل)",
  "~250mA - 300mA": "~250 - 300 مللي أمبير",
  "Very High": "مرتفع جداً",
  "Adaptive Triggers (Active)": "المشغلات التكيفية (نشطة)",
  "~150mA - 200mA": "~150 - 200 مللي أمبير",
  "High": "مرتفع",
  "Speaker & Mic (Active)": "السماعة والمايك (نشط)",
  "~80mA - 120mA": "~80 - 120 مللي أمبير",
  "Medium": "متوسط",
  "Bluetooth Transmission": "إرسال البلوتوث",
  "~15mA - 20mA": "~15 - 20 مللي أمبير",
  "Low": "منخفض",
  "2. The Microphone Myth": "2. خرافة المايكروفون",
  "Did you know? Leaving the DualSense microphone <strong>ON</strong> (Light off) keeps the audio processing chip in high-power mode. It also reduces the vibration intensity automatically.": "هل تعلم؟ ترك مايكروفون DualSense <strong>مفتوحاً</strong> (الضوء مطفأ) يبقي شريحة معالجة الصوت في وضع الطاقة القصوى. كما أنه يقلل من قوة الاهتزاز تلقائياً.",
  "<strong>Pro Tip:</strong> Always mute the mic (Orange light ON) when not in use. This saves about 10-15% of battery life per session.": "<strong>نصيحة محترف:</strong> دائماً اكتم المايك (الضوء البرتقالي مضاء) عند عدم الحاجة. هذا يوفر حوالي 10-15% من عمر البطارية.",
  "Fig 1. Internal view of the 1560mAh Li-ion battery pack.": "شكل 1. نظرة داخلية على بطارية الليثيوم بسعة 1560 مللي أمبير.",
  "3. Understanding Charge Cycles": "3. فهم دورات الشحن",
  "Lithium-ion batteries degrade over time based on \"Cycles\". One cycle is a full 100% to 0% drain. To extend the lifespan of your controller:": "تتدهور بطاريات الليثيوم أيون بمرور الوقت بناءً على \"الدورات\". الدورة الواحدة هي تفريغ كامل من 100% إلى 0%. لإطالة عمر دراعك:",
  "<strong>Avoid Deep Discharge:</strong> <span class=\"ds-i18n\">Don't let it hit 0%. Charge it when it reaches 20%.</span>": "<strong>تجنب التفريغ العميق:</strong> <span class=\"ds-i18n\">لا تتركها تصل لـ 0%. اشحنها عندما تصل لـ 20%.</span>",
  "<strong>Heat is the Enemy:</strong> <span class=\"ds-i18n\">Never charge while playing if the controller feels hot. Heat degrades internal chemistry.</span>": "<strong>الحرارة هي العدو:</strong> <span class=\"ds-i18n\">لا تشحن أبداً أثناء اللعب إذا كان الدراع ساخناً. الحرارة تدمر الكيمياء الداخلية للبطارية.</span>",
  "4. Recommended Settings": "4. الإعدادات الموصى بها",
  "For maximum playtime without sacrificing the \"Next-Gen\" feel, we recommend:": "للحصول على أطول وقت لعب دون التضحية بشعور \"الجيل الجديد\"، نوصي بـ:",
  "Vibration Intensity: <strong>Weak/Medium</strong>": "قوة الاهتزاز: <strong>ضعيف/متوسط</strong>",
  "Trigger Effect: <strong>Medium</strong>": "تأثير الزناد (Trigger): <strong>متوسط</strong>",
  "Microphone: <strong>Muted</strong>": "المايكروفون: <strong>مكتوم</strong>",
  "Check Battery Health": "افحص حالة البطارية",
  "Connect now to see precise battery percentage.": "اتصل الآن لرؤية نسبة البطارية بدقة.",
  "Check Controller": "فحص الدراع",
  "Speaker &amp; Mic (Active)": "السماعة والمايك (نشط)",
  "Avoid Deep Discharge:": "تجنب التفريغ العميق:",
  "Don't let it hit 0%. Charge it when it reaches 20%.": "لا تتركها تصل لـ 0%. اشحنها عندما تصل لـ 20%.",
  "Heat is the Enemy:": "الحرارة هي العدو:",
  "Never charge while playing if the controller feels hot. Heat degrades internal chemistry.": "لا تشحن أبداً أثناء اللعب إذا كان الدراع ساخناً. الحرارة تدمر الكيمياء الداخلية.",
  "The Resistive Track": "شريط المقاومة",
  "The Wiper": "المؤشر (Wiper)",
  "User Gesture Required": "تطلب تفاعل المستخدم",
  "Explicit Permission": "إذن صريح",
  "No OS Access": "لا وصول لنظام التشغيل",
  "Deadzone Issues": "مشاكل المنطقة الميتة",
  "No Calibration": "لا يمكن معايرتها",
  "Avoid Deep Discharge": "تجنب التفريغ العميق",
  "Heat is the Enemy": "الحرارة هي العدو",
  "V7 Security Update": "تحديث أمني الاصدار السابع",
"Advanced Clone Protection": "حماية متطورة ضد النسخ المقلدة",
"We've upgraded our detection system to identify \"High Copy\" and \"Super Clone\" controllers (specifically JDM-055 clones) that previously bypassed checks. These devices are now automatically blocked from dangerous calibration operations to prevent damage.": "قمنا بتطوير نظام الكشف للتعرف على أذرع التحكم 'High Copy' و 'Super Clone' (تحديداً نسخ JDM-055) التي كانت تتخطى الفحص سابقاً. يتم الآن حظر هذه الأجهزة تلقائياً من عمليات المعايرة الخطرة لمنع تلفها.",
"Console & Performance Fixes": "إصلاحات الأداء والكونسول",
"Console &amp; Performance Fixes": "إصلاحات الأداء والكونسول",
"Resolved Content Security Policy (CSP) warnings related to Google services for a cleaner and more stable experience.": "تم حل تحذيرات سياسة أمان المحتوى (CSP) المتعلقة بخدمات جوجل لتجربة أكثر استقراراً ونظافة.",
"We've upgraded our detection system to identify \"High Copy\" and \"Super Clone\" controllers (specifically JDM-055 clones) to prevent damage during calibration.": "قمنا بتطوير نظام الكشف للتعرف على أذرع التحكم 'High Copy' و 'Super Clone' (تحديداً نسخ JDM-055) لمنع تلفها أثناء المعايرة.",
"New Content": "محتوى جديد",
"Technical Guides Library": "مكتبة الشروحات التقنية",
"Added comprehensive guides on <a href=\"blog/fake-controller-detection.html\" class=\"text-info\">Fake Controller Detection</a>, <a href=\"blog/stick-drift-science.html\" class=\"text-info\">Stick Drift Science</a>, and <a href=\"blog/dualsense-battery-optimization.html\" class=\"text-info\">Battery Optimization</a>.": "تمت إضافة أدلة شاملة حول <a href=\"blog/fake-controller-detection.html\" class=\"text-info\">كشف الدراعات المقلدة</a>، <a href=\"blog/stick-drift-science.html\" class=\"text-info\">علم انحراف الأنالوج</a>، و <a href=\"blog/dualsense-battery-optimization.html\" class=\"text-info\">تحسين البطارية</a>.",
"Fix": "إصلاح",
"Resolved Content Security Policy (CSP) warnings for a cleaner experience.": "تم حل تحذيرات سياسة الأمان (CSP) لتجربة استخدام أكثر استقراراً."
}
