{
  "_comment_meta": "=== META & GENERAL ===",
  "Last Updated": "آخر تحديث",
  "Terms Content": "باستخدامك لـ AB Control Hub، فإنك توافق على هذه الشروط. تم توفير هذه الأداة لأغراض تعليمية وللإصلاح فقط. نحن غير مسؤولين عن أي ضرر قد يلحق بذراع التحكم الخاص بك.",
  "Developer Contact": "تواصل مع المطور",
  "Ahmed Badawy": "أحمد بدوي",
  "AB Control Hub": "AB Control Hub - لوحة التحكم",
  "AB Control Hub | PS4/PS5 Controller Calibration & Test | معايرة وفحص دراعات بلايستيشن": "AB Control Hub | معايرة وفحص دراعات بلايستيشن | تطوير أحمد بدوي",
  "Developed by": "تطوير وبرمجة: ",
  "Version": "الإصدار",
  "Language": "اللغة",
  "Terms of Use": "شروط الاستخدام",
  "Privacy Policy": "سياسة الخصوصية",
  "Help": "مساعدة",
  "About": "حول",
  "About AB Control Hub": "عن AB Control Hub",
  "Close": "إغلاق",
  "Next": "التالي",
  "Back to Home": "العودة للرئيسية",
  "Done": "تمّ",
  "Cancel": "إلغاء",
  "Save": "حفظ",
  "Reset": "إعادة تعيين",
  "Connect": "اتصال",
  "Disconnect": "قطع الاتصال",
  "Connected:": "متصل:",
  "Connected to:": "متصل بـ:",
  "Click to Connect": "إضغط للإتصال",
  "Connect Controller": "توصيل ذراع التحكم",
  "Please connect a controller first": "  يرجى توصيل وحدة التحكم أولًا",
  "Unsupported browser. Please use a web browser with WebHID support (e.g. Chrome).": "المتصفح غير معتمد. الرجاء استخدام متصفح بدعم WebHID (على سبيل المثال Chrome).",
  "(Supports Android via OTG or Bluetooth on Chrome)": "(يدعم أندرويد عبر OTG أو بلوتوث على كروم)",
  "(iOS and iPadOS are not supported by Apple)": "(iOS و iPadOS غير مدعومين من قبل Apple)",

  "_comment_home": "=== HOME & LANDING ===",
  "Welcome": "مرحبًا",
  "AB Control Hub Description": "AB Control Hub هو أداة متقدمة ومجانية تعتمد على الويب مصممة لفحص واختبار ومعايرة أذرع تحكم Sony PlayStation مباشرة من متصفحك. سواء كنت تعاني من انحراف العصا (stick drift) أو تريد فقط التحقق من تأخير الإدخال، فإن هذه الأداة توفر حلاً شاملاً دون الحاجة لتحميل أي برامج.",
  "AB Control Hub is an advanced, free web-based tool designed to diagnose, test, and calibrate Sony PlayStation controllers directly from your browser. Whether you are experiencing <strong>analog stick drift</strong> or just want to check your controller's input latency, this tool provides a comprehensive solution without downloading any software.": "AB Control Hub هو أداة متقدمة ومجانية تعتمد على الويب مصممة لفحص واختبار ومعايرة أذرع تحكم Sony PlayStation مباشرة من متصفحك. سواء كنت تعاني من انحراف العصا (stick drift) أو تريد فقط التحقق من تأخير الإدخال، فإن هذه الأداة توفر حلاً شاملاً دون الحاجة لتحميل أي برامج.",
  "What is AB Control Hub?": "ما هو AB Control Hub؟",
  "AB Control Hub is the ultimate Web-Based tool to test and calibrate PlayStation controllers (DualSense &amp; DualShock 4). Fix analog stick drift, measure input latency, and test buttons online without installing software.": "AB Control Hub هو الأداة المثالية المعتمدة على الويب لفحص ومعايرة أذرع تحكم بلايستيشن (DualSense و DualShock 4). قم بإصلاح انحراف الأنالوج (Drift)، وقياس تأخير الإدخال، وفحص الأزرار أونلاين دون تثبيت أي برامج.",
  "AB Control Hub is the ultimate Web-Based tool to test and calibrate PlayStation controllers.": "AB Control Hub هو الأداة المثالية المعتمدة على الويب لفحص ومعايرة أذرع تحكم بلايستيشن.",
  "Key Features": "المميزات الرئيسية",
  "Key Features Title": "المميزات الرئيسية",
  "Drift Calibration Feature": "إصلاح انحراف العصا بشكل دائم على DualSense و DualShock 4.",
  "Input Analysis Feature": "قياس معدل الاستجابة (Hz)، وتأخير الإدخال (ms)، والاهتزاز.",
  "Output Testing Feature": "اختبار محركات الاهتزاز، والمحفزات التكيفية، وألوان LED.",
  "Device Info Feature": "قراءة مستوى البطارية، وإصدار البرنامج الثابت، وتفاصيل الأجهزة.",
  "Drift Calibration:": "معايرة الانحراف:",
  "Permanently fix stick drift on DualSense and DualShock 4.": "إصلاح انحراف العصا بشكل دائم على DualSense و DualShock 4.",
  "Input Analysis:": "تحليل الإدخال:",
  "Measure Polling Rate (Hz), Input Latency (ms), and Jitter.": "قياس معدل الاستجابة (Hz)، وتأخير الإدخال (ms)، والاهتزاز.",
  "Output Testing:": "اختبار المخرجات:",
  "Vibration Test": "اختبار محركات الاهتزاز",
  "Test Vibration motors, Adaptive Triggers, and LED colors.": "اختبار محركات الاهتزاز، والمحفزات التكيفية، وألوان LED.",
  "Device Info:": "معلومات الجهاز:",
  "Read battery level, firmware version, and hardware details.": "قراءة مستوى البطارية، وإصدار البرنامج الثابت، وتفاصيل الأجهزة.",
  "Supported Controllers": "الأذرع المدعومة",
  "Supported Controllers Title": "الأذرع المدعومة",
  "DualShock 4 Support": "Sony DualShock 4 (الإصدار 1 و 2)",
  "DualSense Support": "Sony DualSense (PS5)",
  "DualSense Edge Support": "Sony DualSense Edge",
  "Sony DualShock 4 (V1 &amp; V2)": "Sony DualShock 4 (الإصدار 1 و 2)",
  "Sony DualSense (PS5)": "Sony DualSense (PS5)",
  "Sony DualSense Edge": "Sony DualSense Edge",
  "WebHID Requirement": "* ملاحظة: يتطلب متصفحًا يدعم WebHID (مثل Chrome و Edge و Opera).",
  "* Note: Requires a browser with WebHID support (Chrome, Edge, Opera).": "* ملاحظة: يتطلب متصفحًا يدعم WebHID (مثل Chrome و Edge و Opera).",
  "Works Offline After First Load (PWA)": "يعمل دون اتصال بالإنترنت بعد التحميل الأول (تطبيق ويب تقدمي)",
  "Drift Calibration &amp; Center Fix": "معايرة الانحراف (Drift) وضبط المركز",
  "Input Lag &amp; Circularity Test": "اختبار تأخير الاستجابة (Input Lag) والدائرية",
  "Vibration &amp; LED Control": "التحكم في الاهتزاز والإضاءة (LED)",
  "Supported Devices": "الأجهزة المدعومة",
  "DualShock 4 (PS4)": "DualShock 4 (PS4)",
  "DualSense (PS5) &amp; Edge": "DualSense (PS5) & Edge",
  "Generic Gamepads (Partial)": "أذرع تحكم عامة (دعم جزئي)",
  "Calibration Suite": "مجموعة المعايرة",
  "Drift Calibration &amp; Center Fix (Permanent)": "معايرة الانحراف (Drift) وضبط المركز (دائم)",
  "Privacy First: Local Processing (No Uploads)": "الخصوصية أولاً: معالجة محلية (بدون رفع بيانات)",
  "Real-time WebHID Technology (Zero Latency)": "تقنية WebHID في الوقت الفعلي (بدون تأخير)",
  "Haptic Vibration &amp; LED Testing": "اختبار الاهتزاز اللمسي والإضاءة (LED)",
  "Plug &amp; Test: No Drivers/Software Needed": "وصّل وافحص: لا يحتاج تعريفات أو برامج",
  "Supported: DualShock 4, DualSense &amp; Edge": "يدعم: DualShock 4 و DualSense و Edge",

  "_comment_guide": "=== GUIDES & DOCS ===",
  "Complete Guide to Controller Calibration": "الدليل الكامل لمعايرة وحدة التحكم",
  "This guide explains the technical details of Analog Stick Drift and how AB Control Hub uses WebHID to fix it permanently on DualSense and DualShock 4 controllers.": "يشرح هذا الدليل التفاصيل الفنية لانحراف الأنالوج (Drift) وكيف يستخدم AB Control Hub تقنية WebHID لإصلاحه نهائياً في وحدات تحكم DualSense و DualShock 4.",
  "1. Understanding Stick Drift": "١. فهم مشكلة الانحراف (Stick Drift)",
  "Stick drift is a phenomenon where your game character moves or looks around without you touching the controller. This is caused by the wear and tear of the potentiometers inside the analog stick module.": "الانحراف هو ظاهرة تتحرك فيها شخصية اللعبة أو تنظر حولها دون أن تلمس وحدة التحكم. يحدث هذا بسبب تآكل المقاومات المتغيرة داخل وحدة الأنالوج.",
  "Hardware vs. Software Drift": "الانحراف: هاردوير مقابل سوفتوير",
  "<strong>Hardware Drift:</strong> Physical damage or dust inside the sensor. While cleaning helps, the center point often shifts permanently.<br><strong>Software Calibration:</strong> This is where AB Control Hub shines. Instead of replacing the stick, we reprogram the controller's internal memory (NVS) to recognize the \"new\" center point, effectively eliminating drift without soldering.": "<strong>انحراف الهاردوير:</strong> تلف مادي أو غبار داخل المستشعر. قد يساعد التنظيف، لكن نقطة المنتصف غالباً ما تنزاح بشكل دائم.<br> <strong>المعايرة البرمجية:</strong> هنا يتألق AB Control Hub. بدلاً من استبدال الأنالوج، نعيد برمجة الذاكرة الداخلية (NVS) للتعرف على نقطة المنتصف \"الجديدة\"، مما يلغي الانحراف فعلياً دون لحام.",
  "2. How WebHID Technology Works": "٢. كيف تعمل تقنية WebHID",
  "Traditional tools like DS4Windows require installing drivers and running background services. <strong>WebHID</strong> (Web Human Interface Device) is a modern browser API that allows this website to communicate directly with your controller via USB or Bluetooth.": "تتطلب الأدوات التقليدية مثل DS4Windows تثبيت تعريفات وتشغيل خدمات في الخلفية. <strong>WebHID</strong> هي تقنية متصفح حديثة تسمح لهذا الموقع بالتواصل مباشرة مع وحدة التحكم عبر USB أو Bluetooth.",
  "<strong>Zero Latency:</strong> Commands are sent directly to the hardware.": "<strong>بدون تأخير (Zero Latency):</strong> تُرسل الأوامر مباشرة للهاردوير.",
  "<strong>Privacy First:</strong> No data is uploaded to any server. All processing happens locally in your browser.": "<strong>الخصوصية أولاً:</strong> لا يتم رفع أي بيانات لأي خادم. تتم المعالجة بالكامل محلياً في متصفحك.",
  "<strong>OS Independent:</strong> Works on Windows, Mac, Linux, and Android (via Chrome).": "<strong>مستقل عن النظام:</strong> يعمل على Windows و Mac و Linux و Android (عبر Chrome).",
  "3. Step-by-Step Calibration Guide": "٣. دليل المعايرة خطوة بخطوة",
  "Step 1: Connect Your Controller": "الخطوة ١: توصيل وحدة التحكم",
  "Use a high-quality USB data cable. While Bluetooth works for testing, we recommend USB for calibration to ensure connection stability during the writing process.": "استخدم كابل بيانات USB عالي الجودة. بينما يعمل البلوتوث للاختبار، نوصي باستخدام USB للمعايرة لضمان استقرار الاتصال أثناء عملية الكتابة.",
  "Step 2: Center Calibration": "الخطوة ٢: معايرة المنتصف",
  "Click on <strong>\"1. Calibrate stick center\"</strong>. The tool will measure the current resting position of your sticks and calculate the offset needed to make them read (0,0) again. This fixes the drift.": "اضغط على <strong>\"1. Calibrate stick center\"</strong>. ستقوم الأداة بقياس وضع السكون الحالي للعصي وحساب الإزاحة المطلوبة لجعلها تقرأ (0,0) مرة أخرى. هذا يصلح الانحراف.",
  "Step 3: Range Calibration": "الخطوة ٣: معايرة المدى",
  "Click on <strong>\"2. Calibrate stick range\"</strong>. You will be asked to rotate both sticks fully. This maps the outer edges of the analog movement, ensuring you can reach 100% speed in games in all directions (fixing \"Slow Turn\" issues).": "اضغط على <strong>\"2. Calibrate stick range\"</strong>. سيُطلب منك تدوير كلا العصي بالكامل. هذا يحدد الحواف الخارجية لحركة الأنالوج، مما يضمن وصولك لسرعة 100% في الألعاب في جميع الاتجاهات (إصلاح مشاكل \"الدوران البطيء\").",
  "4. Troubleshooting &amp; FAQ": "٤. استكشاف الأخطاء والأسئلة الشائعة",
  "<strong>Q: Is this permanent?</strong><br>A: Yes, the calibration is saved to the controller's internal memory. It works on consoles (PS4/PS5) and PC even after you close this site.": "<strong>س: هل هذا دائم؟</strong><br> ج: نعم، تُحفظ المعايرة في الذاكرة الداخلية للكنترولر. وتعمل على الكونسول (PS4/PS5) والكمبيوتر حتى بعد إغلاق الموقع.",
  "<strong>Q: My controller is not detected?</strong><br>A: Ensure you are using Google Chrome or Microsoft Edge. Close other apps like Steam or DS4Windows as they might hijack the connection.": "<strong>س: لم يتم اكتشاف الكنترولر؟</strong><br> ج: تأكد من استخدام Google Chrome أو Microsoft Edge. أغلق تطبيقات أخرى مثل Steam أو DS4Windows لأنها قد تستحوذ على الاتصال.",
  "Start Calibration Now": "ابدأ المعايرة الآن",

  "_comment_calib_center": "=== CENTER CALIBRATION ===",
  "Calibration": "معايرة",
  "Stick center calibration": "معايرة تمركز العصا",
  "Calibrate stick center": "معايرة مركز الذراع",
  "Welcome to the stick center-calibration wizard!": "مرحباً بك في معالج ومصحح تمركز العصا!",
  "This tool will guide you in re-centering the analog sticks of your controller. It consists of four steps: you will be asked to move both sticks in a direction and release them.": "هذه الأداة ستوجهك في إعادة تمركز العصي ليد التحكم. تتكون من أربع خطوات، سيطلب منك تحريك كلا العصي إلى اتجاه معين وتركهما.",
  "Please be aware that, <i>once the calibration is running, it cannot be canceled</i>. Do not close this page or disconnect your controller until it is completed.": "المرجو الانتباه، <i>عند بدء المعايرة لا يمكنك إلغائها</i>. لا تغلق هذه الصفحة أو تقطع اتصال يد التحكم حتى الاكتمال.",
  "Press <b>Start</b> to begin calibration.": "اضغط <b>بدء</b> لبدء المعايرة.",
  "Step 1": "الخطوة الأولى",
  "Step 2": "الخطوة الثانية",
  "Step 3": "الخطوة الثالثة",
  "Step 4": "الخطوة الرابعة",
  "Step 1 of 4": "الخطوة 1 من 4",
  "Step 2 of 4": "الخطوة 2 من 4",
  "Step 3 of 4": "الخطوة 3 من 4",
  "Step 4 of 4": "الخطوة 4 من 4",
  "Please move both sticks to the <b>top-left corner</b> and release them.": "الرجاء حرك كلا العصي إلى <b>إعلى اليسار</b> وتركهما.",
  "When the sticks are back in the center, press <b>Continue</b>.": "عند عودة كلا العصي إلى المركز، اضغط <b>متابعة</b>.",
  "Please move both sticks to the <b>top-right corner</b> and release them.": "الرجاء حرك كلا العصي إلى <b>إعلى اليمين</b> وتركهما.",
  "Please move both sticks to the <b>bottom-left corner</b> and release them.": "الرجاء حرك كلا العصي إلى <b>أسفل اليسار</b> وتركهما.",
  "Please move both sticks to the <b>bottom-right corner</b> and release them.": "الرجاء حرك كلا العصي إلى <b>أسفل اليمين</b> وتركهما.",
  "Calibration completed successfully!": "انتهت المعايرة بنجاح!",
  "Stick calibration completed": "أكملت معايرة العصا",
  "Stick calibration failed": "فشل في معايرة العصا،",
  "Recentering the controller sticks.": "إعادة تسجيل عصا وحدة التحكم.",
  "Please do not close this window and do not disconnect your controller. ": "الرجاء عدم إغلاق هذه النافذة وعدم قطع اتصال يد التحكم. ",
  "Start": "بدء",
  "Continue": "متابعة",
  "Completed": "اكتملت",
  "You can now close this window.": "يمكنك الآن إغلاق هذه النافذة.",

  "_comment_calib_range": "=== RANGE CALIBRATION ===",
  "Range calibration": "معايرة المدى",
  "Calibrate stick range": "معايرة مدى الذراع",
  "<b>The controller is now sampling data!</b>": "<b>يد التحكم تقوم الآن بأخذ عينات من البيانات!</b>",
  "Rotate the sticks slowly at least 2 times in one direction and 2 times in the other direction to cover the whole range.": "قم بتدوير العصي ببطء مرتين على الأقل في اتجاه ومرتين في الاتجاه الآخر لتغطية النطاق بالكامل.",
  "The <b>Done</b> button will unlock after at most 15 seconds. If you press <b>Done</b> without rotating the sticks, the calibration will be incomplete and you will need to repeat it.": "سيتم تفعيل زر <b>تم</b> بعد 15 ثانية كحد أقصى. إذا ضغطت على <b>تم</b> دون تدوير العصي، فستكون المعايرة غير مكتملة وستحتاج لتكرارها.",
  "Range calibration completed": "أكملت معايرة المدى",
  "Range calibration failed": "فشل في معايرة المدى،",
  "Range calibration appears to have failed. Please try again and make sure you rotate the sticks.": "يبدو أن معايرة المدى قد فشلت. يرجى المحاولة مرة أخرى والتأكد من تدوير الأذرع.",
  "After range calibration, joysticks always go in corners.": "بعد معايرة المدى, العصا دائما ستتحرك في الزوايا.",
  "This issue happens because you have clicked \"Done\" immediately after starting a range calibration.": "تحدث هذه المشكلة لأنك قمت بالنقر على \"تم\" مباشرة بعد بدء معايرة النطاق.",
  "Please read the instructions.": "يُرجى قراءة التعليمات.",
  "You have to rotate the joysticks before you press \"Done\".": "عليك تدوير عصا التحكم قبل أن تضغط على \"تم\".",
  "Make sure to touch the edges of the joystick frame and rotate slowly, preferably in each direction - clockwise and anti-clockwise.": "تحقق من لمس حواف إطار عصا التحكم وتدويرها ببطء، ويفضل أن يكون ذلك في اتجاه عقارب الساعة وعلى عكس اتجاه عقرب الساعة.",
  "Only after you have done that, you click on \"Done\".": "فقط بعد أن تقوم بذلك، انقر فوق \"تم\".",
  "Sampling...": "أخذ العينات...",
  "Calibration in progress": "جارٍ المعايرة",
  "Storing calibration...": "خزن المعايرة...",
  "Calibration is being stored in the stick modules.": "يتم تخزين المعايرة في وحدات العصا (Modules).",
  "If the calibration is not stored permanently, please double-check the wirings of the hardware mod.": "If the calibration is not stored permanently, please double-check the wirings of the hardware mod.",

  "_comment_fine_tune": "=== FINE TUNING ===",
  "Finetune stick calibration": "ضبط دقيق للمعايرة",
  "Quick calibrate": "معايرة سريعة",
  "Joystick Info": "معلومات الذراع",
  "Left stick": "العصا اليسرى",
  "Right stick": "العصا اليمنى",
  "Center": "المركز",
  "Circularity": "الدائرية",
  "Deadzone": "المنطقة الميتة",
  "Check circularity": "فحص الدائرية",
  "Show raw numbers": "إظهار الأرقام الخام",
  "10x zoom": "تكبير 10x",
  "Step size": "حجم الخطوة",
  "Increase non-circularity": "زيادة عدم الدائرية",
  "Center (L1)": "المركز (L1)",
  "Circularity (R1)": "الدائرية (R1)",
  "Normal": "عادي",
  "Move the stick to select it for tuning, then without touching the stick use the D-pad buttons to adjust the center point. Flick it and adjust it again if it is off center or flickers.": "حرك العصا لاختيارها للضبط، ثم بدون لمس العصا استخدم أزرار الـ D-pad لضبط نقطة المركز. قم بنقرها وضبطها مرة أخرى إذا كانت خارج المركز أو تومض.",
  "Please release the stick to center position before adjusting with D-pad buttons.": "يرجى ترك العصا لتعود لوضع المركز قبل الضبط باستخدام أزرار الـ D-pad.",
  "Press the D-pad or face buttons in the direction you want the stick position to move.": "اضغط على أزرار الاتجاهات أو الأزرار الرئيسية في الاتجاه الذي تريد تحريك موضع العصا إليه.",
  "While holding the stick to be adjusted straight up/down/left/right, make adjustments until you see lightblue sectors in all four directions after circling the stick both left and right. Then use the": "أثناء تثبيت العصا المراد ضبطها للأعلى/الأسفل/اليسار/اليمين بشكل مستقيم، قم بإجراء التعديلات حتى ترى قطاعات زرقاء فاتحة في جميع الاتجاهات الأربعة بعد تدوير العصا لليسار واليمين. ثم استخدم الـ D-pad",
  "to increase the non-circularity.": "لزيادة عدم الدائرية.",
  "Push the stick straight up/down/left/right as far as possible.": "ادفع العصا للأعلى/الأسفل/اليسار/اليمين لأقصى حد ممكن.",
  "<strong>Average circularity error:</strong> smaller is not always better! Aim for 7-9 %.": "<strong>متوسط خطأ الدائرية:</strong> ليس دائماً الأقل هو الأفضل! استهدف نسبة 7-9 %.",
  "Learn more...": "لمعرفة المزيد...",
  "Sony controllers come from the factory calibrated to have an average circularity error of nearly 10 %, and this is now what games expect. Too perfect circularity can make movements and aim feel stiff and unresponsive in some games.": "تأتي أجهزة تحكم سوني من المصنع بمعايرة لمتوسط خطأ دائرية يقارب 10%، وهذا ما تتوقعه الألعاب الآن. الدائرية المثالية الزائدة قد تجعل الحركة والتصويب يبدوان صلبين وغير مستجيبين في بعض الألعاب.",
"The controller is now sampling data!": "وحدة التحكم تقوم بجمع البيانات الآن!",
"OK": "حسناً",
"Experimental feature": "ميزة تجريبية",
"Warning: Advanced Users Only": "تحذير: للمستخدمين المحترفين فقط",
"Click here": "اضغط هنا",
  "_comment_dualsense_edge": "=== DUALSENSE EDGE ===",
  "DualSense Edge": "DualSense Edge",
  "DualSense Edge Calibration": "معايرة DualSense Edge",
  "Support for calibrating DualSense Edge stick modules is now available as an <b>experimental feature</b>.": "دعم معايرة وحدات عصا DualSense Edge متاح الآن كـ <b>ميزة تجريبية</b>.",
  "Please note: the stick modules on the DS Edge <b>cannot be calibrated via software alone</b>.": "يرجى ملاحظة: وحدات العصا في DS Edge <b>لا يمكن معايرتها عبر البرمجيات فقط</b>.",
  "To store a custom calibration on the stick's internal memory, a <b>hardware modification</b> is required.": "لتخزين معايرة مخصصة في الذاكرة الداخلية للعصا، يلزم إجراء <b>تعديل على الهاردوير</b>.",
  "This involves temporarily disabling write protection by applying <b>+1.8V</b> to a specific test point on each module.": "يتضمن ذلك تعطيل حماية الكتابة مؤقتاً عن طريق توصيل <b>+1.8 فولت</b> بنقطة اختبار محددة في كل وحدة.",
  "You can do this in two ways:": "يمكنك القيام بذلك بطريقتين:",
  "<b>Internally</b>: by soldering a wire from a +1.8V source to the write-protect TP.": "<b>داخلياً</b>: عن طريق لحام سلك من مصدر +1.8 فولت إلى نقطة حماية الكتابة.",
  "<b>Externally</b>: by applying +1.8V directly to the visible test point without opening the controller.": "<b>خارجياً</b>: عن طريق توصيل +1.8 فولت مباشرة بنقطة الاختبار المرئية دون فتح جهاز التحكم.",
  "This is only for advanced users. If you're not sure what you're doing, please do not attempt it.": "هذا للمستخدمين المتقدمين فقط. إذا لم تكن متأكداً مما تفعله، يرجى عدم المحاولة.",
  "More details and images": "لمزيد من التفاصيل والصور",
  "here": "هنا",
  "We are not responsible for any damage caused by attempting this modification.": "نحن غير مسؤولين عن أي أضرار ناتجة عن محاولة هذا التعديل.",
  "For more info or help, feel free to reach out on Discord.": "لمزيد من المعلومات أو المساعدة، لا تتردد في التواصل معنا عبر ديسكورد.",
  "Don't show again": "لا تظهر مجدداً",
  "Left Module Barcode": "Left Module Barcode",
  "Right Module Barcode": "Right Module Barcode",
  "Cannot unlock": "Cannot unlock",
  "left module": "left module",
  "right module": "right module",
  "Cannot lock": "Cannot lock",
  "Cannot store data into": "Cannot store data into",
  "A reboot is needed to continue using this DualSense Edge. Please disconnect and reconnect your controller.": "A reboot is needed to continue using this DualSense Edge. Please disconnect and reconnect your controller.",
  "Home": "الرئيسية",
  "Tests": "الاختبارات",
  "Follow these steps to calibrate your controller permanently.": "اتبع هذه الخطوات لمعايرة ذراع التحكم بشكل دائم.",
  "1. Center Calibration": "1. معايرة المركز",
  "Fix drift when sticks are idle": "إصلاح الانحراف عند السكون",
  "1. Quick Calibration": "1. معايرة سريعة",
  "Automated center fix": "إصلاح المركز تلقائياً",
  "2. Range Calibration": "2. معايرة المدى",
  "Fix sticks not reaching 100%": "حل مشكلة عدم الوصول لـ 100%",
  "3. Finetune": "3. الضبط الدقيق",
  "Manual hardware adjustment": "تعديل يدوي للقيم",
  "_comment_tests": "=== INPUT/OUTPUT TESTS ===",
  "Input Analysis": "تحليل الإدخال",
  "Advanced Input Analysis": "تحليل الإدخال المتقدم",
  "Measure Polling Rate, Latency &amp; Jitter": "قياس معدل الاستجابة والتأخير والتذبذب",
  "Polling Rate": "معدل الاستجابة",
  "Max": "الأقصى",
  "Interval / Latency": "الفاصل الزمنية / التأخير",
  "Avg Interval": "متوسط التأخير",
  "Jitter (Stability)": "التذبذب (الاستقرار)",
  "Variance": "التباين",
  "Interval Distribution (Live Graph)": "توزيع الفواصل الزمنية (رسم مباشر)",
  "Open Analyzer": "فتح المحلل",
  "Start Test": "بدء الاختبار",
  "Stop Test": "إيقاف الاختبار",
  "Press Start to begin analysis": "اضغط بدء لبدء التحليل",
  "Move the sticks continuously in circles for accurate polling rate measurement.": "حرك الأذرع باستمرار في دوائر لقياس معدل الاستجابة بدقة.",
  "Output Tests": "اختبار المخرجات",
  "Button Test": "اختبار الأزرار",
  "Digital Buttons": "الأزرار الرقمية",
  "L2 Trigger": "زر L2",
  "R2 Trigger": "زر R2",
  "Vibration": "الاهتزاز",
  "Test Vibration": "اختبار الاهتزاز",
  "LED Color": "لون الإضاءة",
  "Red": "أحمر",
  "Green": "أخضر",
  "Blue": "أزرق",
  "Off": "إطفاء",
  "Adaptive Triggers (PS5 Only)": "المحفزات التكيفية (PS5 فقط)",
  "Adaptive Triggers (DS5)": "المحفزات التكيفية (DS5)",
  "Test Left": "اختبار اليسار",
  "Test Right": "اختبار اليمين",
  "Reset Triggers": "إعادة ضبط المحفزات",
  "Audio (DS5)": "الصوت (DS5)",
  "Audio Tests (DS5)": "اختبارات الصوت (DS5)",
  "Speaker": "السماعة",
  "Mic": "الميكروفون",
  "Touchpad Test": "اختبار لوحة اللمس",
  "Touch the pad to see feedback": "المس اللوحة لرؤية الاستجابة",
  "LX:": "LX:",
  "LY:": "LY:",
  "RX:": "RX:",
  "RY:": "RY:",
  "triangle": "مثلث",
  "circle": "دائرة",
  "cross": "إكس",
  "square": "مربع",
  "l1": "L1",
  "r1": "R1",
  "l3": "L3",
  "r3": "R3",
  "up": "فوق",
  "down": "تحت",
  "left": "يسار",
  "right": "يمين",
  "ps": "PS",
  "create": "مشاركة",
  "Share": "مشاركة",
  "options": "خيارات",
  "touchpad": "لوحة اللمس",
  "mute": "كتم",
  "Range": "المدى",
  "Circular": "دائري",
  "Square": "مربع",
  "Speak": "تحدث",
  "L Trig": "زر L2",
  "R Trig": "زر R2",

  "_comment_device_info": "=== DEVICE INFO & DEBUG ===",
  "Controller Info": "معلومات عصا التحكم",
  "Serial Number": "الرقم التسلسلي",
  "FW Version": "إصدار البرمجيات",
  "HW Version": "إصدار العتاد",
  "SW Version": "إصدار البرمجيات",
  "Build Date": "تاريخ الإصدار",
  "FW Build Date": "تاريخ بناء الـ FW",
  "FW Type": "نوع الـ FW",
  "FW Series": "سلسلة الـ FW",
  "FW Update": "تحديث الـ FW",
  "FW Update Info": "معلومات تحديث الـ FW",
  "SBL FW Version": "إصدار SBL FW",
  "Venom FW Version": "إصدار Venom FW",
  "Spider FW Version": "إصدار Spider FW",
  "Touchpad FW Version": "إصدار FW للوحة اللمس",
  "MCU Unique ID": "معرف MCU الفريد",
  "PCBA ID": "معرف PCBA",
  "Battery Barcode": "باركود البطارية",
  "VCM Left Barcode": "باركود VCM الأيسر",
  "VCM Right Barcode": "باركود VCM الأيمن",
  "HW Model": "موديل الهاردوير",
  "Touchpad ID": "معرف لوحة اللمس",
  "Bluetooth Address": "عنوان البلوتوث",
  "Board Model": "موديل البوردة",
  "This feature is experimental.": "هذه الخاصية تجريبية.",
  "Please let me know if the board model of your controller is not detected correctly.": "من فضلك أخبرني إذا لم يتم اكتشاف نوع لوحة التحكم بشكل صحيح.",
  "Board model detection thanks to": "كشف نوع اللوحة بفضل",
  "Device Type": "نوع الجهاز",
  "original": "يد تحكم أصلية",
  "clone": "يد تحكم مقلدة",
  "unknown": "غير معلوم",
  "Sony DualShock 4 V1": "Sony DualShock 4 الإصدار الأول",
  "Sony DualShock 4 V2": "Sony DualShock 4 الإصدار الثاني",
  "Sony DualSense": "Sony DualSense",
  "Connected invalid device": "الجهاز المتصل غير صالح،",
  "The device appears to be a clone. All calibration functionality is disabled.": "يبدو أن الجهاز مقلد. تم تعطيل جميع وظائف المعايرة.",
  "This DualSense controller has outdated firmware.": "يد تحكم DualSense هذه تستخدم برمجيات قديمة.",
  "Please update the firmware and try again.": "الرجاء حدث البرمجيات وحاول مرة أخرى.",
  "The device is connected via Bluetooth. Disconnect and reconnect using a USB cable instead.": "The device is connected via Bluetooth. Disconnect and reconnect using a USB cable instead.",
  "Debug": "تصحيح",
  "Debug Info": "معلومات التصحيح",
  "System Control": "التحكم في النظام",
  "Software": "السوفتوير",
  "Hardware": "الهاردوير",
  "Save changes permanently": "حفظ التغييرات بشكل دائم",
  "Reboot controller": "إعادة تشغيل اليد",
  "NVS Status": "حالة الـNVS",
  "Debug buttons": "أزرار تصحيح الأخطاء",
  "Query NVS status": "حالة إستعلام NVS",
  "NVS unlock": "فتح قفل الـNVS",
  "NVS lock": "قفل الـNVS",
  "Sections below are not useful, just some debug infos or manual commands": "الأقسام أدناه ليست مفيدة، فقط بعض معلومات التصحيح أو أوامر يدوية",
  "Unknown": "غير معلوم",
  "locked": "مغلق",
  "unlocked": "مفتوح",
  "error": "خطأ",
  "Error": "خطأ،",
  "Initializing...": "تتم التهيئة...",
  "NVS Lock failed": "فشل في قفل NVS",
  "NVS Unlock failed": "فشل فتح قفل NVS",
  "Please connect only one controller at time.": "الرجاء ربط يد تحكم واحدة فقط.",
  "Changes saved successfully": "تم حفظ التغييرات بنجاح",
  "Error while saving changes": "حدث خطأ أثناء حفظ التغييرات:",
  "Info": "المعلومات",
  "Show all": "إظهار الكل",
  "30th Anniversary": "الذكرى الثلاثون",
  "Color": "اللون",
  "White": "أبيض",
  "Midnight Black": "أسود منتصف الليل",
  "Cosmic Red": "أحمر كوني",
  "Nova Pink": "وردي نوفا",
  "Galactic Purple": "بنفسجي مجري",
  "Starlight Blue": "أزرق ضوء النجوم",
  "Grey Camouflage": "رمادي مموه",
  "Volcanic Red": "أحمر بركاني",
  "Sterling Silver": "فضي استرليني",
  "Cobalt Blue": "أزرق كوبالت",
  "God of War Ragnarok": "God of War Ragnarok",
  "Spider-Man 2": "Spider-Man 2",
  "The Last of Us": "The Last of Us",
  "Astro Bot": "Astro Bot",
  "Chroma Indigo": "Chroma Indigo",
  "Chroma Pearl": "Chroma Pearl",
  "Chroma Teal": "Chroma Teal",
  "Fortnite": "Fortnite",
  "BDM-010": "BDM-010",
  "BDM-020": "BDM-020",
  "BDM-030": "BDM-030",
  "BDM-040": "BDM-040",
  "BDM-050": "BDM-050",
  "N/A": "غير متاح",
  "(DS5 Only)": "(DS5 فقط)",

  "_comment_faq": "=== FAQ & SUPPORT ===",
  "Frequently Asked Questions": "الأسئلة الشائعة",
  "Welcome to the F.A.Q. section! Below, you'll find answers to some of the most commonly asked questions about this website. If you have any other inquiries or need further assistance, feel free to reach out to me directly. Your feedback and questions are always welcome!": "مرحبا بكم في قسم الأسئلة الشائعة، أدناه ستجد إجابات على بعض الأسئلة الأكثر شيوعا حول هذا الموقع. إذا كان لديك أي استفسارات أخرى أو تحتاج إلى المزيد من المساعدة، لا تتردد في التواصل معي مباشرة. ملاحظاتك وأسئلتك تلقى الترحيب دائماً!",
  "How does it work?": "طريقة العمل؟",
  "Behind the scenes, this website is the culmination of one year of dedicated effort in reverse-engineering DualShock controllers for fun/hobby from a random guy on the internet.": "خلف الكواليس،هذا الموقع جاء بفضل بسنة من الجهد المتفاني في هندسة العكسية ليد تحكم DualShock من أجل المتعة/الهواية من شخص عشوائي على شبكة الإنترنت.",
  "Through": "عَبْر",
  "this research": "هذه الأبحاث",
  ", it was discovered that there exist some undocumented commands on DualShock controllers that can be sent via USB and are used during factory assembly process. If these commands are sent, the controller starts the recalibration of analog sticks.": " قد اكتشفت أن هناك بعض الأوامر غير الموثّقة على يد تحكم DualShock التي يمكن إرسالها عن طريق USB واستخدامها أثناء عملية التصنيع. إذا تم إرسال هذه الأوامر، ستبدأ يد التحكم في إعادة معايرة العصا.",
  "While the primary focus of this research wasn't initially centered on recalibration, it became apparent that a service offering this capability could greatly benefit numerous individuals. And thus, here we are.": "على الرغم من أن التركيز الأساسي لهذه الأبحاث لم يكن في البداية مركزاً على إعادة المعايرة، وأصبح من الواضح أن القدرة التي توفرها هذه الخدمة يمكن أن تفيد العديد من الاشخاص. وهكذا، ها نحن ها.",
  "Does the calibration remain effective during gameplay on PS4/PS5?": "هل تبقى المعايرة فعالة في أثناء اللعب على PS4/PS5؟",
  "Yes, if you tick the checkbox \"Write changes permanently in the controller\". In that case, the calibration is flashed directly in the controller firmware. This ensures that it remains in place regardless of the console it's connected to.": "نعم، إذا قمت بوضع علامة في مربع الاختيار \"أبقاء الكتابة بشكل دائم على يد التحكم\". في هذه الحالة، يتم تمرير المعايرة مباشرة في برمجيات يد التحكم. وهذا يضمن حفظ المعلومات في يد التحكم بغض النظر عن أي جهاز مرتبطة بها.",
  "Is this an officially endorsed service?": "هل هذه الخدمة معتمدة رسمياً؟",
  "No, this service is simply a creation by a DualShock enthusiast.": "لا، هذه الخدمة ببساطة تعبر عن شغفي وحماسي ليد التحكم.",
  "Does this website detect if a controller is a clone?": "هل يكتشف هذا الموقع ما إذا كانت يد التحكم نسخة مقلدة؟",
  "Yes, only DualShock4 at the moment. This happened because I accidentally purchased some clones, spent time identifying the differences and added this functionality to prevent future deception.": "نعم، فقط DualShock4 في الوقت الراهن. حدث ذلك لأنني اشتريت بعض النسخ المقلدة، وقضيت الوقت لتحديد الاختلافات وأضفت هذه الوظيفة لمنع الغِشّ في المستقبل.",
  "Unfortunately, the clones cannot be calibrated anyway, because they only clone the behavior of a DualShock4 during normal gameplay, not all the undocumented functionalities.": "لسوء الحظ، لا يمكن معايرة النسخ المقلدة على أي حال، لأنها تقلد فقط سلوك DualShock4 في أثناء اللعب العادي، وليس كل وظائفها.",
  "If you want to extend this detection functionality to DualSense, please ship me a fake DualSense and you'll see it in few weeks.": "إذا كنت ترغب في أضافة وظيفة الكشف هذه إلى DualSense، فيرجى شحن نسخ DualSense مقلدة ألي وستراها في غضون بضعة أسابيع.",
  "What development is in plan?": "ما هي التطورات في الخِطَّة؟",
  "I maintain two separate to-do lists for this project, although the priority has yet to be established.": "وأحتفظ بخطتين منفصلتين لهذا المشروع، على الرغْم أنه لم يتم بعد تحديد الأولوية.",
  "The first list is about enhancing support for DualShock4 and DualSense controllers:": "القائمة الأولى تتعلق بتعزيز الدعم لـDualShock4 وDualSense:",
  "Implement calibration of L2/R2 triggers.": "أضافة معايرة لأزرار الـL2/R2.",
  "Improve detection of clones, particularly beneficial for those seeking to purchase used controllers with assurance of authenticity.": "تحسين الكشف عن النسخ المقلدة، مما يعود بفائدة لأولئك الذين يسعون إلى شراء يد تحكم مستعملة للتأكد من جودتها.",
  "Enhance user interface (e.g. provide additional controller information)": "تحسين واجهة المستخدم (مثل توفير معلومات إضافية ليد التحكم)",
  "Add support for recalibrating IMUs.": "إضافة دعم لإعادة معايرة IMUs.",
  "Additionally, explore the possibility of reviving non-functioning DualShock controllers (further discussion available on Discord for interested parties).": "وإضافة إلى ذلك، استكشاف إمكانية تصليح يد تحكم DualShock التي لا تعمل (يوجد ناقشات بشأن لك على الديسكورد للأطراف المهتمة).",
  "The second list contains new controllers I aim to support:": "وتتضمن الخطة الثانية إضافة دعم  ليد تحكم:",
  "DualShock 3": "DualShock 3",
  "XBox Controllers": "يد تحكم الـXBox",
  "Each of these tasks presents both immense interest and significant time investment. To provide context, supporting a new controller typically demands 6-12 months of full-time research, alongside a stroke of good fortune.": "كل من هذه الخطتين تثير اهتماما واستثمارا كبيرا في الوقت على حد سواء. ولتوفير السياق، عادة ما يتطلب دعم يد تحكم جديدة إجراء بحوث على أساس التفرغ لمدة 6-12 شهرا، إلى جانب حظا وافر.",
  "Can I reset a permanent calibration to previous calibration?": "هل يمكنني إعادة تعيين معايرة دائمة إلى المعايرة السابقة؟",
  "No.": "لا.",
  "Can you overwrite a permanent calibration?": "هل يمكنك استبدال معايرة دائمة؟",
  "Yes. Simply do another permanent calibration.": "نعم. ببساطة قم بمعايرة دائمة أخرى.",
  "Does this software resolve stickdrift?": "هل هذا البرنامج يحلّ انحراف العصا؟",
  "Stickdrift is caused by a physical defect; namely dirt, worn potentiometer or in some cases a worn spring.": "انحراف العصا خلل مادي، مثل الأتربة أو تلف في المقاومة المتغيرة أو في بعض الحالات تلف في النابض.",
  "This software will not fix stick drift on its own if you already experience that. What it will help with, is ensuring the new joystick(s) will function properly after replacing the old one(s) to work well with.": "هذا البرنامَج لن يصلح انحراف العصا بنفسه إذا كنت قد واجهت خلل مقدّمًا. سيساعد على ضمان أن تعمل عصا التحكم الجديدة بشكل سليم بعد استبدال العصا القديمة للعمل بشكل جيد.",
  "I have noticed some controllers out of the box have worse factory calibration than if I would recalibrate them. Especially true for circularity of SCUF controllers with a unique shell.": "لاحظت أن بعض ايدي التحكم لديها معايرة مصنع أسوأ مما لو قمت بإعادة معايرتهم. وينطبق ذلك بصفة خاصة على الدوران في ايدي التحكم المقدمة من  SCUF ذو الغطاء المميز.",
  "(Dualsense) Will updating the firmware reset calibration?": "(Dualsense) هل تحديث البرمجيات يسبب إعادة ضبط المعايرة؟",
  "I love this service, it helped me! How can I contribute?": "أحب هذه الخدمة، لقد ساعدتني! كيف يمكنني المساهمة؟",
  "I'm glad to hear that you found this helpful! If you're interested in contributing, here are a few ways you can help me:": "يسعدني أن أسمع أنك وجدت هذه الخدمة مفيدة! إذا كنت مهتما بالمساهمة، إليك بعض الطرق التي يمكنك أن تساعدني:",
  "Consider making a": "فكّر في",
  "donation": "التبرع",
  "Guide": "الدليل",
  "to support my late-night caffeine-fueled reverse-engineering efforts.": "لدعم جهودي في وقت متأخر من الليل في الهندسة العكسية.",
  "Ship me a controller you would love to add (send me an email for organization).": "اشحن لي يد تحكم تريد إضافتها (أرسل لي رسالة بريد إلكتروني).",
  "Translate this website in your language": "ترجمة هذا الموقع بلغتك",
  ", to help more people like you!": "، لمساعدة المزيد من الناس من أمثالك!",
  "SUPPORT &amp; FEEDBACK": "الدعم والاقتراحات",
  "Support &amp; Feedback": "الدعم والاقتراحات",
  "SUPPORT & FEEDBACK": "الدعم والاقتراحات",
  "Adaptive Triggers are only supported on PS5 controllers (DualSense).": "المحفزات التكيفية (Adaptive Triggers) مدعومة فقط في أذرع تحكم PS5 (DualSense).",
  "We are always striving to improve your experience, share your opinion or report a problem.": "نحن نسعى دائماً لتحسين تجربتك، شاركنا رأيك أو أبلغ عن مشكلة.",
  "Full Name": "الاسم بالكامل",
  "E-mail": "البريد الإلكتروني",
  "Inquiry type": "نوع الاستفسار",
  "Report a bug": "الإبلاغ عن مشكلة (Bug)",
  "Request a new feature": "اقتراح ميزة جديدة",
  "General inquiry": "استفسار عام",
  "Calibration problem": "مشكلة في المعايرة",
  "The message": "الرسالة",
  "Explain to us in detail...": "اشرح لنا بالتفصيل...",
  "Send message": "إرسال الرسالة",
  "Return to main page": "العودة للصفحة الرئيسية",
  "My handle on discord is: the_al": "معرفي على ديسكورد هو، the_al",
  "Do you have any suggestion or issue? Drop me a message via email or discord.": "هل لديك أي اقتراح أو مشكلة؟ أرسل لي رسالة عبر البريد الإلكتروني أو عبر discord.",
  "Support this project": "اِدعم هذا المشروع",
  "Hi, thank you for using this software.": "مرحباً، شكراً لك على استخدام هذا البرنامج.",
  "If you're finding it helpful and you want to support my efforts, feel free to": "إذا كنت تجد ذلك مفيداً وترغب في دعم جهودي، لا تتردد في",
  "buy me a coffee": "دعمي ماديًا",
  "! :)": "! :)",
  "Cheers!": "شكرًا!",
  "Have a nice day :)": "أتمنى لك يومًا سعيدًا :)",
  "Just few things to know before you can start:": "بعض الأشياء التي يجب أن تعرفها قبل أن تبدأ",
  "Keep the internal battery of the controller connected and ensure it is well charged. If the battery dies during operations, the controller will be damaged and rendered unusable.": "ابقي البطارية الداخلية ليد التحكم متصلة وتحقق أنها مشحونة بشكل جيد. وإذا نفذ شحن البطارية في أثناء العمليات، فإن يد التحكم ستتعرض للتلف وستصبح غير قابلة للاستعمال.",
  "Before doing the permanent calibration, try the temporary one to ensure that everything is working well.": "قبل إجراء المعايرة الدائمة، جرب المعايرة المؤقتة لضمان أن يعمل كل شيء بشكل جيد.",
  "Understood": "مفهوم",
  "Welcome to the Calibration GUI": "مرحباً بك في Calibration GUI",
  "You can check the calibration with the": "يمكنك التحقق من المعايرة من خلال",
  "_comment_legal": "=== LEGAL & COOKIES ===",
  "Terms and Conditions": "الشروط والأحكام",
  "1. Acceptance of Terms": "1. قبول الشروط",
  "By accessing and using AB Control Hub, you accept and agree to be bound by the terms and provision of this agreement.": "من خلال الوصول إلى AB Control Hub واستخدامه، فإنك تقبل وتوافق على الالتزام بشروط وأحكام هذه الاتفاقية.",
  "2. Disclaimer of Warranty": "2. إخلاء المسؤولية من الضمان",
  "The software is provided \"as is\", without warranty of any kind. Calibration operations involve writing to the controller's firmware. While this tool is tested, the user assumes all risks associated with firmware modifications.": "يتم توفير البرنامج \"كما هو\"، دون أي ضمان من أي نوع. تتضمن عمليات المعايرة الكتابة على البرنامج الثابت (Firmware) لذراع التحكم. بينما تم اختبار هذه الأداة، يتحمل المستخدم جميع المخاطر المرتبطة بتعديلات البرنامج الثابت.",
  "3. Limitation of Liability": "3. حدود المسؤولية",
  "AB Control Hub and its developer shall not be liable for any damages, including but not limited to controller damage, data loss, or bricked devices resulting from the use or inability to use this tool.": "لن تكون AB Control Hub ومطورها مسؤولين عن أي أضرار، بما في ذلك على سبيل المثال لا الحصر تلف ذراع التحكم، أو فقدان البيانات، أو تعطل الأجهزة الناتج عن استخدام أو عدم القدرة على استخدام هذه الأداة.",
  "4. Use at Your Own Risk": "4. الاستخدام على مسؤوليتك الخاصة",
  "Calibration is a sensitive process. Ensure your controller is connected via a stable USB cable and has sufficient battery charge before proceeding with permanent changes.": "المعايرة عملية حساسة. تأكد من توصيل ذراع التحكم عبر كابل USB مستقر وأن البطارية مشحونة بشكل كافٍ قبل المتابعة في إجراء تغييرات دائمة.",
  "5. Intellectual Property": "5. الملكية الفكرية",
  "AB Control Hub is an independent tool and is not affiliated with, endorsed by, or associated with Sony Interactive Entertainment, PlayStation, or any of its subsidiaries.": "AB Control Hub هي أداة مستقلة وليست تابعة لـ Sony Interactive Entertainment أو PlayStation أو أي من الشركات التابعة لها، ولا معتمدة منها.",
  "Introduction": "مقدمة",
  "At AB Control Hub, your privacy is our top priority. This Privacy Policy explains how we handle your data when you use our web-based controller calibration tool.": "في AB Control Hub، خصوصيتك هي أولويتنا القصوى. تشرح سياسة الخصوصية هذه كيفية تعاملنا مع بياناتك عند استخدام أداة معايرة ذراع التحكم المستندة إلى الويب.",
  "Local Processing (No Data Collection)": "المعالجة المحلية (لا يوجد جمع للبيانات)",
  "AB Control Hub does not collect, store, or transmit any personal data.": "لا يقوم AB Control Hub بجمع أو تخزين أو نقل أي بيانات شخصية.",
  "All communication with your controller happens locally on your device using the WebHID API. Your button presses, stick movements, and controller serial numbers never leave your browser.": "تتم جميع الاتصالات مع ذراع التحكم محلياً على جهازك باستخدام WebHID API. ضغطات الأزرار، وحركات العصا، والأرقام التسلسلية لذراع التحكم لا تغادر متصفحك أبداً.",
  "Cookies": "ملفات تعريف الارتباط (Cookies)",
  "We use essential cookies only to store your preferences, such as your selected language and whether you have accepted our terms. These cookies are stored locally on your device.": "نحن نستخدم ملفات تعريف الارتباط الأساسية فقط لتخزين تفضيلاتك، مثل لغتك المختارة وما إذا كنت قد قبلت شروطنا. يتم تخزين هذه الملفات محلياً على جهازك.",
  "Third-Party Services": "خدمات الطرف الثالث",
  "We may use basic analytics (like Google Analytics) to understand how the site is used and improve the service. These services may collect anonymous data such as your browser type and general location (country), but no personally identifiable information.": "قد نستخدم تحليلات أساسية (مثل Google Analytics) لفهم كيفية استخدام الموقع وتحسين الخدمة. قد تجمع هذه الخدمات بيانات مجهولة مثل نوع المتصفح وموقعك العام (الدولة)، ولكن لا تجمع أي معلومات شخصية.",
  "Changes to This Policy": "تغييرات على هذه السياسة",
  "We may update our Privacy Policy from time to time. We will notify you of any changes by posting the new Privacy Policy on this page.": "قد نقوم بتحديث سياسة الخصوصية الخاصة بنا من وقت لآخر. سنخطرك بأي تغييرات عن طريق نشر سياسة الخصوصية الجديدة على هذه الصفحة.",
  "Last Updated: January 14, 2026": "آخر تحديث: 14 يناير 2026",
  "This website is not affiliated with Sony, PlayStation &amp; co.": "هذا الموقع غير مرتبط بـ Sony، PlayStation &amp; co.",
  "This service is provided without warranty. Use at your own risk.": "هذه الخدمة مقدمة دون ضمان. استخدمها على مسؤوليتك.",
  "This website uses analytics to improve the service.": "يستخدم هذا الموقع التحليلات لتحسين الخدمة.",
  "Cookie Banner Text": "يستخدم هذا الموقع ملفات تعريف الارتباط لضمان حصولك على أفضل تجربة على موقعنا.",
  "Accept": "قبول",
  "Developer": "المبرمج",
  "Facebook": "فيسبوك",
  "Instagram": "إنستجرام",
  "Telegram": "تيليجرام",
  "WhatsApp": "واتساب",
  "Developer Info": "بيانات المطور",
  "Please do not close this window and do not disconnect your controller.": "من فضلك لا تغلق هذه النافذة ولا تفصل ذراع التحكم.",
"EXPERIMENTAL": "تجريبي",
"Support for calibrating DualSense Edge stick modules is now available as an experimental feature.": "دعم معايرة وحدات DualSense Edge متاح الآن كميزة تجريبية.",
"Please note: the stick modules on the DS Edge <b class=\"text-cyan\">cannot be calibrated via software alone</b>.": "يرجى ملاحظة: وحدات الأنالوج في DS Edge <b class=\"text-cyan\">لا يمكن معايرتها عبر السوفتوير فقط</b>.",
"To store a custom calibration on the stick's internal memory, a <b class=\"text-magenta\">hardware modification</b> is required.": "لحفظ المعايرة المخصصة على الذاكرة الداخلية للأنالوج، يلزم إجراء <b class=\"text-magenta\">تعديل هاردوير</b>.",
"This involves temporarily disabling write protection by applying <b class=\"text-white\">+1.8V</b> to a specific test point on each module.": "يتضمن ذلك تعطيل حماية الكتابة مؤقتاً عن طريق توصيل <b class=\"text-white\">+1.8V</b> بنقطة اختبار محددة على كل وحدة.",
"If you're not sure what you're doing, please do not attempt it.": "إذا لم تكن متأكداً مما تفعله، من فضلك لا تحاول القيام بذلك.","Support": "دعم",
  "Support Development": "دعم التطوير",
  "Your support helps keep this project alive and free for everyone!": "دعمك يساعد في استمرار هذا المشروع مجاناً للجميع!",
  "Egypt (Local)": "مصر (محلي)",
  "International": "دولي",
  "Vodafone Cash": "فودافون كاش",
  "InstaPay (Number)": "انستا باي (رقم)",
  "InstaPay (Username/Number)": "انستا باي (اسم مستخدم/رقم)",
  "Bank Transfer (IBAN)": "تحويل بنكي (IBAN)",
  "Space for Ad":  "مساحة إعلانية",
  "Triggers (PS5 Only)": "المشغلات (PS5 فقط)",
  "The Technical Guide to Controller Calibration": "الدليل التقني الشامل لمعايرة ذراع التحكم",
  "Deep dive into Analog Stick Drift, WebHID Technology, and Hardware Diagnostics.": "غوص عميق في مشاكل انحراف الأنالوج (Drift)، تقنية WebHID، وتشخيص الهاردوير.",
  "<i class=\"fas fa-microchip me-2\"></i> 1. The Science Behind Stick Drift": "<i class=\"fas fa-microchip me-2\"></i> 1. العلم وراء انحراف العصا (Stick Drift)",
  "What is a Potentiometer?": "ما هو مقياس الجهد (Potentiometer)؟",
  "Most modern controllers (DualSense, DualShock 4, Xbox) use <strong>ALPS analog stick modules</strong>. These modules rely on two potentiometers—one for the X-axis (horizontal) and one for the Y-axis (vertical). A potentiometer is essentially a variable resistor that uses a physical wiper blade sliding across a carbon track to read position.": "تستخدم معظم أذرع التحكم الحديثة (DualSense, DualShock 4, Xbox) <strong>وحدات أنالوج من نوع ALPS</strong>. تعتمد هذه الوحدات على مقياسين للجهد (Potentiometers)—واحد للمحور السيني X (أفقي) وواحد للمحور الصادي Y (رأسي). مقياس الجهد هو في الأساس مقاومة متغيرة تستخدم شفرة ماسحة تتحرك عبر مسار كربوني لقراءة الموقع.",
  "Why Does Drift Occur?": "لماذا يحدث الانحراف (Drift)؟",
  "Every time you move the stick, friction occurs. Over hundreds of hours of gameplay (like Call of Duty or FIFA), this friction causes two things:": "في كل مرة تحرك فيها الأنالوج، يحدث احتكاك. بعد مئات الساعات من اللعب (مثل Call of Duty أو FIFA)، يسبب هذا الاحتكاك شيئين:",
  "<strong>Wear of the Carbon Track:</strong> The resistive material wears down, changing the electrical resistance values.": "<strong>تآكل المسار الكربوني:</strong> تتآكل المادة المقاومة، مما يغير قيم المقاومة الكهربائية.",
  "<strong>Dust Accumulation:</strong> Conductive dust from the wear process can settle on the tracks, causing \"jitter\" or erratic signals.": "<strong>تراكم الغبار:</strong> يمكن للغبار الموصل الناتج عن التآكل أن يستقر على المسارات، مما يسبب \"رعشة\" أو إشارات غير منتظمة.",
  "When this happens, the controller reports that the stick is moving (e.g., Value +15) even when it is physically centered (Value 0). This is <strong>Stick Drift</strong>.": "عندما يحدث هذا، يرسل الكنترولر إشارة بأن العصا تتحرك (مثلاً قيمة +15) حتى وهي في المنتصف تماماً (قيمة 0). هذا هو <strong>انحراف العصا (Stick Drift)</strong>.",
  "The AB Control Hub Solution:": "الحل من AB Control Hub:",
  "Since we cannot physically repair the carbon track via software, our tool uses <strong>Firmware Level Calibration</strong>. We calculate the exact error offset of your drifted stick and write a new \"Center Point\" to the controller's permanent memory (NVS). This forces the controller to mathematically ignore the drift.": "بما أننا لا نستطيع إصلاح المسار الكربوني فيزيائياً عبر البرمجيات، تستخدم أداتنا <strong>معايرة على مستوى الفيرموير</strong>. نقوم بحساب مقدار خطأ الانحراف بدقة ونكتب \"نقطة مركز\" جديدة في الذاكرة الدائمة (NVS) لذراع التحكم. هذا يجبر الذراع رياضياً على تجاهل الانحراف.",
  "<i class=\"fas fa-network-wired me-2\"></i> 2. How WebHID Changes the Game": "<i class=\"fas fa-network-wired me-2\"></i> 2. كيف غيرت تقنية WebHID قواعد اللعبة",
  "Historically, calibrating a controller required downloading executable files (.exe), installing drivers, and risking viruses. <strong>AB Control Hub</strong> is built on the <strong>WebHID API</strong> (Web Human Interface Device), a cutting-edge browser standard.": "تاريخياً، كانت معايرة الذراع تتطلب تحميل ملفات تنفيذية (.exe)، وتثبيت تعريفات، ومخاطرة بالفيروسات. تم بناء <strong>AB Control Hub</strong> على <strong>WebHID API</strong>، وهو معيار متصفح متطور.",
  "Technical Advantages": "المزايا التقنية",
  "<strong>Direct Hardware Access:</strong> The browser communicates directly with the USB/Bluetooth HID Report Descriptors. This allows for millisecond-level precision in reading input lags.": "<strong>وصول مباشر للهاردوير:</strong> يتواصل المتصفح مباشرة مع واصفات تقارير HID عبر USB/Bluetooth. هذا يسمح بدقة تصل للميلي ثانية في قراءة تأخير الإدخال (Input Lag).",
  "<strong>Sandboxed Security:</strong> Unlike native apps, a website cannot read your files or access other hardware without explicit permission. This makes AB Control Hub significantly safer than downloading random tools.": "<strong>أمان الصندوق الرملي (Sandboxed):</strong> على عكس البرامج المثبتة، لا يمكن للموقع قراءة ملفاتك أو الوصول لأجهزة أخرى دون إذن صريح. هذا يجعل AB Control Hub أكثر أماناً بكثير من تحميل أدوات عشوائية.",
  "<strong>Cross-Platform:</strong> The underlying JavaScript code runs identically on Windows, macOS, Linux, and Android.": "<strong>متعدد المنصات:</strong> يعمل كود JavaScript الأساسي بشكل متطابق على Windows و macOS و Linux و Android.",
  "<i class=\"fas fa-search me-2\"></i> 3. Detecting Counterfeit Controllers": "<i class=\"fas fa-search me-2\"></i> 3. كشف أذرع التحكم المقلدة (Copy)",
  "The market is flooded with \"High Copy\" controllers. While they look identical to the original Sony DualSense, their internals are vastly inferior. Use our tool to spot them:": "السوق مليء بأذرع تحكم \"High Copy\". بينما تبدو مطابقة لـ Sony DualSense الأصلية، فإن مكوناتها الداخلية رديئة جداً. استخدم أداتنا لكشفها:",
  "The Circularity Test": "اختبار الدائرية (Circularity Test)",
  "Switch the joystick visualizer to <strong>\"Circularity Mode\"</strong>. Rotate your stick in a perfect circle.": "قم بتبديل عارض الجويستيك إلى <strong>\"Circularity Mode\"</strong>. قم بتدوير العصا في دائرة كاملة.",
  "<strong>Original:</strong> Average error is typically <strong>8% - 12%</strong>. The movement is smooth.": "<strong>الأصلي:</strong> نسبة الخطأ عادة ما تكون <strong>8% - 12%</strong>. الحركة تكون ناعمة وسلسة.",
  "<strong>Fake:</strong> Average error often exceeds <strong>20%</strong>. The shape may look like a square (diamond) rather than a circle, indicating cheap non-linear potentiometers.": "<strong>المقلد:</strong> نسبة الخطأ غالباً تتجاوز <strong>20%</strong>. الشكل قد يبدو كمربع (ماسي) بدلاً من دائرة، مما يدل على استخدام مقاومات رخيصة غير خطية.",
  "The Polling Rate &amp; Input Lag": "معدل الاستجابة وتأخير الإدخال (Input Lag)",
  "Original controllers via USB typically have a stable polling rate (e.g., 250Hz or 1000Hz depending on overclock). Fake controllers often have unstable polling rates, leading to input lag spikes visible in our graph.": "الأذرع الأصلية عبر USB تتميز بمعدل استجابة مستقر (مثل 250Hz أو 1000Hz). الأذرع المقلدة غالباً ما تعاني من عدم استقرار، مما يؤدي لتقطيع وتأخير يظهر في الرسم البياني.",
  "<i class=\"fas fa-sliders-h me-2\"></i> 4. Step-by-Step Calibration": "<i class=\"fas fa-sliders-h me-2\"></i> 4. المعايرة خطوة بخطوة",
  "Important:": "هام جداً:",
  "Ensure your controller is sufficiently charged and the cable is stable. Do not disconnect during the \"Save\" process.": "تأكد من شحن الذراع بشكل كافٍ وأن الكابل مستقر. لا تقم بفصل الذراع أثناء عملية \"الحفظ\".",
  "Method A: Center Calibration (Drift Fix)": "الطريقة أ: معايرة المركز (إصلاح الدريفت)",
  "This fixes sticks that move on their own.": "هذا يصلح العصي التي تتحرك من تلقاء نفسها.",
  "Go to the <strong>Calibration</strong> tab.": "اذهب إلى تبويب <strong>Calibration</strong>.",
  "Click <strong>\"Center Calibration\"</strong>.": "اضغط على <strong>\"Center Calibration\"</strong>.",
  "Follow the prompt: Rotate both sticks 3 times fully, then let go.": "اتبع التعليمات: قم بتدوير العصوين 3 مرات كاملة، ثم اتركهما.",
  "The tool will calculate the offset and apply it.": "ستقوم الأداة بحساب نسبة الخطأ وتصحيحها.",
  "Method B: Range Calibration (Deadzone Fix)": "الطريقة ب: معايرة النطاق (إصلاح المناطق الميتة)",
  "This fixes sticks that don't reach full speed (e.g., character runs slowly).": "هذا يصلح العصي التي لا تصل للسرعة القصوى (مثلاً اللاعب يجري ببطء).",
  "Click <strong>\"Range Calibration\"</strong>.": "اضغط على <strong>\"Range Calibration\"</strong>.",
  "Rotate the sticks to their absolute maximum limits in all directions.": "قم بتدوير العصي لأقصى حدودها الممكنة في جميع الاتجاهات.",
  "The tool expands the internal mapping to ensure 100% output at the edges.": "تقوم الأداة بتوسيع التعيين الداخلي لضمان وصول الإشارة لـ 100% عند الحواف.",
  "Triggers (PS5)": "المشغلات (PS5)",
  "Device Details": "تفاصيل الجهاز",
  "Device Name": "اسم الجهاز",
  "Battery Level": "مستوى البطارية",
  "Status": "الحالة",
  "No additional info available": "لا توجد معلومات إضافية",
  "Unknown Device": "جهاز غير معروف",
  "Connection Type": "نوع الاتصال",
  "Firmware Version": "إصدار النظام",
  "Advertising and Third-Party Cookies": "الإعلانات وملفات تعريف الارتباط للطرف الثالث",
  "Last Updated: January 18, 2026": "آخر تحديث: 18 يناير 2026",
  "Microphone test initiated - check your OS audio settings for input signal": "تم بدء اختبار الميكروفون - تحقق من إعدادات الصوت في نظام التشغيل الخاص بك بحثًا عن إشارة الإدخال",
  "We use third-party vendors, including Google, to serve ads based on your prior visits to our website or other websites.": "نستخدم موردين خارجيين، بما في ذلك Google، لعرض الإعلانات بناءً على زياراتك السابقة لموقعنا أو لمواقع أخرى.",
  "Google's use of advertising cookies enables it and its partners to serve ads to you based on your visit to <strong>AB Control Hub</strong> and/or other sites on the Internet.": "استخدام Google لملفات تعريف ارتباط الإعلانات يمكنها وشركاءها من عرض الإعلانات لك بناءً على زيارتك لـ <strong>AB Control Hub</strong> و/أو مواقع أخرى على الإنترنت.",
  "You may opt out of personalized advertising by visiting <a href=\"https://www.google.com/settings/ads\" target=\"_blank\" style=\"color: var(--glow-cyan);\">Google Ads Settings</a>.": "يمكنك إلغاء الاشتراك في الإعلانات المخصصة بزيارة <a href=\"https://www.google.com/settings/ads\" target=\"_blank\" style=\"color: var(--glow-cyan);\">إعدادات إعلانات Google</a>.",
  "Currently, we use <strong>Google Analytics</strong> to analyze traffic. This service transmits website traffic data to Google servers. We use this data strictly to monitor service stability and user demographics to improve the tool.": "حالياً، نستخدم <strong>Google Analytics</strong> لتحليل الزيارات. ترسل هذه الخدمة بيانات حركة المرور إلى خوادم Google. نستخدم هذه البيانات فقط لمراقبة استقرار الخدمة وتحسين الأداة."
}